["MSME Taxation Guide - Cleaned Version  \nTaxation of Indian MSMEs: A Comprehensive Guide.  \nIndian Micro, Small, and Medium Enterprises (MSMEs) form the backbone of the economy. This guide provides a \ndetailed overview of all tax aspects relevant to MSMEs – covering direct taxesand indirect taxes (GST), compliance \nrequirements, special schemes, penalties for non -compliance, and r . \ntory updates. It is organized for clarity with short sections, bullet points, and clear headings, making it easy to scan \nand refe rence.  \nUnderstanding MSME Categories and Taxation.  \nMSME Classification: Under the MSME Development Act, enterprises are classified by investment in plant & \nmachinery/equipment and annual turnover. As of 2020, the criteria were: Micro – investment up to Rs. 1 crore and \nturnover up to Rs.5 crore; Small – investment up to Rs.10 crore and turnover up to Rs.50 crore; Medium – \ninvestment up to Rs.50 crore and turnover up to Rs.250 crore. In Union Budget 2025, the government announced a \nrevised MSME definition with  significantly higher limits (investment limits 2.5× and turnover limits 2× the \nprevious values). Once enacted (Finance Act 2025), Micro enterprises will be defined as investment up to Rs.2.5 \ncrore and turnover up to Rs.10 crore, Small up to Rs.25 crore in vestment and Rs.100 crore t urnover up to Rs.50 \ncrore.  \nMedium investment up to Rs.125 crore investment and Rs.500 crore turnover. This expanded definition allows \ngrowing businesses to retain MSME status (and related benefits) for longer.  \nRelevance to Taxat ion: The MSME classification itself does not create separate income tax slabs or GST rates. \nMSMEs are generally subject to the same tax laws as other businesses. However, many tax provisions and \ncompliance thresholds are designed to benefit smaller busines ses, which effectively align with MSME sizes. For \nexample, presumptive taxation schemes, higher thresholds for tax audits, GST composition schemes, and certain \nstartup tax exemptions are targeted at small enterprises. Moreover, the government uses MSME cri teria to extend \nspecific reliefs (like delayed payment provisions) and design policy support. In summary, while an MSME pays \ntaxes under normal tax rules, being in the MSME category often makes the enterprise eligible for simplified \nschemes, lower complian ce burdens, or tax incentives aimed at supporting small businesses.  \nDirect Taxes on MSMEs (Income Tax).  \nMSMEs in India can be structured in various legal forms – sole proprietorships, partnership firms (including LLPs), \nor private limited companies. Direct  tax rules (income tax) vary based on the foss. Below we cover applicable tax \nrates (slabs), presumptive taxation schemes for small taxpayers, filing requirements for different entities, Tax \nDeducted at Source (TDS) obligations, key deadlines with interest /late fees, and tax audit provisions.  \nIncome Tax Rates for MSME Businesses.  \nSole Proprietors (Individuals): A proprietorship’s income is taxed in the hands of the individual owner. Individual \ntax slabs apply – which are progressive rates based on income. U nder the regular (old) regime for FY 2024 -25, \nincome up to Rs.2.5 lakh is tax -free, then 5% on Rs.2.5 –5 lakh, 20% on Rs.5 –10 lakh, and 30% beyond Rs.10 lakh \n(with rebates for low incomes). Alternatively, individuals can opt for the new income tax regime (l ower rates with \nno deductions) – for FY 2024 -25 this has slabs of 0% up to . \nn Rs.3 –6 lakh, 10% on Rs.6 –9 lakh, 15% on Rs.9 –12 lakh, 20% on Rs.12 –15 lakh, and 30% above Rs.15 lakh. The \nnew regime was made more attractive in recent budgets (e.g. full tax re bate for income up to Rs.7 lakh, and in \nBudget 2025 further relief for income up to ~Rs.12.75 lakh in the new regime). Most MSME proprietors have the \noption to choose the regime that minimizes their tax; many continue with the old regime if they can claim \ndeductions for business expenses, while some may opt for the new simplified regime depending on their situation. \nAll individual MSME owners, however, enjoy basic slab exemptions unlike companies or firms.  \nPartnership Firms and LLPs: A partnership firm or L LP is taxed as a separate entity at a flat 30% rate on its taxable \nprofits. There are no slab rates for firms – the first rupee of profit is taxed at 30%. Surcharge of 12% applies if \nincome exceeds Rs.1 crore, and health & education cess 4% applies on tax plus surcharge. Notably, firms cannot \nuse the individual slab rates; the 30% flat rate applies irrespective of being “small” or “large.” However, \npartnership firms (including LLPs) can reduce taxable income by paying remuneration or interest to partners \nwithin limits – those payments are deductible to the firm and then taxed in the hands of partners. Also, if a \npartnership/LLP claims certain deductions (like startup tax holiday under 80 -IAC), it may trigger Alternate \nMinimum Tax (AMT) at 18.5% (similar to M AT for companies). In general, though, 30% is the effective tax rate for \nmost MSME firms.  \nPrivate Limited Companies: Domestic companies in India have distinct tax rate options. As of current law, standard \ncorporate tax rates are 25% or 30% (plus cess/surch arge) depending on turnover, with special concessional \nregimes available:  \nStandard Rate: 25% base tax for companies whose turnover did not exceed Rs.400 crore in a recent year (FY 2020 -\n21); otherwise 30% for larger companies. Most MSMEs fall under the lowe r 25% bracket due to their modest \nturnover. These rates are before surcharge (7% if income > Rs.1 crore, 12% if > Rs.10 crore) and cess 4%.  \nOptional Concessional Regimes: The government introduced beneficial tax regimes under the Income Tax Act:  \nSection 11 5BAA: An existing domestic company can opt for a 22% tax rate (effective ~25.17% with surcharge and \ncess), provided it foregoes certain exempt . \ns. This is popular as it offers a low flat rate and exempts the company from Minimum Alternate Tax (MAT). Many \nMSME companies have adopted 22% rate for simplicity.  \nSection 115BAB: New manufacturing companies (incorporated after Oct 2019, commencing production by a \nspecified date) can opt for a 15% tax rate (effective ~17.16% with surcharge/cess). This super -low rat e was to \nencourage new industrial start -ups. Only eligible manufacturing MSMEs can use this, and they too must forego \nmost exemptions.  \n(Older regime Section 115BA at 25% for certain manufacturing cos is largely subsumed by 115BAB.).  \nThus, MSME companies ca n have very low tax rates if they qualify and opt for these regimes. Otherwise, the default \nis 25% for most. For example, a small domestic company with Rs.5 crore profit that doesn’t avail exemptions can \npay tax at 22% under Section 115BAA. Companies under  any regime also pay 4% cess, and if not in 115BAA/BAB, \npay surcharge at 7%/12% on high incomes. Unlike individuals, companies do not get a basic exemption slab – \nevery rupee of profit is taxed (but the low rates compensate).  \nSummary: In practice, a micro/ small MSME sole proprietor might pay no tax on initial income (due to slabs), a \npartnership/LLP pays 30% flat from the first rupee of profit, and a small company likely pays 22% or 25% tax. The \nchoice of business form thus affects the tax outgo and should be considered in MSME tax planning.  \nPresumptive Taxation Schemes (Sections 44AD, 44ADA, 44AE).  \nTo ease compliance for small taxpayers, the Income Tax Act provides presumptive taxation schemes – allowing \nMSMEs to pay tax on a deemed profit without maintaini ng detailed accounts. These are extremely beneficial for \ntiny businesses, professionals, and transporters. The key presumptive provisions are:  \nSection 44AD (Presumptive Taxation for Small Businesses).  \nSection 44AD of the Income Tax Act provides a presumpti ve taxation scheme for small businesses to simplify tax \ncompliance. It is available to resident individuals, Hindu Undivided Families (HUFs), and partnership firms \n(excluding LLPs) engaged in eligible businesses. To qualify, the annual turnover or gross re ceipts of the business \nmust not exceed Rs.2 crore. However, the Finance Act 2023 has extended this limit to Rs.3 crore, provided that at \nleast 95% of the receipts are through digital modes or banking channels, encouraging a move towards a cashless \neconomy.  \nUnder Section 44AD, the taxpayer can declare 8% of the turnover or gross receipts as deemed profits. If the \nbusiness receipts are received via electronic modes such as bank transfers, UPI, debit or credit cards, or other \nprescribed digital methods, the pr esumed income can be calculated at 6% instead of 8%. The taxpayer opting for \nthis scheme is not required to maintain detailed books of accounts as specified under Section 44AA, nor is an audit \nunder Section 44AB required, provided the scheme’s conditions a re satisfied.  \nFor instance, if a small retailer has annual sales of Rs.80 lakh and all receipts are through digital modes, they can \ndeclare 6% of Rs.80 lakh, i.e., Rs.4.8 lakh, as taxable income, regardless of their actual profit or loss for the year. No \nadditional business expenses can be deducted from the presumptive income once declared. The deemed income is \nconsidered final and taxable, subject only to standard deductions (like Section 80C, 80D, etc.) available to \nindividuals.  \nAn important compliance requirement under Section 44AD is that the taxpayer must pay the entire advance tax \nliability in one installment by March 15 of the financial year. Unlike regular businesses, quarterly advance tax \ninstallments are not mandatory under the presumptive scheme , but full payment must be made before the year -\nend to avoid interest under Sections 234B and 234C.  \nAnother critical rule is regarding the continuity of the scheme. If a taxpayer who has opted for Section 44AD \nchooses to declare profits lower than the pres umptive rates in any year and does not meet the basic exemption \nlimit, they must maintain regular books of account and get them audited. Furthermore, if a taxpayer opts out of \nSection 44AD in any assessment year after opting for it, they are barred from re -opting for the presumptive scheme \nfor the next five assessment years. This restriction is intended to prevent misuse of the scheme by businesses \nshifting between presumptive and regular taxation year after year to optimize tax liability.  \nThe Finance Act 2 023 amendment, which raises the turnover limit from Rs.2 crore to Rs.3 crore for businesses \nwith predominantly digital receipts, is a significant move aimed at promoting formalization and transparency in \nsmall businesses. It allows more businesses engaged in cashless transactions to avail themselves of the \npresumptive taxation benefits without the burden of extensive accounting and auditing.  \nSection 44ADA was introduced in 2016 to extend the benefits of presumptive taxation to small professional \npractitione rs, such as doctors, lawyers, architects, engineers, accountants, interior decorators, technical \nconsultants, and similar specified professionals. This scheme is applicable to resident individuals and partnership \nfirms (excluding LLPs) engaged in eligible professions whose gross receipts do not exceed Rs.50 lakh in a financial \nyear. In line with recent updates, if the cash receipts do not exceed 5% of total receipts, the turnover limit for \neligibility under Section 44ADA has been enhanced to Rs.75 lakh. Thi s move aims to promote digital transactions \nand widen the scheme's coverage.  \nUnder Section 44ADA, 50% of the gross receipts are deemed as profits and taxable income. The professional opting \nfor this scheme does not have to maintain detailed books of accoun ts or ledgers of expenses. For example, if a \nfreelance IT consultant earns Rs.30 lakh in a year, they can simply declare Rs.15 lakh (50% of gross receipts) as \ntheir taxable income, regardless of actual expenses incurred. No additional business expenses are  permitted to be \ndeducted once the presumptive rate is adopted.  \nHowever, the taxpayer is free to voluntarily declare a higher income if their actual profits exceed 50% of receipts. \nOn the other hand, if a professional wishes to declare income lower than th e presumptive 50%, they must maintain \nregular books of accounts and get them audited under Section 44AB if their income exceeds the basic exemption \nlimit. This ensures that the presumptive route is not misused to artificially lower tax liabilities. The rec ent increase \nin the turnover threshold to Rs.75 lakh, provided that cash receipts are minimal, aligns Section 44ADA more \nclosely with Section 44AD and encourages greater formalization among professionals.  \nSection 44AE (Presumptive Taxation for Transporters ). \nSection 44AE provides a simplified presumptive taxation scheme for small transport operators who own up to 10 \ngoods carriages at any time during the financial year. It offers an easy method to compute taxable income without \nthe burden of maintaining com plex books of accounts or undergoing audits, thus catering to the practical \nchallenges faced by small truck operators.  \nThe scheme prescribes fixed monthly income rates based on the type of vehicle owned. For heavy goods vehicles, \nwhich are defined as vehic les with a gross vehicle weight exceeding 12,000 kilograms, the presumptive income is \ncalculated as Rs.1,000 per ton of gross vehicle weight for every month (or part of the month) of ownership during \nthe year. For example, if a transporter owns a 15 -ton tr uck for the full year, the deemed profit would be Rs.1,000 \nmultiplied by 15 tons, further multiplied by 12 months, resulting in a total presumptive income of Rs.1,80,000.  \nFor other goods vehicles, commonly referred to as light goods vehicles (with a gross vehicle weight of up to 12,000 \nkilograms), the presumptive income is Rs.7,500 per vehicle for every month of ownership. For instance, a fleet \nowner with three small trucks owned throughout the year would compute taxable income as 3 vehicles multiplied \nby R s.7,500 per vehicle per month multiplied by 12 months, resulting in Rs.2,70,000 of deemed profit. The total \npresumptive income under Section 44AE is aggregated for all eligible vehicles owned by the taxpayer.  \nOnce the income is determined under Section 44A E, no further deductions are allowed for expenses related to fuel, \nmaintenance, insurance, driver salaries, or any other operational costs. The income calculated is final for taxation \npurposes. Transporters opting for Section 44AE are exempted from the req uirement of maintaining detailed books \nof accounts and from getting a tax audit conducted, regardless of their total turnover.  \nSimilar to other presumptive schemes, taxpayers under Section 44AE must pay the entire advance tax liability in a \nsingle installm ent by March 15 of the financial year. If the taxpayer claims that their actual income is lower than \nthe deemed income computed under Section 44AE, they are required to maintain proper books of accounts and \nundergo a tax audit under Section 44AB, provided their total income exceeds the basic exemption limit.  \nSection 44AE has proven to be a boon for small truckers and transport operators who often find it difficult to \nmaintain detailed financial records. It provides a simple and predictable taxation framewor k, and often results in \nlower taxable income compared to actual profits, particularly for those with newer vehicles or those who have \nheavy loan repayments, where the effective net profit might otherwise be higher than Rs.7,500 per month per \nvehicle.  \nBenef its of Presumptive Schemes: By using sections 44AD, 44ADA, or 44AE, MSMEs avoid the burden of \nbookkeeping and audit, pay taxes on a reasonable estimate . \nd get peace of mind on compliance9L471 -L4789L479 -L487. These schemes significantly reduce compliance c osts \nand are highly popular among micro enterprises and independent professionals. They also free up entrepreneurs’ \ntime to focus on business rather than paperwork.  \nNote: An MSME can opt in or out of presumptive scheme based on its circumsta . \nome restrict ions). While presumptive taxation simplifies income declaration, it’s optional – businesses with low \nactual profit margins might choose to maintain accounts and show actual income if it’s lower than the presumptive \nbenchmark (though they’d need an audit if  they do so and have taxable income). For many small traders and \nservice providers with moderate margins, however, the presumptive percentage (6 . \n%) is quite reasonable and sometimes even lower than actual profit, yielding tax savings9L487 -L495. Always \nevaluate the 5 -year lock -in rule (for 44AD) and whether you might seek bank loans (banks sometimes prefer \ndetailed books) when deciding to opt for presumptive taxation.  \nFiling Requirements for Different Types of MSMEs.  \nDepending on the legal form of the MSME , income tax return (ITR) filing requirements and compliance obligations \ndiffer. Below is an overview:  \nProprietorship (Individual Business): The proprietor files taxes as an individual (no separate business tax return). \nIf the business income is small and presumptive tax is used, the proprietor can file ITR -4 (Sugam), a simplified \nreturn form. Otherwise, they file the standard ITR -3 for business/professional income. Due date: If books are not \nrequired to be audited, the due date is July 31 of the assessment  year (for FY 2024 -25, due by July 31, 2025)9L521 -\nL529. If the proprietorship’s accounts **requi . \ne.g. turnover above Rs.1 crore and not using 44AD, or profit below presumptive rate), then the due date extends to \nOctober 31. The individual must also report all other personal income (if any) in the same return. * . \nProprietors should maintain books of account if not under presumptive scheme (section 44AA requires \nmaintenance of books if income > Rs.2.5 lakh or turnover > Rs.25 lakh). However, many micr o proprietors avail \npresumptive schemes to avoid this. A proprietor is also subject to personal advance tax obligations if tax liability \nexceeds Rs.10,000 (though presumptive taxpayers under 44AD/ADA have an exception of paying i . \n. \nch 15).  \nPartnership F irm (Including LLP): The firm/LLP must file a separate return ITR -5 reporting its business income. \nThere are no slab benefits – the firm’s entire profit is taxed at 30%. Due date: If the firm’s accounts are not \nrequired to be audited, the due date is July 31; if audit is required, due date is October 31 (for AY 2025 -26, audit \nreport has to be obtained by Sept 30 and return by Oct 31). In practice, many partnership firms cross the audit \nthreshold or voluntarily get audited, so Oct 31 is common. Audit trigger s for firms: turnover beyond prescribed \nlimits (Rs.1 crore, etc. – see Tax Audit section below), or if the firm claims profits lower than presumptive rates \nwhile having taxable income above the basic exemption. An LLP, importantly, is statutorily required to get audited \nunder LLP Act if turnover exceeds Rs.40 lakh or capital >Rs.25 lakh, which often effectively means many growing \nLLPs will have audit requirement regardless of tax law thresholds. Thus, most LLPs and larger firms file by Oct 31. \nThe firm must  also deduct tax on any remuneration or interest paid to partners (though those are deductible to the \nfirm, they are income for partners). From AY 2021 -22 onward, it’s mandatory to file returns electronically with \ndigital signature for tax audit cases.  \nPrivate Limited Company: Companies file ITR -6 electronically. Due date: Generally October 31 for all companies \nsince every company’s accounts are subject to statutory audit under the Companies Act (even if small). (If the \ncompany has international transaction s requiring transfer pricing audit, the due date extends to Nov 30, but that \ntypically affects larger companies). Compliance: Companies must maintain full books of account, get the financials \naudited by a chartered accountant, and comply with MAT/AMT if ap plicable. While small private companies \n(MSMEs) may have simpler financials, the compliance (board meetings, ROC filing etc.) is inherently more involved \nthan for a proprietorship or partnership. However, on the tax front, the availability of low tax regim es (22% or \n15%) and no personal tax on retained earnings can be an advantage for growth.  \nStartup Entities: Many startups are structured as private limited companies to attract investors or as LLPs. They \nfollow the filing norms above. One additional point – if a startup has obtained a tax exemption certificate (for \nSec.80 -IAC or angel tax), it must ensure to claim the deductions in the return and comply with any conditions (e.g . \ncertain types of income). We’ll cover startup -specific taxes later.  \nOther filings: In addition to the income tax return, MSMEs may need to file Tax Audit Reports (Form 3CD) by the \ndue date (if applicable), and transfer pricing reports (Form 3CEB by Oct 31 for TP cases). These are uploaded \nthrough the e -filing portal by the CA co nducting the audit. Also, if the firm/company had certain transactions like \ncash deposits beyond certain limit, foreign assets, etc., those must be disclosed in the ITR schedules.  \nRecords and Invoicing: Regardless of entity type, MSMEs should preserve supp orting documents for income and \nexpenses – invoices, purchase bills, receipts, bank statements, etc., for a minimum of six years from the end of the \nrelevant assessment year (the statutory time limit for scrutiny assessments). This is crucial in case of an y inquiry \nor audit by tax authorities.  \nTDS (Tax Deduction at Source) Obligations for MSMEs.  \nEven small businesses must comply with TDS provisions – this means when an MSME makes certain payments \n(like salaries, rent, contractor fees, etc.), it may need to deduct tax at source and remit it to the government. Key . \n. \nEs include:  \nSalary Payments (Section 192): If an MSME has employees, . \n. \nalaries **if the salary exceeds the basic exempt . \n. \nntially, any salaried employee’s monthly income above the taxable limit sh . \n. \n. \nl firms) must compute tax based on applicable slab rates fo . \n. \nproportionately each month. Form 16 must be issued annual . \nees. \nPayments to Contractors (Section 194C): When an MSME pays a contractor or sub -contractor for work (for \nexampl e, a manufacturing MSME paying a job worker, or a trader paying a delivery transporter), TDS at 1% (if \npayee is individual/HUF) or 2% (others) is required if the payment exceeds Rs.30,000 for a single contract or \nRs.1,00,000 aggregate in a year. This appli es to many typical MSME expenses – e.g., printing jobs, fabrication work, \nevent management, etc. (There is an exemption for personal (non -business) payments by individuals; but if the \nMSME is proprietorship under tax audit last year, then even individual c ategory has to deduct on business \npayments).  \nFees for Professional or Technical Services (Section 194J): MSMEs often hire professionals – e.g., accountants, \nlawyers, consultants, designers. If such fees exceed Rs.30,000 in a year to one person, TDS @ 10% m ust be \ndeducted19L229 -L238. (Budget 2021 introduced TDS @2% for certain technical service payments and 194J now \ngenerally 10% for professional, 2% for technical, but those nuances aside, the MSME just needs to ensure TDS \ncompliance if hiring outside expert s). Even small startups paying, say, a freelance web developer Rs.50k would \nneed to deduct Rs.5k and pay to government.  \nRent (Section 194I): If an MSME is paying rent for office/warehouse or machinery, TDS is required at 10% (for \nland/building rent) or 2% (for machinery/equipment) if annual rent exceeds Rs.2,40,000. Update: Budget 2025 \nhas increased the rent TDS threshold to Rs.6,00,000 per year23L69 -L73. This is a big relief for small businesses – \neffectively, rent up to Rs.50,000 per month will not trigge r TDS. For example, earlier even a Rs.25,000/month shop \nrent (Rs.3 lakh yearly) required TDS of Rs.30,000 per year (@10%). Now, that would be exempt since Rs.3L < \nRs.6L. This reduces compliance for micro enterprises operating from rented premises.  \nCommissi on and Brokerage (Section 194H): If the MSME pays any commission, brokerage, or referral fees above \nRs.15,000 in a year, TDS @5% is applicable. E.g., a small manufacturer paying a sales agent 5% commission on \norders – if commission exceeds Rs.15k, TDS need ed. \nPurchase of Goods (Section 194Q): A relatively new provision (from July 2021) – if a business’s turnover exceeded \nRs.10 crore in the previous year, it must deduct TDS @0.1% on purchases of goods from a seller if total purchases \nexceed Rs.50 lakh in a y ear. This is more relevant for medium enterprises; micro and small businesses usually \nwon’t cross Rs.10 crore turnover to trigger 194Q. But a medium MSME should be aware of this to comply.  \nOther TDS: There are numerous TDS sections; a few other possibly re levant ones for MSMEs: Section 194 -IA (1% \non purchase of immovable property over Rs.50 lakh – occasional if MSME buys property), Section 194 -IB (for \nindividual/LLP tenants paying >Rs.50k rent monthly – though 194I threshold rise to Rs.6L may cover most cas es), \nSection 194M (individuals/HUFs paying contractors/pros >Rs.50L in personal capacity – rarely relevant to \nbusiness context). Also, Section 194O – if the MSME sells goods/services via an e -commerce platform, the e -\ncommerce operator will deduct 1% TDS on  the payments to the MSME. This isn’t the MSME’s obligation but affects \ntheir net receipts (they can claim it in their return).  \nThreshold exemption for Individuals: One relief in TDS law is that individuals or HUFs who are not required to get \ntheir account s audited in the previous year are generally not obligated to deduct TDS on 194C, 194J, 194H, etc. For \nexample, a small proprietor who had turnover of Rs.30 lakh last year (no audit) and pays a contractor Rs.1 lakh this \nyear technically need not deduct TDS  under 194C because of that exemption. However, once that proprietor’s \nturnover crosses audit limit (say this year goes above Rs.1 crore, so next year he’s audit -subject), then next year he \nmust start TDS on such expenses. This rule aims to spare the small est businesses from the burden of TDS. \nImportant: This exemption does not apply to certain sections like 192 (salaries) or 194 -IB (rent by individual \n>Rs.50k/month) or 194 -IA (property purchase) – those apply even to individuals outside audit.  \nTDS Complian ce: When MSMEs deduct TDS, they must deposit it to the government by the 7th of the following \nmonth (for March, by April 30). They also need to file quarterly TDS returns (Form 26Q/24Q) by the due dates \n(usually end of the month following quarter -end, e.g. , Q4 by May 31). Failure to deposit TDS on time incurs interest \n(1% per month for delay in deduction, 1.5% per month for delay in remittance) and late filing fee of Rs.200/day for \nlate returns (Sec 234E), as well as potential penalties. After filing, they should issue TDS certificates (Form 16 \nannually for salary, Form 16A quarterly for others) to payees so that payees can claim credit.  \nNeglecting TDS can be costly: apart from interest and late fees, penalty up to the amount of tax not deducted/paid \ncan be imposed (Sec 271C), and expenses can be disallowed in tax computation (30% of the expense is added back \nif TDS not deducted or deposited by due date, as per Sec 40(a)(ia)). For instance, if an MSME paid Rs.1,00,000 to a \ncontractor and didn’t deduct Rs.1,00 0 TDS, Rs.30,000 of that expense could be disallowed in calculating its income, \nincreasing taxable income. Therefore, even small businesses must familiarize themselves with basic TDS provisions \nto stay compliant.  \nDue Dates, Interest, and Late Fees (Direct Tax Compliance Calendar).  \nMSMEs should calendarize the key direct tax deadlines to avoid penalties. Below are important due dates and \nconsequences of missing them:  \nAdvance Tax: If the MSME (or its owner) expects a total tax liability over Rs.10,000 in a ye ar (after TDS), advance \ntax must be paid. For non -presumptive businesses, advance tax is paid in four installments: 15% by June 15, 45% \nby Sept 15, 75% by Dec 15, and 100% by Mar 15. Presumptive business under 44AD/ADA get a relief – they can \npay the full advance tax by Mar 15 in one go9L510 -L5189L519 -L523. If advance tax is not paid or is underpaid, \ninterest under Section 234B (1% per month on shortfall from April 1 of next year till date of payment) and 234C \n(for deferment of individual installments, also  1% per month on shortfall for that quarter) will apply. These \ninterests can add up, so it’s prudent for profitable MSMEs to pay advances timely. (Note: proprietors often have \nTDS credit from sources like bank interest, etc., which can offset some advance tax need.).  \nTDS Payments and Returns: As mentioned, TDS deducted should be deposited by the 7th of the next month (for \nMarch, by April 30). Quarterly TDS returns due by 31st of July, Oct, Jan, and May for Q1, Q2, Q3, Q4 respectively. \nDelay in depositing TDS draws interest 1.5% p.m. and failure to file return leads to fee Rs.200/day (capped to TDS \namount). Persistent default in depositing TDS can even lead to prosecution under the Income Tax Act (Sec 276B) – \nthough typically only willful large defaults are  prosecuted.  \nIncome Tax Return (ITR) Filing: For individuals, partnerships, etc., July 31 is the usual due date (if no audit); for \nentities requiring audit, October 31. A late return can still be filed by December 31 of the assessment year (known \nas a “bel ated return”), but it attracts a late filing fee (Section 234F) of Rs.1,000 (if total income up to Rs.5 lakh) or \nRs.5,000 (if income above Rs.5 lakh)22L78 -L86. This fee is levied at time of filing late. Filing after Dec 31 (i.e. very \nlate, or failure to fi le) is not permitted unless the government extends deadlines; if missed entirely, the taxpayer \nmay get a notice and have to pay penalties or even face prosecution in extreme cases. Also, if a refund is due, \ndelaying filing means delaying your refund – and if tax was due, interest under Section 234A accrues at 1% per \nmonth for late filing on any unpaid tax.  \nTax Audit Report: If applicable, the audit report in Form 3CD/3CB -3CA must be uploaded by Sept 30 (one month \nbefore the Oct 31 due date). Missing this ca n trigger a penalty under Section 271B (see Tax Audit section). Usually, \nMSMEs should get the audit done well in time.  \nRevised/Updated Returns: If an MSME discovers errors in the original return (omitted income or deductions), a \nrevised return can be filed  by Dec 31 of the assessment year (or within 3 months of original filing, whichever later). \nBeyond that, one can file an updated return (Section 139(8A)) within 2 years of the end of the relevant assessment \nyear (recently extended to 4 years by Budget 2025 )23L67 -L70, but updated returns come with an extra tax \n(additional 25% or 50% of the due tax, depending on timing) as a penalty. It’s best to file correctly and timely the \nfirst time to avoid these scenarios.  \nSummary of Penalties for Late Compliance (Incom e Tax): Delay in filing ITR = late fee up to Rs.5k + interest on tax \ndue22L78 -L86. Delay in paying self -assessment tax/advance = interest 1% p.m. (Sections 234A/B/C). Delay in \nfiling TDS return = Rs.200/day (Sec 234E). Non -payment of TDS = interest + penal ty up to tax amount (Sec 271C). \nNot getting audit if required = penalty 0.5% of turnover (max Rs.1.5 lakh) under Sec 271B. These can cumulatively \ncost a lot, so timely compliance is crucial for MSMEs to avoid eroding their hard -earned profits in fines.  \nTax Audit Provisions for MSMEs.  \nTax Audit (Section 44AB) is an income tax audit by a CA, mandated once businesses reach certain size or in specific \ncases. The objective is to ensure the taxpayer accurately reports income, expenses, and complies with income ta x \nrequirements. Key tax audit rules relevant to MSMEs:  \nTurnover Threshold for Business: If annual gross turnover or sales exceed Rs.1 crore, a tax audit is mandatory \n(unless presumptive scheme is used – see exception below). However, to promote digital tra nsactions, the \nthreshold has effectively been increased: if the business’s cash receipts are ≤5% of total receipts and cash \npayments ≤5% of total payments, then the audit threshold is Rs.10 crore (as amended by Finance Act 2021)24L25 -\nL33. In simple terms, a largely digital MSME can have turnover up to Rs.10 crore without needing a tax \naudit24L25 -L33. This is a big relaxation for growing small enterprises. If cash dealings are minimal, the onerous \naudit requirement is deferred till Rs.10 cr. If cash exceeds 5%, the old Rs.1 cr limit applies. Many small traders and \nwholesalers benefit from this – e.g., a business with Rs.6 crore sales entirely via bank/UPI wouldn’t need audit due \nto this provision.  \nPresumptive Taxation Cases: A taxpayer who opts for Section 44 AD (turnover up to Rs.2/3 crore with presumptive \nprofit) is exempt from tax audit. However, if the person declares profits lower than 8%/6% (and above basic \nexemption) or opts out of 44AD after having opted it in earlier years, audit may become applicable even if turnover \nis below Rs.1 crore. Specifically, if one’s turnover is up to Rs.2 crore but they don’t use 44AD (or show less than \ndeemed profit and taxable income exceeds basic exemption), they must get audited. Similarly, under 44ADA, if a \nprofessional ’s receipts are ≤Rs.50/75 lakh and they take the 50% presumptive profit, no audit. But if they claim \nless than 50% as income while having taxable income, audit triggers (since 44ADA doesn’t have a multi -year lock -\nin like 44AD, but actual profit <50% requir es audit). Under 44AE (transport), those following presumptive also \navoid audit9L479 -L487; only if they try to show lower income than the presumptive per vehicle amount (with \nincome above exemption) would an audit be needed9L515 -L523.  \nProfessionals: If an MSME is a professional (like CA, doctor, etc.) not using presumptive scheme, the audit \nthreshold is gross receipts over Rs.50 lakh in a year (Section 44AB(b)). If receipts exceed Rs.50,00,000, a tax audit \nis required.  \nOther Scenarios: If an MSME business i s loss -making but wants to carry forward the loss, and its turnover is over \nRs.1 crore (or over Rs.2 crore and opted presumptive incorrectly, etc.), it may need audit. Also, businesses \nineligible for presumptive (like commission agents, or an LLP, or a for eign business) have to follow the Rs.1 \ncrore/Rs.10 crore rule strictly. Additionally, if an entity falls under certain special presumptive sections (44BB, \n44BBB – usually not relevant to MSMEs) and doesn’t declare the presumptive income, audit is required.  \nIn summary, many MSMEs manage to avoid a tax audit by either keeping turnover below limits or using \npresumptive schemes. But once an MSME grows beyond a point, a tax audit becomes part of compliance. The audit \ninvolves a CA examining the books and records  and reporting key financial ratios, payments, and discrepancies in \nForm 3CD. It is then filed with the tax return. The penalty for not getting a required audit is 0.5% of turnover \n(capped at Rs.1,50,000) (Section 271B). For example, a business with Rs.2 c rore turnover that failed to get an audit \ncould be penalized up to Rs.1 lakh.  \nPractical Tip: If an MSME is close to threshold, timely tax planning can help – e.g., if turnover slightly above Rs.1cr \nbut profit margins are good and digital transactions high,  opting 44AD presumptive (if eligible) can skip audit even \nup to Rs.2cr (or Rs.3cr w.e.f. FY23 -24). Or ensuring digital mode to use the Rs.10cr threshold. The policy intent is to \nreduce audits for genuine small businesses and focus resources on larger or r iskier cases.  \nIndirect Taxes on MSMEs (GST).  \nNearly all businesses, including MSMEs, are impacted by Indirect Taxation, primarily the Goods and Services Tax \n(GST) introduced in 2017. GST is a unified tax on supply of goods and services in India. This section covers GST \nregistration requirements for MSMEs, the Composition Scheme for small taxpayers, routine GST return filings \n(GSTR -1, GSTR -3B, etc.), Input Tax Credit rules, e -invoicing and e -waybill compliance, and GST audit & compliance \naspects.  \nUnders tanding GST is crucial for MSMEs as it affects pricing, cash flow (through input credits), and compliance \nworkload. The good news is that the government has provided higher thresholds and simpler options for smaller \nbusinesses under GST.  \nGST Registration T hresholds for MSMEs.  \nWhen is GST registration required? Generally, a business must register under GST if its aggregate annual turnover \nexceeds the prescribed threshold. As of current norms:  \nService Providers: Threshold is Rs.20 lakhs in a financial year (f or most states)22L79 -L87. For special category \nnortheastern states, this limit can be Rs.10 lakh (though some of those states have opted for higher limit now).  \nGoods Suppliers (Traders/Manufacturers): Threshold is Rs.40 lakhs if exclusively engaged in supp ly of goods (and \nnot services) in most states22L79 -L87. When GST launched, it was Rs.20L across the board, but later for goods this \nwas doubled to Rs.40L (with states given an option to keep it Rs.20L – a few smaller states did).  \nIf a business deals in bot h goods and services, effectively the service threshold of Rs.20L applies (since providing \nany service fixes threshold at Rs.20L, as the law stands).  \nInter -state Supplies: Initially, any inter -state supply required registration (no threshold), but now smal l service \nproviders can do inter -state up to Rs.20L without GST. However, for goods, if you supply to other states, \nregistration is mandatory (except if turnover is very small and you opt for special e -commerce threshold schemes, \netc.). Practically, many M SMEs find themselves registering once they expand sales geographically, even if under \nRs.40L, because inter -state sale of goods triggers registration.  \nOther Mandatory Registration Cases: Regardless of turnover, certain businesses must register: e.g., if yo u sell via an \ne-commerce platform (like Amazon), you need GST; if you’re liable to pay GST under reverse charge; non -resident \nbusinesses; input service distributors, etc. But for a typical small MSME, these special cases are rare. One notable \ncase: a small  manufacturer selling on an e -commerce marketplace will have to register for GST even if turnover is, \nsay, Rs.5 lakhs, because e -commerce operator cannot allow an unregistered seller.  \nIn summary, a truly micro business (turnover under Rs.20L services or Rs .40L goods) within one state can avoid \nGST registration and compliance. However, many MSMEs exceed these modest limits or voluntarily register earlier \nfor business reasons (to claim input tax credit or to cater to B2B customers who insist on GST invoice).  \nVoluntary Registration: An MSME below threshold may still take GST registration to avail Input Tax Credit (ITC) on \nits purchases or to appear more credible to clients. For example, a startup with Rs.5 lakh revenue but significant \npurchases may register to claim input credits (though note, once registered, all compliance applies regardless of \nturnover).  \nThreshold Exemption Example: A tailoring shop providing local services with Rs.15 lakh turnover is exempt from \nGST (no need to register/collect GST) because Rs.15L < Rs.20L. Similarly, a homemade snacks seller in one state \nwith Rs.35 lakh sales is exempt (below Rs.40L). But if that snacks seller starts shipping to a neighboring state, they \ntechnically must register from the first inter -state sale.  \nGST Composit ion Scheme for Small Businesses.  \nFor MSMEs with modest turnover, the Composition Scheme offers a simplified compliance and tax payment option \nunder GST. Key features of the Composition Scheme:  \nIt is available to taxpayers with turnover up to Rs.1.5 crore i n the previous financial year (limit was Rs.1 crore \ninitially, later increased). For North -East states, the limit is Rs.75 lakh.  \nComposition taxpayers pay a fixed percentage of their turnover as GST, instead of normal GST rates on each \ninvoice. The rates are: \n1% (0.5% CGST + 0.5% SGST) of turnover for traders (suppliers of goods)22L79 -L87. This applies also to \nmanufacturers of goods (except some like ice cream, pan masala, tobacco which are excluded).  \n5% (2.5%+2.5%) for restaurant services (only for those not serving alcohol) – since restaurants are a major MSME \nsector.  \n6% (3%+3%) composition tax for service providers (introduced in 2019 as a special composition -like scheme for \nsmall service MSMEs up to Rs.50 lakh turnover). This “Service Composition” schem e allows small service firms (or \nmixed suppliers of goods and services) to pay 6% instead of standard 18%.  \nNo collection of GST: Composition dealers cannot collect GST from customers on the invoice. Their pricing is \nassumed to be inclusive. For example, a trader under composition selling an item for Rs.1,000 will not add GST to \nthe invoice; instead, they later pay 1% of that Rs.1,000 (i.e. Rs.10) from their own pocket as tax. They must mention \n“composition taxable person, not eligible to collect tax on supp lies” on the bill.  \nNo Input Tax Credit for buyers: Because composition dealers don’t charge regular GST, their B2B customers cannot \nclaim ITC on purchases from them. This is a limitation – larger companies often avoid buying from composition \ndealers since they can’t get credit, effectively making the purchases ~tax -inefficient. Thus, composition is mostly \nuseful for B2C oriented MSMEs (e.g. local shopkeepers, small restaurants serving consumers).  \nSimplified Returns: Composition taxpayers have very light com pliance: they need to file quarterly payment return \n(CMP -08) by 18th of the month after each quarter, and an annual return (GSTR -4) by April 30 of next FY. They do \nnot need to file the regular monthly GSTR -1 and GSTR -3B that normal taxpayers file, which gr eatly reduces \npaperwork.  \nConditions: Composition scheme cannot be used if the business makes inter -state outward supplies (selling to \nother states), or supplies through e -commerce operators, or is engaged in manufacturing certain notified goods \n(like pan m asala, ice cream, etc.). Also, a composition dealer must pay taxes at normal rates on any purchases from \nunregistered dealers above a specified amount (this provision of RCM on unregistered purchase was removed in \n2018 for all, so currently not an issue). They also must pay reverse charge GST on certain services like any other \ntaxpayer.  \nBill of Supply: Composition dealers issue a Bill of Supply instead of a tax invoice, since they can’t charge tax \nseparately.  \nFor example, a small sweet shop with Rs.50 lakh turnover can opt for composition. It will pay 1% of Rs.50 lakh = \nRs.50,000 as GST for the year (quarterly Rs.12,500 payments), instead of charging 5% or 18% on each item and \ndoing voluminous filings. The record -keeping is minimal, and customers (majority a re consumers) don’t bother \nabout GST – they just pay the price tagged.  \nNew Composition for Services: Recognizing many small service providers also needed relief, a composition scheme \nfor services was rolled out allowing those with up to Rs.50 lakh services  turnover to pay 6% GST. For instance, a \nsmall consulting firm with Rs.30 lakh revenue could pay Rs.1.8 lakh (6%) under this scheme instead of 18% on \neach invoice. However, note that if a business supplies both goods and services, they could use normal com position \nfor goods and the special 6% for services only if the service portion is within Rs.50L and overall within Rs.1.5Cr – \nthis gets complex, so usually mixed supply small traders (like a kirana store with minor service income) stick to \nnormal compositi on (allowed up to 10% of service turnover or Rs.5L, by rule).  \nOverall: Composition is ideal for micro businesses doing local trade or services, who mainly sell to end consumers \nand want to avoid the complexity of full GST. It offers ease (few returns, flat  rate) at the cost of ineligibility to claim \ninput credit and inability to do interstate sales or sell to big GST -registered buyers effectively. Many lakhs of \nMSMEs are enrolled as composition dealers.  \nGST Return Filing and Compliance (GSTR -1, GSTR -3B, etc .). \nMSMEs registered under GST (and not under composition) have to follow the regular GST compliance cycle. Over \ntime, the GST Council has simplified some procedures for small taxpayers (like offering quarterly filing options), \nbut the core requirements re main:  \nGSTIN and Invoices: Once registered, an MSME gets a GSTIN (GST Identification Number) and must issue GST \ninvoices for sales, showing the GST amount and GSTIN. Proper tax invoices are needed to enable input credit flow. \nThey also have to maintain purc hase records and collect invoices from suppliers for claiming credit.  \nGSTR -1 (Sales Return): GSTR -1 is a statement of outward supplies (sales). It contains details of all invoices issued, \ndebit -credit notes, exports, etc., in a given period. Frequency: Tax payers can file GSTR -1 monthly (by the 11th of \nthe next month) or quarterly if they opt for the QRMP (Quarterly Return, Monthly Payment) scheme. Under QRMP, \nif turnover ≤ Rs.5 crore, one can file GSTR -1 quarterly (by 13th of month after quarter)16L13 -L17. Optionally, they \ncan use an Invoice Furnishing Facility (IFF) to upload first two months’ B2B invoices to pass credit to recipients. \nMSMEs should ensure timely GSTR -1 filing because their buyers’ ability to claim ITC depends on these invoices \nreflecting in  GSTR -2A/2B.  \nGSTR -3B (Summary Return & Payment): GSTR -3B is a monthly summary return through which GST payment is \nmade. It reports total outward and inward supplies, input credit claimed, and net tax payable. It is due by 20th of \nthe next month for most ta xpayers. The government has staggered dates for smaller states (22nd or 24th for \nsome). Under QRMP, small taxpayers file 3B quarterly (by 22nd/24th of month after quarter) but have to pay tax \nmonthly through a challan (either actual or a fixed sum method).  GSTR -3B is critical – even if GSTR -1 was filed, the \ntax is not considered paid until 3B is submitted with payment of any liability. Delayed 3B filings attract late fees of \nRs.50 per day (Rs.20 per day for nil liability)16L13 -L17, capped per return (caps d epend on turnover; for small \ntaxpayers often capped at Rs.2,000 or Rs.5,000). Interest at 18% per annum is charged on any tax paid late16L13 -\nL17.  \nOther Returns: There are other specialized returns/forms:  \nGSTR -4: Annual return for composition dealers, due A pril 30 of next FY (composition taxpayers no longer file \nquarterly GSTR -4; they use CMP -08 for payments quarterly).  \nGSTR -9: Annual GST return that summarizes the year’s operations. It is mandatory for taxpayers with turnover \nabove Rs.2 crore (optional belo w that threshold, though it was waived for <=Rs.2Cr for initial years). Many MSMEs \nwith modest turnover can skip GSTR -9 if under threshold, but if above, they must file by Dec 31 of next year. GSTR -\n9 basically recaps GSTR -1 and 3B data and does some auto -reconciliation.  \nGSTR -9C (Reconciliation Statement): Earlier a separate audited reconciliation for turnover > Rs.2 crore, but post -\n2021, requirement changed – now applicable only if turnover exceeds Rs.5 crore, and instead of requiring a CA \naudit, the taxpay er can self -certify the reconciliation of books vs GST returns9L479 -L487. Many medium MSMEs \n(5–10 crore) have to prepare this reconciliation (showing, e.g., any differences between audited financials and GST \nreturns).  \nGSTR -8/7/6 etc.: These pertain to e -commerce operators, TDS deductors, Input Service Distributors – typically not \nroles an ordinary MSME plays unless they themselves are e -com platform or a large company branch.  \nBooks and Records: GST law requires maintaining detailed records of sales, purchas es, stock, output tax collected, \ninput tax availed, etc. for 6 years. MSMEs should have a proper accounting or at least spreadsheets to keep track, as \nGST audits (departmental) can ask for these.  \nCompliance Reliefs for MSMEs: Government has introduced seve ral measures to ease compliance for smaller \ntaxpayers:  \nQRMP scheme: As noted, quarterly filing with monthly payment for those up to Rs.5Cr turnover reduces the \nnumber of GSTR -1/3B filings from 24 to 8 per year16L13 -L17.  \nLate Fee waivers and reductions: Lat e fees have been reduced for small turnover cases. Currently, late filing of \nGSTR -3B is capped: for turnover up to Rs.1.5Cr, max late fee Rs.2,000; for Rs.1.5 –5Cr, max Rs.5,000 (each for \nCGST+SGST). Nil return late fees are also kept low (Rs.20/day).  \nAmnes ty schemes: From time to time, amnesty is given to clear backlog of return filings by capping late fees.  \nGST Helpdesks and Sahaj/Sugam forms (proposed): There were plans for simpler return forms for small taxpayers \n(called Sahaj/Sugam) but those were shelv ed as QRMP served the purpose.  \nExample: A small manufacturing MSME with Rs.3 crore turnover in Maharashtra supplying locally would typically, \nif not in composition, file GSTR -1 and 3B each month. If eligible, they could opt QRMP – then from April -June \nquar ter, pay estimated tax monthly (using challan PMT -06 by 25th of next month) and file one GSTR -1 and one 3B \nfor the quarter by July. They must ensure by year -end they file GSTR -9 if above Rs.2Cr. If that MSME was below \nRs.2Cr, they could skip GSTR -9 as of n ow (though it’s good practice to file it to reconcile things).  \nConsequence of non -filing: If returns are not filed, apart from late fees and interest, the GSTIN can be suspended or \ncanceled. Non -filing of GSTR -3B for consecutive tax periods will block e-way bill generation, hampering business. \nPersistent default can lead to best -judgment assessment by tax officers. So, maintaining timely GST filings is as \nimportant as income tax filings for MSMEs.  \nInput Tax Credit (ITC) Rules and Considerations.  \nOne of the main benefits of GST for businesses is the Input Tax Credit (ITC) mechanism – taxes paid on purchases \ncan be credited against output tax on sales, avoiding cascading tax. For MSMEs, efficient use of ITC can significantly \nreduce the GST cost burden. Key  ITC rules and their impact on MSMEs:  \nEligibility for ITC: An MSME can claim credit for GST paid on inputs (raw materials), services, and capital goods \nused in the course of business, subject to conditions:  \nPossession of a valid tax invoice or debit note f rom a supplier.  \nReceipt of the goods or services. (If only invoice received but goods are in transit, credit can’t be taken yet.).  \nSupplier has uploaded the invoice in their GSTR -1 and paid the tax to government. This has become a critical \ncondition – the buyer’s ITC is matched with the supplier’s output. Since 2022, ITC is largely allowed only if the \ninvoice is reflected in the buyer’s GSTR -2B (auto -generated ITC statement). So MSMEs must ensure their vendors \nfile returns timely.  \nTimely claiming: Ideally i n the same financial year. If missed, ITC for an invoice can be claimed up to the due date of \nSeptember return of next FY (i.e., by Oct 20).  \nNo ITC for personal or prohibited items: Some inputs are blocked (Section 17(5)), e.g., GST on personal passenger \nvehicles, food and beverages, club memberships, etc., is not creditable (unless one is in that business). Also, \ncomposition scheme purchases (from a composition dealer) come with no GST charged, so nothing to claim.  \nProportionate Credit for Mixed Use: If an  MSME has both taxable and exempt sales, it can claim ITC only \nproportionate to taxable (including zero -rated) supplies. For example, if a small pharma company sells some tax -\nexempt medicines (GST 0%) and some taxable supplements, it must reverse proportio nate ITC for inputs used in \nexempt sales.  \nReverse Charge Mechanism (RCM): In some cases, the MSME has to pay GST on behalf of the supplier (reverse \ncharge) – common examples: importing services, buying from an unregistered supplier for certain notified \nsupplies, or purchase of raw agro products from farmers, etc. That GST paid can be availed as ITC (in the same \nmonth) if it is used for business. But it means the MSME needs to shell out that tax first. E.g., a registered MSME \navailing legal services from a l awyer (who is unregistered) must pay 18% GST on the fees under RCM, but can then \nclaim it as ITC. This is revenue -neutral after a month but affects cash flow.  \nITC Restrictions (SME perspective): The government implemented rules to ensure ITC is taken only if supplier \ncomplies. A notable rule: Rule 36(4) which once limited provisional ITC to 5% over and above matched invoices \nhas effectively been replaced by full matching – now MSMEs can only take credit for invoices that are in their \nGSTR -2B. Thus, due dili gence of suppliers is important. MSMEs should purchase from compliant vendors to avoid \nlosing ITC. Many small businesses now regularly reconcile GSTR -2A/2B with their purchase book to identify \nmissing credits and chase vendors to file. This can be a pain p oint due to dependence on others’ compliance.  \nCapital Goods ITC: MSMEs can also claim credit on capital asset purchases (machinery, equipment) – but if they \nlater sell that machinery, they have to pay GST on sale. Also, if an asset is partly for personal u se, credit should be \nproportionately reduced.  \nInput Tax Credit Example: A small manufacturing MSME has output GST of Rs.5 lakh in a quarter. It purchased raw \nmaterials with GST of Rs.3 lakh and received various services (electricity is outside GST, but say  machine repairs \nwith GST) of Rs.50k. Provided all supplier invoices are uploaded and meet conditions, the MSME can claim Rs.3.5 \nlakh as ITC and only pay the balance Rs.1.5 lakh in cash for output GST. Without ITC, it would pay full Rs.5 lakh, so \nclearly I TC lowers effective tax cost to business. The end consumer ultimately bears GST, not the MSME, if ITC \nworks properly.  \nCases of Ineligible ITC: If an MSME buys a car for the director (not for a driving school or travel business), GST on \nthat car cannot be c laimed – it’s blocked credit. If it spends on team lunch or gifts, those GST amounts are blocked. \nAlso, composition scheme cannot claim any ITC on their inputs – that’s a trade -off of the scheme.  \nITC and Cash Flow: Delays in getting ITC (due to supplier no n-filing) can hurt MSMEs’ cash flow. The government \noccasionally issues circulars if technical issues prevent matching, but by and large, MSMEs have to follow up with \nsuppliers or else bear extra tax until it’s resolved. This makes compliance coordination a part of MSME operations \nnow.  \nGST Refunds for MSMEs: Usually, refunds are not common in domestic trade (since output > input for value \naddition). However, MSME exporters or those inverted duty situations (input GST > output GST rate) can claim \nrefunds of accumulated ITC. For example, a small textile unit (fabrics GST 5% output, inputs cotton GST 5% and \nchemicals 18%) may accumulate ITC – they can file refund periodically. This is vital for working capital. The law \nprovides that 90% of refund should be gran ted provisionally within 7 days, though in practice it can take a few \nweeks or more with verification.  \nIn conclusion, efficient ITC management is key to GST compliance – MSMEs should organize purchase invoices, \nregularly reconcile with GSTR -2A/2B, and prom ptly address mismatches. It directly affects profitability because \nGST not claimed correctly becomes a cost. Proper training of staff or use of software can help even small \nbusinesses handle this.  \nE-Invoicing and E -Way Bills.  \nE-Invoicing: To further digiti ze GST and curb evasion, the government introduced e -invoicing – which means \nbusinesses must generate their B2B invoices through a central Invoice Registration Portal (IRP) that validates and \nassigns a unique Invoice Reference Number (IRN) and QR code. Ini tially applied to large companies, the turnover \nthreshold for mandatory e -invoicing has been steadily reduced. As of 1st August 2023, **e -invoicing is compulsory \nfor taxpayers with turnover above Rs.5 crore35L19 -L2735L47 -L55. This means many medium and eve n small -\nmedium enterprises now fall in this bracket. For example, an MSME with Rs.7 crore sales must ensure all its B2B \ninvoices (to GST registered customers) are generated via the IRP (through their billing software or offline tool). If \nnot, those invoice s are not treated as valid for input credit, and penalties apply.  \nThe evolution was: >Rs.500Cr (Oct 2020), >Rs.100Cr (Jan 2021), >Rs.50Cr (Apr 2021), >Rs.20Cr (Apr 2022), \n>Rs.10Cr (Oct 2022), and now >Rs.5Cr. Likely future: It may further go down to Rs.1Cr  or all taxpayers in phases. \nSo micro enterprises aren’t hit yet, but a thriving small business should be prepared.  \nImpact: E -invoicing requires technical adaptation – MSMEs need software or ERP that can send invoice data to IRP \nand get back IRN instantly.  Many accounting software for SMEs (Tally, Busy, etc.) provide this integrated now. The \nbenefit is that these e -invoices automatically reflect in GSTR -1 and the buyer’s GSTR -2B, reducing manual errors. It \nalso basically automates tax authorities’ access to  your sales data in real -time.  \nCompliance tip: If e -invoicing applies, failing to do so can attract a penalty of Rs.10,000 per invoice (and the invoice \nis not a valid tax invoice) as per rules. So MSMEs crossing threshold must be careful to implement it. O n the flip \nside, those below threshold may voluntarily use e -invoicing too for convenience, but it’s optional for them.  \nE-Way Bills: An e -way bill is an electronic permit required for movement of goods consignment valued over \nRs.50,000. MSMEs in trading or  manufacturing must generate an e -way bill when sending goods beyond a certain \ndistance (even within state, states often have 50km free limit for intra -city). The e -way bill system is online: one \nmust fill details of invoice, vehicle number, transporter ID , etc., and get a unique EWB number. This is to track \ntransit of goods and prevent tax evasion. Key points:  \nRequired typically for inter -state transport >Rs.50k, and for intra -state as per state limits (most states also Rs.50k, \nsome have higher).  \nSome exce ptions: certain goods (like perishable agricultural produce, milk, etc.) are exempt; also if moving goods \nby non -motorized means (handcart) no EWB.  \nWho generates: If the seller is GST -registered, usually the seller generates the e -way bill. If the seller h asn’t and the \nbuyer is registered and moving goods, the buyer can. Transporters can also generate for clients.  \nFor MSMEs with own vehicle or using courier, they might have to do it themselves on the portal.  \nExample: A small furniture manufacturer selling R s.1 lakh worth of furniture to a customer 200 km away must \ncreate an e -way bill before dispatch. If a truck is stopped by authorities en route and no valid EWB, penalties can be \nsevere (equal to tax and penalty; goods can be detained).  \nThe validity of e-way bills depends on distance (1 day per 200 km usually).  \nIntegration with e -invoicing: If an MSME is under e -invoicing, Part A of e -way (invoice details) can auto -populate \nfrom IRP. Still need to enter vehicle details (Part B).  \nPenalties: Moving goods w ithout e -way bill (when required) can lead to a penalty of Rs.10,000 or tax amount \nevaded, whichever higher and possible seizure of goods (Section 129, 130 of CGST Act). Often resolution requires \npaying tax + equal penalty on the spot to release goods. Tha t’s a nightmare scenario for a small business (imagine \nthe working capital hit). So compliance here is important for logistics.  \nMany MSMEs use third -party transport or courier – usually, those providers assist with e -way bill. There are also \nintegration so lutions if volumes are large. But even a one -off transfer (like shifting machinery to a new site) may \nneed an e -way.  \nConclusion: E -invoicing and e -way bills are part of the GST compliance landscape aimed at transparency and \ncurbing evasion. For MSMEs, it m eans more tech adoption but also streamlined reporting. Once systems are in \nplace, it can automate a lot of tax filing work (e.g., e -invoices auto -fill your returns). The trend is toward more \ndigitization, so MSMEs are advised to get comfortable with these  tools sooner than later.  \nGST Audit and Compliance for MSMEs.  \nUnder GST law, there isn’t a “tax audit” exactly like income tax, but there are annual compliance checks and the \npossibility of departmental audits or assessments:  \nAnnual Reconciliation (GSTR -9 and 9C): As mentioned, if turnover > Rs.2 crore, filing GSTR -9 annual return is \nmandatory. This form consolidates all monthly returns, and it’s a good practice for MSMEs to reconcile books vs \nGST data through it. Initially, GST law required taxpayers >Rs.2 Cr to also submit a reconciliation statement audited \nby a CA (Form GSTR -9C) certifying that GST returns align with financials. In mid -2021, this was amended: now \nonly those with turnover above Rs.5 crore need to submit GSTR -9C, and it can be self -certified  by the \ntaxpayer35L47 -L55 (no external audit required). So effectively, for FY 2021 -22 onwards, MSMEs under Rs.5Cr \nhave much lighter annual compliance (no 9C at all, and GSTR -9 itself optional if ≤2Cr). For 2 –5Cr, they do GSTR -9; \nfor >5Cr, GSTR -9 and 9C se lf-certification.  \nMSMEs should still internally reconcile their GST filings with their accounting books annually, because any \ndiscrepancies (like sales recorded in books but missed in GST, or ITC claimed in books but not in return) should be \ncorrected (eit her through annual return or before Sept of next year via adjustments). GSTR -9C asks details of \nunreconciled amounts, interest paid, etc., prompting businesses to square up issues.  \nDepartmental Audit: GST officers have the right to conduct a Departmental A udit (Sec 65) of any registered person. \nTypically, larger units or those with risk flags are picked. The authorities give notice and then audit records at the \nplace of business or their office. For MSMEs, the chance of routine audit is lower, especially if  turnover is small and \ncompliance timely. But medium enterprises might face one after a few years of operations. It’s crucial to maintain \nall records (sales, purchase, stock registers, e -way bills, etc.). If an audit finds under -reporting (like output tax \nshort paid or wrong ITC claimed), they can issue a notice to pay tax with interest, and possibly penalty if it was due \nto negligence or fraud.  \nScrutiny of Returns: GST also allows officers to scrutinize returns (Sec 61). If anomalies are found (say GSTR -3B vs \nGSTR -1 mismatches, or large ITC claim trend), they may seek explanation. MSMEs should respond with \nclarifications or make corrections if a genuine error is spotted. This is less formal than an audit, but important to \naddress to avoid it escalating to a  demand.  \nGST Investigations: In cases of suspected tax evasion (e.g. fake invoicing), there are provisions of search, seizure, \nand even arrest (though applicable to willful fraud above certain amounts, typically not something a compliant \nMSME would encount er). Nevertheless, understanding that serious offences (issuing invoices without supply, \nutilizing fake ITC) can lead to prosecution under GST is good – it deters one from any shortcuts that might be \nsuggested by some unscrupulous players.  \nCompliance Ratin g: The GST Act envisaged a compliance rating mechanism for taxpayers (to publicly rate how \ncompliant they are). Though not implemented yet, if it comes, MSMEs will benefit from keeping a high rating (e.g. \nmaking them preferable suppliers).  \nRoutine Complian ce: Aside from returns, MSMEs must also comply with:  \nGST Payments: timely through Electronic Cash Ledger if ITC insufficient.  \nMaintaining Current Account with GST: Check the GST portal cash/credit ledger regularly. Sometimes payments \nremain un -utilized, or  ITC gets blocked if returns not filed for long.  \nHSN Codes: Now even smaller taxpayers must report HSN (Harmonized System of Nomenclature) codes for \ngoods/services on invoices – for turnover up to Rs.5Cr, 4 -digit HSN; above, 6 -digit or 8 -digit. MSMEs shoul d update \ntheir invoice format accordingly.  \nE-Invoice and E -way compliance as discussed.  \nPenalties under GST: If an MSME fails any GST obligation, penalties can apply under various sections (covered in \nnext section on punishments). Many penalties (like late  fees for returns, interest on late payments) have been \ntouched upon. For serious offences (fraudulent evasion), penalties are very steep (100% tax as penalty, etc.). But \nthose are avoidable with honest compliance.  \nIn essence, while the initial GST years r equired professional audits for even mid -size firms, today most MSMEs can \nself-manage GST annual compliance. The focus should be on accurate monthly/quarterly filings, reconciling \ndifferences, and keeping documents orderly. Using accounting software or GST  return software helps minimize \nhuman errors. Also, the government frequently updates rules (via notifications/circulars), so MSMEs benefit from \nconsulting with a tax practitioner at least annually to ensure they haven’t missed any new requirement (for \ninstance, new e -invoice thresholds, or any new exemption they could use).  \nIncome Tax Return (ITR) Filing for MSMEs.  \nFiling of Income Tax Returns is an annual must -do for all MSMEs (whether as individuals, firms, or companies). The \nchoice of the correct ITR fo rm, keeping necessary documentation, and understanding penalties for non -compliance \nensures MSMEs remain on the right side of the law. This section outlines which ITR forms apply to different types \nof MSMEs, the documents and information required for filin g, and the consequences of late or incorrect return \nfiling.  \nTypes of ITR Forms for MSMEs.  \nDepending on the constitution of the business and the nature of income, different ITR forms are prescribed:  \nITR-3: Applicable to individuals or HUFs carrying on a bus iness or profession who do not opt for the presumptive \nscheme. For example, a sole proprietor who maintains books of account or has income from business and also \nother income (like salary, rent) will use ITR -3. It has detailed schedules for P&L, balance sh eet, etc.  \nITR-4 (Sugam): A simplified return for individuals, HUFs, and partnership firms (other than LLP) who opt for \npresumptive taxation under Section 44AD, 44ADA, or 44AE. This form is short – it doesn’t require full financial \nstatements, just gross re ceipts and presumptive income, along with any other income like interest or salary of \nproprietor. A small trader with presumptive income and maybe some interest income can file ITR -4 easily. Note: \nLLPs cannot use ITR -4 because LLPs are not allowed presumpt ive scheme (44AD excludes LLP).  \nITR-5: This is the return form for partnership firms (non -presumptive), LLPs, and other non -company entities like \nAssociation of Persons, etc.. Essentially, all firms/LLPs (and cooperative societies, trusts etc. which are separate \ncategories) that are not filing ITR -7 go in ITR -5. A normal partnership or LLP which kept books and whose income \nis computed regularly (not under 44AD/ADA) will file ITR -5. It requires details of partner’s shares, etc., and has \nsimilar statement s chedules to ITR -3 but for firms.  \nITR-6: The form for companies (except those claiming exemption under Sec 11 for charitable entities). All private \nlimited or public limited companies file ITR -6. It includes schedules for MAT, shareholding details, etc., ap propriate \nfor corporate assessees.  \n(For completeness: ITR -7 is for entities claiming exemption like trusts, not relevant to MSME commercial entities.).  \nIn summary:  \nA proprietorship MSME -> ITR -3 or ITR -4. \nA partnership/LLP MSME -> ITR -5 (unless partnership  opting presumptive, which could use ITR -4 for now, but \ntypically many prefer ITR -5 with presumptive schedule too).  \nA company startup -> ITR -6. \nTax Audit reporting: If the MSME’s accounts were audited, relevant audit details need to be filled in the ITR (l ike \nname of auditor, date of audit report, etc.).  \nSelecting the right form is crucial – filing a wrong ITR form (say filing ITR -4 when not eligible) can be treated as \ndefective. For example, if a partnership firm that paid partner salary beyond 44AD limits  incorrectly tries to use \nITR-4, that’s not appropriate – it should use ITR -5 with Schedule BP filled.  \nDocumentation Required for Filing.  \nEven though returns are filed online, the figures in the return come from the business’s financial records. MSMEs \nshou ld organize the following documents/information at the time of filing:  \nFinancial Statements: If books maintained – the Balance Sheet and Profit & Loss Account for the year. These give \nfigures for turnover, gross profit, expenses, sundry debtors/creditors, closing stock, capital, etc. In tax returns \n(ITR -3/5/6), one typically fills summary P&L (sales, various expense heads, net profit) and balance sheet items. \nFor presumptive filers, detailed accounts are not required, but one should at least note gross rece ipts and ensure \nbank statements tally with that.  \nBank Statements: Reconcile all business bank accounts with declared income to ensure no income is missed. Also, \ninterest from these bank accounts is taxable (if not under presumptive or even if presumptive, interest is other \nincome). For proprietors, personal and business accounts often overlap, so consider all accounts for interest \nincome.  \nSales and Purchase Invoices: Total sales as per invoices (and as per GST returns, if applicable) should match or be \nreco nciled to income reported. If there is a difference (say GST returns on a different FY cutoff or cash vs accrual), \nprepare a reconciliation in case of query. Large assets purchased (capital expenses) should be accounted for in \ndepreciation schedules.  \nGST r eturns: These help cross -verify turnover and also input tax credit. Though IT return doesn’t directly ask for \nGST data, discrepancies between GST and ITR may trigger notices. So MSMEs should be ready to explain if GST \nturnover is, say, Rs.1.05 crore but IT R turnover Rs.1 crore (could be because Rs.5 lakh was unadjusted advances or \nstock transfers not sales, etc.).  \nTDS Certificates (Form 16A/16): Collect all TDS certificates for tax deducted by others on the MSME’s income (e.g., \nclients who deducted TDS on p ayments). This ensures the MSME claims credit for that TDS in the return. Cross -\ncheck the Form 26AS or Annual Information Statement (AIS) on the income tax portal for all TDS entries and high -\nvalue transactions.  \nRecords of Expenses and Deductions: For comp uting taxable income, have a summary of all expenses (raw \nmaterial, wages, rent, marketing, depreciation etc.). Also, certain businesses have special deductions (like 30% \nadditional for new employees under Section 80JJAA if criteria met – mostly for medium  companies). Keep \ndocumentation for any deduction claimed. If proprietor, also compile deduction claims under Chapter VI -A (80C, \n80D etc.) if any personal investments to declare.  \nPartner/Shareholder details: Partnerships need the profit -sharing ratio, deta ils of remuneration or interest paid to \npartners (must align with partnership deed limits). Companies need detail of shareholding, especially if there are \nchanges (schedule of shareholders holding >10%).  \nAudit Reports and Certificates: If a tax audit was d one, the audit report (Form 3CD) would have details needed for \nsome ITR fields (disallowances, etc.). If any tax incentives were availed that require certificates (e.g., 80JJAA report, \n80-IA, 80 -IAC startup certificate), keep those at hand to fill relevant  schedules and as proof if questioned.  \nStartup documentation: If claiming the startup tax holiday under Section 80 -IAC, ensure the DPIIT recognition \ncertificate and Inter -Ministerial Board approval (if applicable) are obtained and mention details in the re turn. \nSimilarly, if any capital gains exemption (54GB for startup investment) or angel tax exemption availed, have those \nrecords.  \nCarried Forward Losses: If the MSME had losses in previous years, to carry forward and set off those, ensure the \nearlier year returns were filed on time and have those loss figures (they auto -populate if you import data on e -\nfiling portal). For companies, check Section 79 conditions (shareholding continuity) to ensure loss carryforward is \nallowed (startups have relaxation if DPII T recognized).  \nIn essence, while filing the return, the MSME will input its income details (from P&L), balance sheet items, tax \ncomputation, TDS/TCS credits, and any special claims. Having accurate books or at least a trial balance is very \nhelpful. Even pr esumptive taxpayers should retain some working of how they arrived at their turnover figure, as \nthe taxman could ask for substantiation of the gross receipts.  \nThe ITR filing is done online on the Income Tax portal (JSON utility or through ERI softwares). A fter uploading, \nverification is needed (via Aadhaar OTP, DSC for companies, or sending signed ITR -V). Make sure to complete \nverification within 30 days, or the return is invalid.  \nPenalties for Late or Incorrect Filing.  \nCompliance with income tax filing is not just an obligation but also protects the MSME from legal troubles. Here are \nthe penalties/punishments related to ITR filing and reporting:  \nLate Filing (Section 234F Fee): As mentioned earlier, filing the return after the due date (Jul 31/Oct 31) incurs  a \nlate fee. For MSMEs/persons with income above Rs.5 lakh, the fee is Rs.5,000; for up to Rs.5 lakh, Rs.1,00022L78 -\nL86. This is charged at the time of filing belated return. Note that if one completely misses filing by the end of the \nassessment year (i.e. , by March 31 of next year), you cannot file at all (unless a notice is given or window for \nupdated return). Missing the deadline also results in interest on any unpaid tax (Section 234A) at 1% per month \nfrom due date till actual filing.  \nPenalty for Failur e to File (Section 271F / 271AAC etc.): If a person who is required to file (having taxable income \nor certain transactions) willfully fails to file even a belated return, the tax department can levy a penalty up to \nRs.5,000 under the old Sec 271F (now repl aced by late fee and prosecution sections). More seriously, Section \n276CC provides for prosecution (criminal charges) if someone willfully fails to file a return by the end of the \nassessment year and the tax evaded is above a threshold. Currently, if the t ax unpaid (net of TDS/advance) exceeds \nRs.10,000, the assessee could face prosecution for non -filing15L25 -L33. The imprisonment can be 3 months up to \n7 years depending on amount (less severe if tax ≤ Rs.25 lakh, more severe if above). However, these are in voked in \negregious cases. Small MSMEs usually won’t face jail for a late return unless they also didn’t pay substantial tax. \nStill, it’s a legal provision to note – non-filing is a serious offense in eyes of law.  \nInaccurate Reporting and Understatement: If  an MSME files a return but understates income or overstates \ndeductions, penalties can apply:  \nSection 270A (Underreporting/Misreporting Penalty): For underreported income, a penalty of 50% of the tax on \nthe underreported amount is levied. If the underrepor ting is due to deliberate misreporting (like false entries, \nconcealment, claiming bogus expenses), the penalty is 200% of the tax on that portion19L219 -L227. For example, \nif a trader conceals Rs.10 lakh of sales (tax Rs.3 lakh) and gets caught, they might pay additional Rs.1.5 lakh (50%) \nif it was a simple omission, or Rs.6 lakh (200%) if it was willful concealment. This is imposed during assessment if \ndiscrepancies are found.  \nThese replace the older Section 271(1)(c) penalty for “concealment or furnishing inaccurate particulars.” The new \nregime is more objective: if assessed income is higher than returned, penalty triggers, unless one fits exceptions \n(like a valid bonafide claim). Takeaway: Always report all income, and if something is uncertain, disclose i t. If an \nMSME realizes post -filing that something was missed, they should revise the return before assessment to avoid \nthese heavy penalties.  \nTax Audit default (Section 271B): If required to get a tax audit (as discussed under Tax Audit section) but the \nMSME fails to do so by the deadline, a penalty up to 0.5% of turnover (max Rs.1,50,000) can be levied. Often \nofficers levy the max Rs.1.5L for non -compliance. If there’s reasonable cause (illness, etc.), this can be waived.  \nMaintenance of books (Section 271A ) & documentation: If the MSME is required to maintain books (under Section \n44AA) but doesn’t, a penalty of Rs.25,000 may be imposed.  \nTDS/TCS related penalties:  \nSection 271H: For failure to file TDS/TCS statements within a year of due date or filing incorrect details, a penalty \nRs.10,000 to Rs.1,00,000 can be levied (in addition to late fees).  \nSection 271C: For failure to deduct or pay TDS, penalty equal to the amount not deducted/paid can be imposed. \nAnd as noted, Sec 276B can prosecute for willful d efault in depositing TDS (possible jail up to 7 years). MSMEs \nshould be extremely careful with TDS compliance – the tax dept pursues TDS defaults stringently since that’s trust \nmoney.  \nProsecution for Tax Evasion (Section 276C): If an MSME willfully attempt s to evade tax (for instance, by falsifying \naccounts), and the amount of tax sought to be evaded exceeds Rs.25 lakh, rigorous imprisonment of 6 months to 7 \nyears can be imposed (with fine)15L19 -L2715L39 -L47. If the amount is less than Rs.25L, imprisonment 3 months \nto 2 years possible. This is again for serious fraud cases – say fictitious expenses, multiple sets of books. Small \nerrors won’t land you here, but systematic evasion might. Similarly, 276CC for willful non -filing we discussed. \nThere’s also 277 (f alse statement in verification) – e.g., lying in return or verification, which can invite jail too.  \nPenalty for Furnishing False Information (Section 270A/271AAD): A new Section 271AAD (inserted in 2020) \nspecifically penalizes those who have false entries or omit entries in books to evade tax – penalty is equal to the \naggregate false entries amount. This aims at curbing fake invoices etc. While this is more connected to GST fake \ninvoice racket, it can apply in income tax if books are cooked. So ethical book keeping is a must.  \nPenal Interest: In addition to penalties, remember interest on late payment is statutory and unavoidable: Section \n234B for not paying advance tax (1%/month on shortfall), 234C for deferment of advance tax (1% for a short \nperiod on shortf all in installment), 234A for filing delay (1% per month on unpaid tax).  \nIllustration of penalties: Suppose a medium MSME company did not file its FY 2023 -24 return by Oct 31, 2024. It \nfinally files in Feb 2025 showing Rs.10 lakh tax due. It will pay late fee Rs.5,000, plus 234A interest (Nov, Dec, Jan, \nFeb = 4 months at 1% = 4% of Rs.10L = Rs.40k interest). Also since it paid tax late, 234B interest from April 1, 2024 \nto Feb 2025 (~11 months) = 11% of Rs.10L = Rs.1.1L. These are significant costs (together  ~Rs.1.55L on a Rs.10L \ntax). If audit was applicable and not done, add penalty up to Rs.1.5L. You can see delays can cause multi -fold \nincrease in liability.  \nSummary: File returns on time, report accurately, maintain documentation, and comply with audit/TDS  \nrequirements. Penalties in tax laws are stringent to encourage compliance. For honest mistakes or minor lapses, \none can often request waiver (u/s 273B many penalties can be forgiven for reasonable cause). But deliberate non -\ncompliance can not only hurt fi nancially but also risk the business owner’s liberty. MSMEs should ideally use \nprofessional advice (CA/Tax practitioners) at least in initial years to set up robust compliance processes.  \nStartup -Specific Taxation Benefits.  \nThe government has recognized tha t startups (innovative, high -growth potential MSMEs) need special support. \nThus, in the past few years, several tax incentives for startups have been introduced. These are particularly \nrelevant to MSMEs that qualify as “Startups” under the Department for P romotion of Industry and Internal Trade \n(DPIIT) framework (often tech startups, product innovators, etc.). Key benefits include a profit tax holiday (Section \n80-IAC), relief from the so -called “Angel Tax” on investments, and other advantages upon DPIIT rec ognition. We \ncover these below.  \nTax Holiday for Startups (Section 80 -IAC).  \nSection 80 -IAC of the Income Tax Act provides a 100% tax deduction on profits for eligible startups for 3 years out \nof a block of 10 years. In other words, a recognized startup can enjoy three consecutive years of tax -free profits, \nwhich significantly helps them reinvest and grow.  \nKey points about this benefit:  \nEligibility: The startup must be incorporated as a private limited company or LLP on or after April 1, 2016 and \nbefore the s pecified cut -off date. Originally the window was till March 2021, which got extended to March 2023, \nthen March 2024, then March 2025, and in the latest Union Budget 2025, it’s extended to startups incorporated up \nto March 31, 203018L383 -L39218L394 -L402. Th is extension by five years allows more new startups to qualify. \nAlso, the startup must be DPIIT -recognized as an eligible startup (innovation, scalable business, etc.) and approved \nby the Inter -Ministerial Board (IMB) for this tax holiday.  \nTurnover conditi on: The turnover of the startup should not have exceeded Rs.100 crore in any of the relevant \nyears17L39 -L47 (this limit was earlier Rs.25cr, increased to Rs.100cr in 2020 to broaden eligibility17L39 -L47). \nThis ensures it’s small/mid -size and not an establi shed big company.  \nBenefit: 100% of profits derived from the eligible business are deductible for 3 out of 10 years (the startup can \nchoose the 3 years, typically the first profitable years within its first 10 years of existence). These need not be the \nfirst 3 years – a startup can defer until it’s actually making profits. This is huge – effectively a tax holiday. For \nexample, a tech startup that turns profitable in year 4 with Rs.2 crores profit, and in years 4 -5-6 it makes profits, \ncan claim 100% deduction  each of those years, paying zero income tax on those profits.  \nProcedure: The startup must apply to DPIIT for recognition and separately specifically apply for 80 -IAC approval \n(the IMB approval, though nowadays DPIIT recognition letter often suffices if cr iteria met). The deduction is \nclaimed in the ITR by providing your recognition details and a declaration that conditions are satisfied. The tax \naudit report (Form 3CD) also has a clause to mention if 80 -IAC claimed.  \nQualified Business: It should be in an i nnovative/scalable business model with high potential for employment or \nwealth creation. Generally, tech, biotech, e -commerce, etc., qualify. Merely rehash businesses may not. But the \ndefinition is broad enough that thousands of startups have gotten DPIIT status.  \nNo AMT for startups: Usually if any entity claims 100% deduction, alternate minimum tax (AMT) would catch it \n(for LLPs) at 18.5%. However, startup profits deduction under 80 -IAC is specifically allowed without invoking \nAMT, provided they are recognized (the Finance Act 2018 exempted eligible startups from AMT). So LLP startups \ntoo effectively get full benefit.  \nLatest update: As mentioned, Budget 2025 extended the incorporation deadline to April 1, 2030 for availing this \ntax holiday18L383 -L392.  So the scheme is alive for rest of the decade for new startups. They also extended the \nperiod in which the 3 -year holiday can be claimed from first 7 years to first 10 years of operations17L35 -L43, \nacknowledging that many startups take longer to become pr ofitable. This extension to 10 years was done in Budget \n2021.  \nThe result is a qualifying startup can basically be tax -free on profits for 3 years. This helps attract investors too, \nsince the startup can plow back profits entirely into growth, boosting valu ations.  \nAngel Tax and Exemption for Startups.  \nThe term “Angel Tax” refers to income tax on capital raised by unlisted companies from investors, under Section \n56(2)(viib). Under this provision, if a closely -held company issues shares at a price above the fa ir market value, the \nexcess consideration is treated as income of the company (taxable under “Income from other sources”). This was \nintroduced to deter laundering money as share premium. However, it inadvertently hit startups raising funding at \nhigh valuat ions (the premium reflecting future potential, not current assets).  \nAngel Tax issue: For example, a startup issues shares at Rs.1000/share whereas net asset value is maybe \nRs.100/share – the Rs.900 premium per share could be taxed if FMV not substantiated to the tax authorities’ liking. \nThis created a scenario where cash -strapped startups faced huge tax bills on genuine angel investments.  \nExemption via DPIIT: To solve this, the government allowed DPIIT -recognized startups to get an exemption from \nSec 56(2)( viib). Startups that meet certain conditions (like not investing in idle assets like land, luxury cars out of \nthe funds, etc.) and whose paid -up capital+share premium after issue does not exceed Rs.25 crore (later Rs.50 \ncrore) can apply so that any share p remium received is not taxed19L229 -L23819L233 -L241. The startup has to be \nrecognized and then separately apply to DPIIT/Income Tax for this relief (earlier via Form 2). Once approved, \ninvestments from resident investors (angel investors, etc.) are exempt f rom this tax.  \nRecent Development: In a surprising and positive move, Union Budget 2024 -25 proposed to abolish the angel tax \nfor all classes of investors19L183 -L191. This means removing Section 56(2)(viib) entirely or modifying it such that \nno startup or pr ivate company faces tax on genuine equity investment. The Finance Minister explicitly noted the \nintent to boost startups by abolishing this so -called angel tax19L183 -L19119L197 -L201. This was a much -awaited \nstep as previously only DPIIT -recognized startups  (primarily domestic funding) were exempt, and in 2023 they \nhad even extended angel tax to foreign investors (which caused concern in the VC community). The proposal \nindicates that all investments in startups will not attract this tax, leveling the field. By the latest indications, this \nmeasure should take effect, providing tremendous relief. [As of April 2025, it’s indicated in the Budget speech, \npresumably to be enacted in Finance Act 2025].  \nIn essence, the angel tax exemption means startups can raise fun ds at high valuations without fear of a tax on the \ncapital raised. This encourages more angel and venture capital inflow. Startups should still maintain proper \nvaluations and documentation (like valuation reports, pitch decks, etc.) in case questions arise , but the safe \nharbour via DPIIT recognition or law change shields them.  \nOther Investment -related benefits:  \nSection 54GB (Capital gains for startup investment): If an individual sells residential property and invests the \nproceeds into a startup (eligible c ompany) as equity, the capital gain can be exempt. This was available for \ninvestments in startups up to March 2024, now extended similarly along with 80 -IAC timeline (presumably to \n2025 or further) as part of supporting startups. This helped channel person al capital into startups.  \nSection 79 (Carry forward losses in startups): Normally, a company’s losses lapse if there’s >51% change in \nshareholding. But an eligible startup is allowed to carry forward losses even if original promoters’ share falls below \n51%, as long as all original shareholders (who held shares in the year of loss) continue to hold some shares on last \nday of the year of set -off17L41 -L47. Budget 2023 had already relaxed this to some extent. This acknowledges that \nstartups raise multiple fu nding rounds diluting founders below 51%. So, losses don’t vanish, which is investor -\nfriendly.  \nESOP Tax Deferral: Not exactly a benefit to the company’s tax, but for its employees – employees of eligible DPIIT \nstartups have an option to defer the tax on ES OPs allotted (normally employees are taxed when they exercise stock \noptions on the “perquisite” value). For startup employees, tax can be deferred for 5 years or until they leave or sell \nthe shares, whichever earliest. This was introduced to help startup t alent not face immediate heavy tax on illiquid \nshares. For the startup, this is a selling point to attract talent.  \nAll these combine into a supportive tax environment for startups. An MSME that fits the startup definition should \ndefinitely seek DPIIT recog nition via Startup India platform to avail these:  \nTax holiday (80 -IAC) – need recognition and profit to use it.  \nAngel tax exemption – critical when raising angel/seed funding.  \nLoss carryforwards, ESOP deferral – to manage future finances.  \nBudget 2025 speci fically: By extending the incorporation date to 203018L383 -L392 and proposing angel tax \nremoval19L183 -L191, the startup tax landscape is made very attractive. Essentially, India is offering new startups \nup to 3 years profit tax -free, unlimited investment w ithout tax, and other perks – aiming to fuel entrepreneurship.  \nOther Tax Advantages and Schemes for Startups.  \nThough the question highlighted 80IAC and angel tax, a brief mention of a couple of other relevant points:  \nR&D Incentives: Startups engaged in inn ovation can make use of R&D deductions. Earlier there was Section \n35(2AB) weighted deduction (which became 100% from Apr 2020) for approved in -house R&D. If a startup is into \nscientific R&D, it can get approval to deduct those expenses (though weighted ben efit was curtailed).  \nGST for startups: No special GST rates for startups, but certain sectors (like EVs, bio -tech) get concessional rates \nwhich indirectly help some startups. Also, services exported by startups (IT services etc.) are zero -rated (no GST, \nand input refund available), which is a boon for SaaS startups working globally.  \nCustoms and others: Startups recognized by DPIIT can sometimes get faster customs clearance, or participate in \ngovernment procurements under relaxed criteria.  \nIn summary, for a qualifying startup MSME, the income tax environment is quite beneficial: they can avoid paying \nincome tax in the critical early years (using 80 -IAC), raise capital freely (no Sec56 hassle), and even when they do \npay, the corporate rate is low (e.g., they m ight opt for 22% regime after holiday). Founders should ensure \ncompliance with the scheme conditions (like timely filings, not investing in prohibited assets from the funds, \nkeeping turnover under Rs.100cr during holiday period, etc.). It’s recommended to consult a tax advisor when \nplanning to claim these benefits, to correctly follow procedures and documentation (for instance, to claim 80 -IAC, \nyou must have a board resolution choosing the years, etc.). Proper execution will secure the intended tax savings \nand avoid any future denial of the deduction.  \nPenalties and Punishments under Tax Laws (Income Tax & GST).  \nIt is important for MSMEs to be aware of the penalties for non -compliance under both Income Tax and GST law. \nThis ensures they understand the risks o f lapses and take compliance seriously. Here we summarize the various \npenalties and punitive provisions under each law:  \nUnder the Income Tax Act.  \nLate Filing Fee (234F) and Interest (234A/B/C): As discussed, late filing of return attracts a fee up to \nRs.5, 00022L78 -L86. Late payment of tax results in interest: 1% per month for late filing on due tax (234A), for \nshortfall in advance tax (234B), and on deferment of advance installments (234C). These are automatic and added \nto demand if return filed late or tax  unpaid.  \nPenalty for Under -reporting (270A): If the assessed income > returned income (and not due to just a genuine claim \ndifference), 50% of tax on the difference is levied. For deliberate misreporting (e.g., fake invoices, willful \nconcealment), it becom es 200% of tax19L219 -L227. This covers income misreported, false expenditures, etc. The \nonly way to avoid this penalty is to ensure accurate reporting or use the updated return scheme to come clean \nbefore being caught.  \nPenalty for Not Getting Accounts Audi ted (271B): If required to have a tax audit (due to turnover beyond limit or \nother conditions) and one fails to do so by the deadline, a penalty of 0.5% of turnover (maximum Rs.1,50,000) may \nbe levied. For example, if turnover is Rs.3 crore and audit not d one, penalty could be Rs.1.5 lakh. This can be \ndropped if reasonable cause is shown (e.g., illness, etc.), but one cannot assume leniency.  \nPenalty for Inadequate Record -Keeping (271A / 271AA): Rs.25,000 for not maintaining required books of account \n(for ge neral businesses) or documentations (for specified domestic/ international transactions, it can be higher). \nMost small MSMEs won’t face 271AA (that’s for transfer pricing documentation), but 271A is relevant if one should \nkeep books but doesn’t.  \nTDS Defaul t Penalties:  \nFailure to deduct or pay TDS: Penalty equal to the TDS amount (271C) can be imposed. Eg, if Rs.50k TDS not \ndeducted, Rs.50k penalty. Additionally, disallowance of related expense (40(a)(ia) adds 30% back to income).  \nLate filing of TDS return: Penalty 271H can range from Rs.10k to Rs.1L (in addition to late fee). Usually imposed if \nreturn is filed over a year late or is not filed at all.  \nIssuing false TDS certificates or not issuing: a fine up to Rs.100 per day of default (272A) – relatively min or but still \nsomething to avoid.  \nProsecution Offences: Income Tax law contains criminal provisions for serious offences:  \nWillful tax evasion (276C): If proven that one willfully attempted to evade tax > Rs.1 lakh (threshold increased to \nRs.25L for severe p unishment15L19 -L2715L23 -L31), imprisonment can be up to 7 years. Typically applied in \ncases like maintaining double books, fake billing rackets, etc.  \nFailure to file return (276CC): As noted, if tax > Rs.10k and not filed, jail up to 7 years possible15L1 -L915L21 -L24. \nThe law does allow that if all tax due is below Rs.10k (small taxpayers) then no prosecution15L21 -L24.  \nFailure to deposit TDS (276B): Willful default in depositing TDS to government also can invite imprisonment up to \n7 years. This is to treat m isuse of deducted taxes harshly.  \nFalse statements (277) and obstructing tax officer (276) also have jail provisions of varying terms.  \nGenerally, prosecution is reserved for flagrant violations and usually after giving opportunity via \nnotices/assessment. But they are a real risk if one ignores notices or consistently cheats.  \nOther miscellaneous penalties:  \n271AAC: For unexplained income (like cash credits under sec68 etc.) which is taxed at 60% under sec 115BBE, an \nadditional 10% penalty of tax can apply if  not disclosed and assessed later.  \nPenalty for fake entry (271AAD): As mentioned, equal to amount of fake entry, plus on any other person who \nfacilitated it also equal amount. This is to deter issuance of.  \nUnder the GST Act.  \nLate Filing Fees: Failing to fi le GST returns on time leads to fixed per -day late fees. For regular returns like GSTR -1 \nand GSTR -3B, the standard late fee is Rs.50 per day of delay (Rs.25 under CGST + Rs.25 SGST)16L13 -L17. If the \nreturn is a “Nil” return (no transactions), a reduced fee  of Rs.20 per day (Rs.10+Rs.10) applies16L13 -L17. These \naccrue from the due date till actual filing, subject to caps. The government has set maximum late fee caps to \nprovide relief to small taxpayers: for taxpayers with turnover up to Rs.1.5 crore, late fe es are capped at Rs.2,000 \nper return; for Rs.1.5 –5 crore, capped at Rs.5,000; for above Rs.5 crore, capped at Rs.10,000 (for each GSTR -\n3B/GSTR -1). There are similar late fees for annual returns (GSTR -9) if filed late (generally Rs.200 per day, capped \n0.5% of turnover). Frequent amnesty schemes have been offered to waive or reduce accumulated late fees for past \nperiods if returns are filed within certain windows – MSMEs should take advantage of these to clear backlogs. \nHowever, the clear message is to file r eturns timely to avoid these compounding fees.  \nInterest on Late Payment: If GST tax dues are paid late (i.e., declared in GSTR -3B after the due date or output tax \nwas not paid), interest is charged at 18% per annum on the shortfall for the period of delay1 6L13 -L17. For \ninstance, if an MSME had Rs.1,00,000 of GST payable for March and paid it 2 months late, interest about Rs.3,000 \nwould apply. If excess ITC was claimed and later reversed, interest at 24% may apply for that period (higher rate \nfor undue ITC o r output tax collected but not paid to government). Interest under GST is mandatory and there is no \nwaiver provision (except in cases of net cash tax during COVID extensions or specific relief by notification). So, \ntimely tax payment (or filing even if lat e but with due interest) is crucial.  \nGeneral Penalties for Non -Compliance: The GST law prescribes a general penalty up to Rs.25,000 (CGST Rs.25k + \nSGST Rs.25k, so Rs.50k total) for any contravention of the Act or rules for which no specific penalty is prov ided \n(Section 125). This could cover minor offenses like not displaying GSTIN, minor clerical errors, etc. In practice, this \nis rarely imposed to the maximum for MSMEs unless there’s persistent non -compliance.  \nPenalty for Tax Shortfall – No Fraud (Section 73): If a tax shortfall or wrong ITC is identified in audit/scrutiny \nwithout any intent to defraud (i.e., a bona fide error), and the taxpayer pays the due tax with interest after a show -\ncause notice, the officer can impose a penalty of 10% of the tax amou nt (with a minimum of Rs.10,000)16L15 -L17. \nOften if the taxpayer voluntarily complies upon detection (pays before the notice or immediately after), the \nauthorities may waive the penalty or charge the minimum. Section 73 essentially says for non -fraud cases , no \npenalty if paid before show -cause notice, 10% penalty (min Rs.10k) if paid after notice but within the timeline of \norder. MSMEs should, therefore, proactively correct mistakes (e.g., use the DRC -03 form to pay any tax liabilities on \ntheir own) to avoi d formal penalties.  \nPenalty for Tax Evasion – Fraud Cases (Section 74): If the shortfall is due to fraudulent intent, willful misstatement \nor suppression of facts – e.g., deliberate fake invoices, hiding sales – then penalties are much harsher. In such cas es, \nthe penalty can be equal to the tax evaded, i.e., 100% of the tax (minimum Rs.10,000)19L183 -L191. However, GST \nlaw incentivizes cooperation: if a fraud case taxpayer pays the full tax, interest, and 15% penalty at the stage of \ninspection (before notice ), further proceedings are dropped (i.e., 85% penalty waived). If payment is made after \nnotice but within 30 days of adjudication, a 25% penalty can apply. Otherwise, post 30 days, a full 100% penalty \nmay be levied in the order. For example, if an MSME was  found to have suppressed sales leading to Rs.5 lakh tax \nevasion, the penalty could be Rs.5 lakh on top of tax if it fought the case and lost; but only Rs.0.75 lakh (15%) if it \ncame forward early. The takeaway: don’t engage in willful evasion, and if any d iscrepancy occurred, it’s better to \ncome clean early.  \nPenalty for Wrongful ITC claims: Apart from the above general framework, note that claiming input tax credit \nwithout actual receipt of goods/services or on fake invoices is considered “fraud” – penalty equal to the ITC \namount and interest will apply. Nowadays, GST systems catch many mismatches, so the risk -reward of trying to \ncheat on ITC is extremely poor.  \nE-Way Bill and Transport Penalties: If goods are transported without a required e -way bill or with  incorrect \ndocumentation, the goods can be detained by officers. To release them, the owner/transporter must pay applicable \ntax and a penalty of 100% of the tax (for voluntary payment, effectively 200% of tax if it goes to order) as per \nSection 129. For in stance, goods worth Rs.1,00,000 taxable @18% (Rs.18k GST) moved without e -way bill can be \nseized and released on payment of Rs.18k tax + Rs.18k penalty. If the owner does not come forward, the penalty is \nhigher (50% of value of goods). Continued non -resolu tion can result in confiscation (Section 130) where penalties \ncan go even higher. For MSMEs, it’s vital to comply with e -way bill rules to avoid such disruptive and costly \nenforcement actions. There’s typically no tolerance on this because it’s black -and-white compliance.  \nProsecution for Offences (Section 132): The GST Act lists certain offenses that, if committed and the amount of tax \ninvolved exceeds thresholds, can lead to criminal prosecution (arrest and jail). These offenses include: tax evasion, \nfraud ulent availment of ITC, issuance of fake invoices, collecting tax and not depositing to government for over 3 \nmonths, etc. The punishment scales with the amount:  \nTax evaded or wrongful credit > Rs.5 crore: up to 5 years imprisonment and fine (this is cogni zable and non -\nbailable)18L397 -L404.  \nRs.2 to 5 crore: up to 3 years and fine.  \nRs.1 to 2 crore: up to 1 year and fine.  \nBelow Rs.1 crore (for certain offenses) and other lesser offenses usually do not carry imprisonment for first -time \noffense, but repeat offe nses can. Examples: A fake invoicing racket where a person passes Rs.10 crore of fake \ncredits – that promoter can face 5 years in jail. Or an MSME that collected GST Rs.50 lakhs from customers but \ndeliberately didn’t file returns or pay for over many month s can face prosecution (since that is essentially \nembezzling tax). While small inadvertent mistakes won’t trigger this, fraud is taken very seriously under GST. In \nfact, the GST department has actively arrested persons involved in issuance of fake invoices  to pass ITC. MSMEs \nshould steer clear of any “billing schemes” or advice to boost credits through dubious means – not only are \npenalties massive, one could land in jail.  \nCompounding of Offences: There is a provision to compound offenses (avoid prosecution  by paying a compounding \nfee) except for grave ones, but the fee can be high and prosecution itself is a reputational damage. Best is to remain \ncompliant.  \nMiscellaneous: Other GST penalties include: Rs.10,000 or tax amount (whichever higher) for not taking  registration \nwhen required, for issuing invoice without supply (fake invoice) it’s considered a serious offense (penalty and \nprosecution), for using composition scheme despite being ineligible, etc. Also, penalty for late payment: if tax is not \npaid even after 3 months of due date in an annual return, a penalty of 10% may apply. But practically, most of these \nget subsumed under the main ones we covered (either a 73/74 demand or an e -way issue, etc.).  \nIn summary, GST penalties can be stiff but are avoidable  with honest compliance. The regime basically gives an \nMSME taxpayer two big asks: file your returns on time and pay the collected taxes on time. Do this, and you \neliminate 90% of the penalty risk (just leaving manageable late fees or interest if a mistake  happens). If an MSME \nmakes an error, it should rectify it, pay any differential voluntarily, and communicate with the department if \nneeded – this good faith goes a long way to preventing the issue from escalating to a punitive stage.  \nRecent Updates and Ch anges (Union Budget 2024 –25 and Finance Act 2025).  \nThe landscape of taxation is dynamic. The latest Union Budget announcements and Finance Acts have introduced \nchanges that impact MSMEs. Here are some notable recent updates (as of 2024 –2025) that MSMEs sho uld be \naware of:  \nRevised MSME Definition (Budget 2025): As mentioned earlier, Budget 2025 has approved a significant raise in the \ninvestment and turnover limits for MSME classification – investment limits up by 2.5× and turnover limits by 2×. \nOnce this is notified, many companies will continue to be classified as micro/small/medium for longer as they \ngrow. For example, a unit with Rs.8 crore investment and Rs.80 crore revenue was earlier “medium” (and would \nlose some MSME scheme benefits if it grew beyond t hat); now it will still be “small” (new limits Rs.25cr/Rs.100cr \nfor small). Tax relevance: While tax laws don’t directly change by MSME status, various indirect benefits occur. \nMore firms staying in MSME category means they can avail schemes like priority lending, delayed payment \nprotection etc., which indirectly improve their financial health and compliance capacity. Also, tax disallowance \nprovisions linked to MSME Act (payment within 45 days) will now cover more buyer -seller relationships as more \nsupplier s qualify as MSME under expanded limits.  \nIncome Tax Presumptive Limits Extended: The Finance Act 2023 (applicable from AY 2024 -25) increased the \nturnover thresholds for presumptive taxation. Section 44AD limit was raised from Rs.2 crore to Rs.3 crore (and \n44ADA from Rs.50 lakh to Rs.75 lakh) provided cash receipts do not exceed 5% of total14L69 -L72. This is a boon \nfor slightly larger small businesses – e.g., a trader with Rs.2.5 crore sales (all digital) can now use 44AD \npresumptive whereas earlier he’d be pushed to maintain books. This change encourages digital transactions and \nextends the benefit of simpler taxation to larger MSMEs. MSMEs should note the 95% digital condition – ensure \nreceipts and payments in cash stay below 5% to leverage these higher lim its. Budget 2024 did not make further \nchanges to these, so they remain as is.  \nStartup Tax Holiday Window Extended: The eligibility period for startups to incorporate and avail the Section 80 -\nIAC tax holiday was extended in Budget 2024 by one more year to M arch 31, 202519L229 -L23819L233 -L241, and \nthen dramatically in Budget 2025 to March 31, 203018L383 -L392. Now any startup incorporated up to 1 April \n2030 can potentially get the 3 -year profit tax holiday, giving a long runway for new startups to be set up an d still \nqualify. Also reaffirmed is the condition that the startup’s turnover should be under Rs.100 crore to use it17L39 -\nL47. MSME startups should expedite getting DPIIT recognition to avail this when they hit profitability. The \nextension to 2030 is a maj or commitment by the government to foster the startup ecosystem in the long \nterm18L394 -L402.  \nAngel Tax Abolition for Startups (Budget 2024 proposal): In the Union Budget 2024 -25, the Finance Minister \nproposed abolishing the so -called “angel tax” for all in vestor classes19L183 -L191. This means Section 56(2)(viib), \nwhich taxed share premium received from (Indian) investors, is set to be scrapped or made inapplicable to \nstartups. Previously, DPIIT -recognized startups could get exemption on a case -by-case basis ; the proposal is to \nmake a blanket removal, which is extremely positive for startups seeking capital. This change, once enacted, will \nremove the ambiguity and fear during funding rounds. It’s expected to substantially boost investment as noted by \nindustry  reactions19L219 -L227. (Note: For foreign investors, from FY 2023, angel tax was ironically extended to \nthem; this move would reverse that as well, treating all investors equally with no angel tax.).  \nRelief in TDS Compliance: Budget 2025 brought a relief f or businesses by raising the TDS threshold on rent under \nSection 194I from Rs.2.4 lakh to Rs.6 lakh per annum23L69 -L73. This means MSMEs (or anyone) paying rent up to \nRs.50,000 per month will not need to deduct TDS. It aligns with Section 194IB threshold a nd reduces compliance \nfor small offices/shops. This is effective from April 1, 2025. Similarly, earlier budgets had rationalized certain TDS \nrates (e.g., reducing TDS on some payments like insurance commission from 5% to 2%21L15 -L23 to increase post -\ntax ca sh with small agents). These help MSMEs by simplifying or lightening TDS duties in specific areas.  \nTimely Payments to MSMEs – Disallowance (Budget 2023): To ensure MSMEs get paid on time by their buyers, \nFinance Act 2023 added a new provision (Section 43B( h)) that disallows as an expense any payment to an MSME \nnot made within the mandated 45 days credit period (as per MSMED Act)22L78 -L86. In essence, if a big company \nbuys from a small MSME and doesn’t pay by 45 days, that expense can’t be claimed as deducti on until it’s actually \npaid. This became effective Apr 1, 2023. For MSMEs, this is a positive reform – it puts pressure on customers to pay \npromptly or lose tax benefit. Indirectly, it improves MSME cash flow and reduces bad debts. MSMEs should still be \nproactive in collecting dues, but now they have the tax law nudging their debtors. (This doesn’t directly affect the \nMSME’s taxes, but it’s a noteworthy change in the tax landscape for MSMEs’ benefit.).  \nDecriminalization and Easing Measures: The government i s working on decriminalizing minor economic offenses. \nThe Jan Vishwas (Amendment of Laws) Bill 2022/2023 aims to revise various provisions including some in the \nIncome Tax Act and GST to reduce jail provisions for small offenses and instead levy penalties.  Budget 2025 \nspecifically mentioned Jan Vishwas Bill 2.0 to decriminalize over 100 provisions across laws23L64 -L72 – this could \nfurther reduce the fear of imprisonment for minor compliance issues, which is good for honest MSMEs. \nAdditionally, Budget 2025 i ncreased the time limit for filing updated returns from 2 to 4 years23L67 -L70, giving \ntaxpayers more chance to correct omissions. For MSMEs, this means if you discover an income or deduction issue \neven 3 years later, you can still make it right by paying d ue tax plus interest and a small additional tax.  \nGST Developments: Though not part of the Union Budget (GST changes come via GST Council), it’s worth noting:  \nE-invoicing threshold was reduced to Rs.5 crore from Aug 202335L19 -L2735L47 -L55, which is a significant \ninclusion of smaller firms into the digital invoicing net. MSMEs slightly above Rs.5cr should have implemented this.  \nThere’s ongoing work to set up the GST Appellate Tribunal (GSTAT) which will help resolve disputes faster, as \napproved in Counc il and by amendments in 2023. This will benefit MSMEs stuck in litigation, once operational in \n2024.  \nGST rate or scheme changes: The composition scheme limit remains Rs.1.5cr (no change in recent budget). But GST \nauthorities have been focusing on simplifyi ng compliance: e.g., biometric authentication in high -risk registrations \nto curb fake firms (affecting new MSMEs in a positive way by reducing competition from fake entities).  \nMSMEs should also note, effective 1 Oct 2023, TCS (Tax Collected at Source) on E PF withdrawal or on foreign \nremittances changed, but those are peripheral unless they engage in such transactions.  \nIn conclusion, the recent budgets of 2024 and 2025 have largely been favorable to MSMEs: extending lucrative \nstartup tax breaks, expanding MS ME definitions, easing TDS and other compliance, and proposing bold steps like \nangel tax removal. It shows policy is inclined to simplify and support small businesses and startups. MSMEs should \nstay updated with these changes to take full advantage (e.g., restructure timing of incorporation or transactions to \nbenefit from new rules, ensure compliance processes adapt to threshold changes, etc.).  \nConclusion.  \nTaxation for MSMEs encompasses a broad spectrum – from income tax on profits to GST on sales – and \nund erstanding the rules is vital for sustainable business growth. This comprehensive guide has detailed how \nMSMEs can opt for simplified schemes (like presumptive tax or composition GST), comply with routine obligations \n(filings, audits, TDS), and leverage sp ecial benefits (startup tax holidays, exemptions) while avoiding pitfalls that \nlead to penalties. With recent reforms, the compliance burden is gradually easing and incentives are growing, but \nthe onus remains on entrepreneurs to be diligent and timely in their tax matters.  \nBy adhering to the norms – maintaining proper records, meeting due dates, paying dues honestly – an MSME can \nnot only steer clear of penalties and legal troubles but also optimize its tax outflow through legitimate means. For \ninstance, u sing presumptive schemes can save effort and taxes if margins are higher, claiming all eligible \ndeductions/credits reduces liability, and availing startup concessions can virtually eliminate tax in initial \nyears18L399 -L406. On the flip side, neglecting com pliance can cost heavily in fines, interest, or lost credit \nopportunities.  \nIt’s advisable for MSMEs to periodically consult with a tax professional or utilize government -facilitated helpdesks, \nespecially when scaling up, to ensure all tax strategies and co mpliance are aligned with the latest laws (which, as \nwe saw, do change with budgets). The government’s push towards digital compliance (GST, e -invoicing, online \nassessments) means MSMEs should invest in basic accounting and tax software – this not only mak es compliance \neasier but also provides financial insights for the business.  \nIn summary, tax laws might seem complex, but they offer many provisions favorable to MSMEs. With informed \nplanning and punctual compliance, Indian MSMEs can minimize their tax impa ct and focus on growth, innovation, \nand contributing to the economy – exactly what the tax incentives and schemes aim to facilitate. As of 2025, the \nenvironment is arguably the most MSME -friendly it has ever been in terms of taxation; it’s up to entreprene urs to \nseize these opportunities responsibly.  \nSources.  \nMinistry of MSME – Definition and Classification updates.  \nIncome Tax Act & Rules – Presumptive taxation sections (44AD/ADA/AE)14L53 -L6114L69 -L72; Startup tax \nprovisions (80 -IAC, 56(2)(viib))18L383 -L392 19L183 -L191.  \nUnion Budget 2024 -25 and 2025 -26 documents – Speeches and Memoranda19L183 -L19118L394 -L40223L69 -L73.  \nGST Act & Rules – Compliance requirements, penalties16L13 -L1719L219 -L227; Budget announcements on GST e -\ninvoicing and thresholds35L47 -L55.  \nTaxa tion of Indian MSMEs: A Comprehensive Guide.  \nIndian Micro, Small, and Medium Enterprises (MSMEs) form the backbone of the economy. This guide provides a \ndetailed overview of all tax aspects relevant to MSMEs – covering direct taxes ( . \nand indirect taxes ( GST), compliance requirements, special schemes, penalties for non -compliance, and r . \ntory updates. It is organized for clarity with short sections, bullet points, and clear headings, making it easy to scan \nand reference.  \nUnderstanding MSME Categories and Taxation.  \nMSME Classification: Under the MSME Development Act, enterprises are classified by investment in plant & \nmachinery/equipment and annual turnover. As of 2020, the criteria were: Micro – investment up to Rs.1 crore and \nturnover up to Rs.5 crore; Sm all – investment up to Rs.10 crore and turnover up to Rs.50 crore; Medium – \ninvestment up to Rs.50 crore and turnover up to Rs.250 crore. In Union Budget 2025, the government announced a \nrevised MSME definition with significantly higher limits (investment limits 2.5× and turnover limits 2× the \nprevious values). Once enacted (Finance Act 2025), Micro enterprises will be defined as investment up to Rs.2.5 \ncrore and turnover up to Rs.10 crore, Small up to Rs.25 crore investment and Rs.100 crore t . \nMedium up t o Rs.125 crore investment and Rs.500 crore turnover. This expanded definition allows growing \nbusinesses to retain MSME status (and related benefits) for longer.  \nRelevance to Taxation: The MSME classification itself does not create separate income tax slabs  or GST rates. \nMSMEs are generally subject to the same tax laws as other businesses. However, many tax provisions and \ncompliance thresholds are designed to benefit smaller businesses, which effectively align with MSME sizes. For \nexample, presumptive taxati on schemes, higher thresholds for tax audits, GST composition schemes, and certain \nstartup tax exemptions are targeted at small enterprises. Moreover, the government uses MSME criteria to extend \nspecific reliefs (like delayed payment provisions) and design  policy support. In summary, while an MSME pays \ntaxes under normal tax rules, being in the MSME category often makes the enterprise eligible for simplified \nschemes, lower compliance burdens, or tax incentives aimed at supporting small businesses.  \nDirect Ta xes on MSMEs (Income Tax).  \nMSMEs in India can be structured in various legal forms – sole proprietorships, partnership firms (including LLPs), \nor private limited companies. Direct tax rules (income tax) vary based on the fo . \nss. Below we cover applicable tax rates (slabs), presumptive taxation schemes for small taxpayers, filing \nrequirements for different entities, Tax Deducted at Source (TDS) obligations, key deadlines with interest/late fees, \nand tax audit provisions.  \nIncome Tax Rates for MSME Businesses . \nSole Proprietors (Individuals): A proprietorship’s income is taxed in the hands of the individual owner. Individual \ntax slabs apply – which are progressive rates based on income. Under the regular (old) regime for FY 2024 -25, \nincome up to Rs.2.5 lakh is tax-free, then 5% on Rs.2.5 –5 lakh, 20% on Rs.5 –10 lakh, and 30% beyond Rs.10 lakh \n(with rebates for low incomes). Alternatively, individuals can opt for the new income tax regime (lower rates with \nno deductions) – for FY 2024 -25 this has slabs of 0% up to . \nn Rs.3 –6 lakh, 10% on Rs.6 –9 lakh, 15% on Rs.9 –12 lakh, 20% on Rs.12 –15 lakh, and 30% above Rs.15 lakh. The \nnew regime was made more attractive in recent budgets (e.g. full tax rebate for income up to Rs.7 lakh, and in \nBudget 2025 further relief for income up to ~Rs.12.75 lakh in the new regime). Most MSME proprietors have the \noption to choose the regime that minimizes their tax; many continue with the old regime if they can claim \ndeductions for business expenses, while some may opt for the new simpli fied regime depending on their situation. \nAll individual MSME owners, however, enjoy basic slab exemptions unlike companies or firms.  \nPartnership Firms and LLPs: A partnership firm or LLP is taxed as a separate entity at a flat 30% rate on its taxable \nprof its. There are no slab rates for firms – the first rupee of profit is taxed at 30%. Surcharge of 12% applies if \nincome exceeds Rs.1 crore, and health & education cess 4% applies on tax plus surcharge. Notably, firms cannot \nuse the individual slab rates; th e 30% flat rate applies irrespective of being “small” or “large.” However, \npartnership firms (including LLPs) can reduce taxable income by paying remuneration or interest to partners \nwithin limits – those payments are deductible to the firm and then taxed in the hands of partners. Also, if a \npartnership/LLP claims certain deductions (like startup tax holiday under 80 -IAC), it may trigger Alternate \nMinimum Tax (AMT) at 18.5% (similar to MAT for companies). In general, though, 30% is the effective tax rate fo r \nmost MSME firms.  \nPrivate Limited Companies: Domestic companies in India have distinct tax rate options. As of current law, standard \ncorporate tax rates are 25% or 30% (plus cess/surcharge) depending on turnover, with special concessional \nregimes available:  \nStandard Rate: 25% base tax for companies whose turnover did not exceed Rs.400 crore in a recent year (FY 2020 -\n21); otherwise 30% for larger companies. Most MSMEs fall under the lower 25% bracket due to their modest \nturnover. These rates are bef ore surcharge (7% if income > Rs.1 crore, 12% if > Rs.10 crore) and cess 4%.  \nOptional Concessional Regimes: The government introduced beneficial tax regimes under the Income Tax Act:  \nSection 115BAA: An existing domestic company can opt for a 22% tax rate ( effective ~25.17% with surcharge and \ncess), provided it foregoes certain exempt . \ns. This is popular as it offers a low flat rate and exempts the company from Minimum Alternate Tax (MAT). Many \nMSME companies have adopted 22% rate for simplicity.  \nSection 11 5BAB: New manufacturing companies (incorporated after Oct 2019, commencing production by a \nspecified date) can opt for a 15% tax rate (effective ~17.16% with surcharge/cess). This super -low rate was to \nencourage new industrial start -ups. Only eligible manu facturing MSMEs can use this, and they too must forego \nmost exemptions.  \n(Older regime Section 115BA at 25% for certain manufacturing cos is largely subsumed by 115BAB.).  \nThus, MSME companies can have very low tax rates if they qualify and opt for these reg imes. Otherwise, the default \nis 25% for most. For example, a small domestic company with Rs.5 crore profit that doesn’t avail exemptions can \npay tax at 22% under Section 115BAA. Companies under any regime also pay 4% cess, and if not in 115BAA/BAB, \npay sur charge at 7%/12% on high incomes. Unlike individuals, companies do not get a basic exemption slab – \nevery rupee of profit is taxed (but the low rates compensate).  \nSummary: In practice, a micro/small MSME sole proprietor might pay no tax on initial income ( due to slabs), a \npartnership/LLP pays 30% flat from the first rupee of profit, and a small company likely pays 22% or 25% tax. The \nchoice of business form thus affects the tax outgo and should be considered in MSME tax planning.  \nPresumptive Taxation Scheme s (Sections 44AD, 44ADA, 44AE).  \nTo ease compliance for small taxpayers, the Income Tax Act provides presumptive taxation schemes – allowing \nMSMEs to pay tax on a deemed profit without maintaining detailed accounts. These are extremely beneficial for \ntiny b usinesses, professionals, and transporters. The key presumptive provisions are:  \nSection 44AD (Presumptive Taxation for Small Businesses): This scheme is available to resident individuals, HUFs, \nand partnerships (excluding LLPs) engaged in eligible business  with annual turnover up to Rs.2 crore (limit \nextended to Rs.3 crore if cash receipts are ≤5% of total). Under 44AD, profits are presumed to be 8% of turnover \n(or 6% if sales are received via digital modes). The business need not maintain books or get audi ted if it opts for \n44AD. For example, a small retailer with Rs.80 lakh sales (all digital) can declare Rs.4.8 lakh profit (6%) as taxable \nincome, irrespective of actual profit11L321 -L33011L339 -L347. No further business expenses are deductible since \nthe pro fit is fixed as a percent of gross receipts11L323 -L331. Important conditions: The taxpayer must pay 100% \nadvance tax by March 15 (no quarterly installments)11L329 -L337, and if they opt out of 4 . \n. \ncannot re -opt for 5 assessment years (to prevent abuse)11 L335 -L343. Also, if actual profits are lower than the \npresumptive rate and the business wants to declare that lower income, it must maintain books and get an audit (if \ntaxable income exceeds basic exemption)9L515 -L5239L525 -L532. Recent Update: Finance Act 2023.  \nurnover cap from Rs.2 crore to Rs.3 crore for 44AD if digital payments comprise >95% of receipts13L29 -\nL3713L31 -L39 – encouraging cashless transactions by expanding eligibility.  \nSection 44ADA (Presumptive Taxation for Professionals): Introduced in 201 6, 44ADA extends presumptive \nbenefits to small professional practitioners (like doctors, lawyers, architects, consultants). It applies to resident \nindividuals or partnership firms in specified professions with gross receipts up to Rs.50 lakh (limit now Rs. 75 lakh \nif ≤5% in cash)14L69 -L72. Under 44ADA, 50% of gross receipts is deemed as profit (taxable income). No need to \nmaintain detailed books or ledgers of expenses if this scheme is used. For example, a freelance IT consultant earni . \n. \neclare Rs.15 lakh  as income (50%). As with 44AD, no other business deductions are allowed once this presumptive \nrate is taken. The taxpayer is free to voluntarily declare a higher income than 50% if actual profits are more, but if \nthey claim lower, then regular books and a udit provisions apply. Update: Analogous to 44AD, the threshold was \nenhanced – eligible professionals can have turnover up to Rs.75 lakh (from Rs.50L) if almost all receipts are non -\ncash. This was done to broaden coverage of professionals under presumptive  taxation.  \nSection 44AE (Presumptive Taxation for Transporters): This scheme caters to small transport operators owning \n**up to 10 goods carri . \n. \ne year. It simplifies tax by presumptively fixing profit per . \ncurrent presumptive income rates under 44AE a re: \nFor heavy goods vehicles (HGVs, gross vehicle weight > 12,000 kg): Income = Rs.1,000 per ton of vehicle’s gross \nweight per month of ownership9L444 -L4529L458 -L462. For example, a 15 -ton truck owned for a fu . \nds Rs.1,000×15×12 = Rs.1,80,000 of deemed pr ofit. \nFor other vehicles (light goods vehicles): Income = Rs.7,500 per vehicle per month of ownership9L440 -L448. For \nexample, a small fleet owner with 3 light . \nall year would have income = 3×Rs.7,500×12 = Rs.2,70,000.  \nThese amounts are aggregated for all vehicles to compute taxable income9L451 -L4599L457 -L462. No further \ndeduction for exp . \naintenance, driver salary, etc.) is allowed9L498 -L507 – the presumptive sum is final. 44AE taxpayers are exempt \nfrom tax audit regardless of turnover9L479 -L487, and they  also pay full advance tax by March 15. If someone \nunder 44AE claims that actual income is lower than these rates, then books of account must be kept and audited as \nper 44AB9L515 -L5239L517 -L520. Section 44AE is a boon for small truckers who often cannot ma intain detailed \nbooks; it offers simplicity and usuall . \ne income compared to potential actual profits (especially if vehicles are new or loans are involved, actual net profit \ncould be higher than Rs.7,500 pm, so 44AE can save taxes9L488 -L496).  \nBenefits of  Presumptive Schemes: By using sections 44AD, 44ADA, or 44AE, MSMEs avoid the burden of \nbookkeeping and audit, pay taxes on a reasonable estimate . \nd get peace of mind on compliance9L471 -L4789L479 -L487. These schemes significantly reduce compliance costs \nand are highly popular among micro enterprises and independent professionals. They also free up entrepreneurs’ \ntime to focus on business rather than paperwork.  \nNote: An MSME can opt in or out of presumptive scheme based on its circumsta . \nome restrictions).  While presumptive taxation simplifies income declaration, it’s optional – businesses with low \nactual profit margins might choose to maintain accounts and show actual income if it’s lower than the presumptive \nbenchmark (though they’d need an audit if they do so and have taxable income). For many small traders and \nservice providers with moderate margins, however, the presumptive percentage (6 . \n%) is quite reasonable and sometimes even lower than actual profit, yielding tax savings9L487 -L495. Always \nevaluate  the 5 -year lock -in rule (for 44AD) and whether you might seek bank loans (banks sometimes prefer \ndetailed books) when deciding to opt for presumptive taxation.  \nFiling Requirements for Different Types of MSMEs.  \nDepending on the legal form of the MSME, inco me tax return (ITR) filing requirements and compliance obligations \ndiffer. Below is an overview:  \nProprietorship (Individual Business): The proprietor files taxes as an individual (no separate business tax return). \nIf the business income is small and presum ptive tax is used, the proprietor can file ITR -4 (Sugam), a simplified \nreturn form. Otherwise, they file the standard ITR -3 for business/professional income. Due date: If books are not \nrequired to be audited, the due date is July 31 of the assessment year (for FY 2024 -25, due by July 31, 2025)9L521 -\nL529. If the proprietorship’s accounts **requi . \ne.g. turnover above Rs.1 crore and not using 44AD, or profit below presumptive rate), then the due date extends to \nOctober 31. The individual must also report all other personal income (if any) in the same return. * . \nProprietors should maintain books of account if not under presumptive scheme (section 44AA requires \nmaintenance of books if income > Rs.2.5 lakh or turnover > Rs.25 lakh). However, many micro proprieto rs avail \npresumptive schemes to avoid this. A proprietor is also subject to personal advance tax obligations if tax liability \nexceeds Rs.10,000 (though presumptive taxpayers under 44AD/ADA have an exception of paying i . \n. \nch 15).  \nPartnership Firm (Includ ing LLP): The firm/LLP must file a separate return ITR -5 reporting its business income. \nThere are no slab benefits – the firm’s entire profit is taxed at 30%. Due date: If the firm’s accounts are not \nrequired to be audited, the due date is July 31; if audi t is required, due date is October 31 (for AY 2025 -26, audit \nreport has to be obtained by Sept 30 and return by Oct 31). In practice, many partnership firms cross the audit \nthreshold or voluntarily get audited, so Oct 31 is common. Audit triggers for firms : turnover beyond prescribed \nlimits (Rs.1 crore, etc. – see Tax Audit section below), or if the firm claims profits lower than presumptive rates \nwhile having taxable income above the basic exemption. An LLP, importantly, is statutorily required to get audi ted \nunder LLP Act if turnover exceeds Rs.40 lakh or capital >Rs.25 lakh, which often effectively means many growing \nLLPs will have audit requirement regardless of tax law thresholds. Thus, most LLPs and larger firms file by Oct 31. \nThe firm must also deduc t tax on any remuneration or interest paid to partners (though those are deductible to the \nfirm, they are income for partners). From AY 2021 -22 onward, it’s mandatory to file returns electronically with \ndigital signature for tax audit cases.  \nPrivate Limite d Company: Companies file ITR -6 electronically. Due date: Generally October 31 for all companies \nsince every company’s accounts are subject to statutory audit under the Companies Act (even if small). (If the \ncompany has international transactions requiring  transfer pricing audit, the due date extends to Nov 30, but that \ntypically affects larger companies). Compliance: Companies must maintain full books of account, get the financials \naudited by a chartered accountant, and comply with MAT/AMT if applicable. W hile small private companies \n(MSMEs) may have simpler financials, the compliance (board meetings, ROC filing etc.) is inherently more involved \nthan for a proprietorship or partnership. However, on the tax front, the availability of low tax regimes (22% or \n15%) and no personal tax on retained earnings can be an advantage for growth.  \nStartup Entities: Many startups are structured as private limited companies to attract investors or as LLPs. They \nfollow the filing norms above. One additional point – if a start up has obtained a tax exemption certificate (for \nSec.80 -IAC or angel tax), it must ensure to claim the deductions in the return and comply with any conditions (e.g . \ncertain types of income). We’ll cover startup -specific taxes later.  \nOther filings: In addi tion to the income tax return, MSMEs may need to file Tax Audit Reports (Form 3CD) by the \ndue date (if applicable), and transfer pricing reports (Form 3CEB by Oct 31 for TP cases). These are uploaded \nthrough the e -filing portal by the CA conducting the aud it. Also, if the firm/company had certain transactions like \ncash deposits beyond certain limit, foreign assets, etc., those must be disclosed in the ITR schedules.  \nRecords and Invoicing: Regardless of entity type, MSMEs should preserve supporting documents  for income and \nexpenses – invoices, purchase bills, receipts, bank statements, etc., for a minimum of six years from the end of the \nrelevant assessment year (the statutory time limit for scrutiny assessments). This is crucial in case of any inquiry \nor aud it by tax authorities.  \nTDS (Tax Deduction at Source) Obligations for MSMEs.  \nEven small businesses must comply with TDS provisions – this means when an MSME makes certain payments \n(like salaries, rent, contractor fees, etc.), it may need to deduct tax at so urce and remit it to the government. Key . \n. \nEs include:  \nSalary Payments (Section 192): If an MSME has employees, . \n. \nalaries **if the salary exceeds the basic exempt . \n. \nntially, any salaried employee’s monthly income above the taxable limit sh . \n. \n. \nl firms) must compute tax based on applicable slab rates fo . \n. \nproportionately each month. Form 16 must be issued annual . \nees. \nPayments to Contractors (Section 194C): When an MSME pays a contractor or sub -contractor for work (for \nexample, a manufacturi ng MSME paying a job worker, or a trader paying a delivery transporter), TDS at 1% (if \npayee is individual/HUF) or 2% (others) is required if the payment exceeds Rs.30,000 for a single contract or \nRs.1,00,000 aggregate in a year. This applies to many typic al MSME expenses – e.g., printing jobs, fabrication work, \nevent management, etc. (There is an exemption for personal (non -business) payments by individuals; but if the \nMSME is proprietorship under tax audit last year, then even individual category has to d educt on business \npayments).  \nFees for Professional or Technical Services (Section 194J): MSMEs often hire professionals – e.g., accountants, \nlawyers, consultants, designers. If such fees exceed Rs.30,000 in a year to one person, TDS @ 10% must be \ndeducted1 9L229 -L238. (Budget 2021 introduced TDS @2% for certain technical service payments and 194J now \ngenerally 10% for professional, 2% for technical, but those nuances aside, the MSME just needs to ensure TDS \ncompliance if hiring outside experts). Even small s tartups paying, say, a freelance web developer Rs.50k would \nneed to deduct Rs.5k and pay to government.  \nRent (Section 194I): If an MSME is paying rent for office/warehouse or machinery, TDS is required at 10% (for \nland/building rent) or 2% (for machinery/e quipment) if annual rent exceeds Rs.2,40,000. Update: Budget 2025 \nhas increased the rent TDS threshold to Rs.6,00,000 per year23L69 -L73. This is a big relief for small businesses – \neffectively, rent up to Rs.50,000 per month will not trigger TDS. For examp le, earlier even a Rs.25,000/month shop \nrent (Rs.3 lakh yearly) required TDS of Rs.30,000 per year (@10%). Now, that would be exempt since Rs.3L < \nRs.6L. This reduces compliance for micro enterprises operating from rented premises.  \nCommission and Brokerage  (Section 194H): If the MSME pays any commission, brokerage, or referral fees above \nRs.15,000 in a year, TDS @5% is applicable. E.g., a small manufacturer paying a sales agent 5% commission on \norders – if commission exceeds Rs.15k, TDS needed.  \nPurchase of Goods (Section 194Q): A relatively new provision (from July 2021) – if a business’s turnover exceeded \nRs.10 crore in the previous year, it must deduct TDS @0.1% on purchases of goods from a seller if total purchases \nexceed Rs.50 lakh in a year. This is mor e relevant for medium enterprises; micro and small businesses usually \nwon’t cross Rs.10 crore turnover to trigger 194Q. But a medium MSME should be aware of this to comply.  \nOther TDS: There are numerous TDS sections; a few other possibly relevant ones for MSMEs: Section 194 -IA (1% \non purchase of immovable property over Rs.50 lakh – occasional if MSME buys property), Section 194 -IB (for \nindividual/LLP tenants paying >Rs.50k rent monthly – though 194I threshold rise to Rs.6L may cover most cases), \nSection 194 M (individuals/HUFs paying contractors/pros >Rs.50L in personal capacity – rarely relevant to \nbusiness context). Also, Section 194O – if the MSME sells goods/services via an e -commerce platform, the e -\ncommerce operator will deduct 1% TDS on the payments to  the MSME. This isn’t the MSME’s obligation but affects \ntheir net receipts (they can claim it in their return).  \nThreshold exemption for Individuals: One relief in TDS law is that individuals or HUFs who are not required to get \ntheir accounts audited in the  previous year are generally not obligated to deduct TDS on 194C, 194J, 194H, etc. For \nexample, a small proprietor who had turnover of Rs.30 lakh last year (no audit) and pays a contractor Rs.1 lakh this \nyear technically need not deduct TDS under 194C beca use of that exemption. However, once that proprietor’s \nturnover crosses audit limit (say this year goes above Rs.1 crore, so next year he’s audit -subject), then next year he \nmust start TDS on such expenses. This rule aims to spare the smallest businesses f rom the burden of TDS. \nImportant: This exemption does not apply to certain sections like 192 (salaries) or 194 -IB (rent by individual \n>Rs.50k/month) or 194 -IA (property purchase) – those apply even to individuals outside audit.  \nTDS Compliance: When MSMEs d educt TDS, they must deposit it to the government by the 7th of the following \nmonth (for March, by April 30). They also need to file quarterly TDS returns (Form 26Q/24Q) by the due dates \n(usually end of the month following quarter -end, e.g., Q4 by May 31).  Failure to deposit TDS on time incurs interest \n(1% per month for delay in deduction, 1.5% per month for delay in remittance) and late filing fee of Rs.200/day for \nlate returns (Sec 234E), as well as potential penalties. After filing, they should issue TDS  certificates (Form 16 \nannually for salary, Form 16A quarterly for others) to payees so that payees can claim credit.  \nNeglecting TDS can be costly: apart from interest and late fees, penalty up to the amount of tax not deducted/paid \ncan be imposed (Sec 271 C), and expenses can be disallowed in tax computation (30% of the expense is added back \nif TDS not deducted or deposited by due date, as per Sec 40(a)(ia)). For instance, if an MSME paid Rs.1,00,000 to a \ncontractor and didn’t deduct Rs.1,000 TDS, Rs.30,000  of that expense could be disallowed in calculating its income, \nincreasing taxable income. Therefore, even small businesses must familiarize themselves with basic TDS provisions \nto stay compliant.  \nDue Dates, Interest, and Late Fees (Direct Tax Compliance C alendar).  \nMSMEs should calendarize the key direct tax deadlines to avoid penalties. Below are important due dates and \nconsequences of missing them:  \nAdvance Tax: If the MSME (or its owner) expects a total tax liability over Rs.10,000 in a year (after TDS), advance \ntax must be paid. For non -presumptive businesses, advance tax is paid in four installments: 15% by June 15, 45% \nby Sept 15, 75% by Dec 15, and 100% by Mar 15. Presumptive business under 44AD/ADA get a relief – they can \npay the full advance tax by M ar 15 in one go9L510 -L5189L519 -L523. If advance tax is not paid or is underpaid, \ninterest under Section 234B (1% per month on shortfall from April 1 of next year till date of payment) and 234C \n(for deferment of individual installments, also 1% per month on  shortfall for that quarter) will apply. These \ninterests can add up, so it’s prudent for profitable MSMEs to pay advances timely. (Note: proprietors often have \nTDS credit from sources like bank interest, etc., which can offset some advance tax need.).  \nTDS Payments and Returns: As mentioned, TDS deducted should be deposited by the 7th of the next month (for \nMarch, by April 30). Quarterly TDS returns due by 31st of July, Oct, Jan, and May for Q1, Q2, Q3, Q4 respectively. \nDelay in depositing TDS draws interest  1.5% p.m. and failure to file return leads to fee Rs.200/day (capped to TDS \namount). Persistent default in depositing TDS can even lead to prosecution under the Income Tax Act (Sec 276B) – \nthough typically only willful large defaults are prosecuted.  \nIncom e Tax Return (ITR) Filing: For individuals, partnerships, etc., July 31 is the usual due date (if no audit); for \nentities requiring audit, October 31. A late return can still be filed by December 31 of the assessment year (known \nas a “belated return”), but  it attracts a late filing fee (Section 234F) of Rs.1,000 (if total income up to Rs.5 lakh) or \nRs.5,000 (if income above Rs.5 lakh)22L78 -L86. This fee is levied at time of filing late. Filing after Dec 31 (i.e. very \nlate, or failure to file) is not permitt ed unless the government extends deadlines; if missed entirely, the taxpayer \nmay get a notice and have to pay penalties or even face prosecution in extreme cases. Also, if a refund is due, \ndelaying filing means delaying your refund – and if tax was due, in terest under Section 234A accrues at 1% per \nmonth for late filing on any unpaid tax.  \nTax Audit Report: If applicable, the audit report in Form 3CD/3CB -3CA must be uploaded by Sept 30 (one month \nbefore the Oct 31 due date). Missing this can trigger a penalt y under Section 271B (see Tax Audit section). Usually, \nMSMEs should get the audit done well in time.  \nRevised/Updated Returns: If an MSME discovers errors in the original return (omitted income or deductions), a \nrevised return can be filed by Dec 31 of the assessment year (or within 3 months of original filing, whichever later). \nBeyond that, one can file an updated return (Section 139(8A)) within 2 years of the end of the relevant assessment \nyear (recently extended to 4 years by Budget 2025)23L67 -L70, but up dated returns come with an extra tax \n(additional 25% or 50% of the due tax, depending on timing) as a penalty. It’s best to file correctly and timely the \nfirst time to avoid these scenarios.  \nSummary of Penalties for Late Compliance (Income Tax): Delay in f iling ITR = late fee up to Rs.5k + interest on tax \ndue22L78 -L86. Delay in paying self -assessment tax/advance = interest 1% p.m. (Sections 234A/B/C). Delay in \nfiling TDS return = Rs.200/day (Sec 234E). Non -payment of TDS = interest + penalty up to tax amoun t (Sec 271C). \nNot getting audit if required = penalty 0.5% of turnover (max Rs.1.5 lakh) under Sec 271B. These can cumulatively \ncost a lot, so timely compliance is crucial for MSMEs to avoid eroding their hard -earned profits in fines.  \nTax Audit Provisions for MSMEs.  \nTax Audit (Section 44AB) is an income tax audit by a CA, mandated once businesses reach certain size or in specific \ncases. The objective is to ensure the taxpayer accurately reports income, expenses, and complies with income tax \nrequirements. Ke y tax audit rules relevant to MSMEs:  \nTurnover Threshold for Business: If annual gross turnover or sales exceed Rs.1 crore, a tax audit is mandatory \n(unless presumptive scheme is used – see exception below). However, to promote digital transactions, the \nthreshold has effectively been increased: if the business’s cash receipts are ≤5% of total receipts and cash \npayments ≤5% of total payments, then the audit threshold is Rs.10 crore (as amended by Finance Act 2021)24L25 -\nL33. In simple terms, a largely digital MSME can have turnover up to Rs.10 crore without needing a tax \naudit24L25 -L33. This is a big relaxation for growing small enterprises. If cash dealings are minimal, the onerous \naudit requirement is deferred till Rs.10 cr. If cash exceeds 5%, the old Rs.1 c r limit applies. Many small traders and \nwholesalers benefit from this – e.g., a business with Rs.6 crore sales entirely via bank/UPI wouldn’t need audit due \nto this provision.  \nPresumptive Taxation Cases: A taxpayer who opts for Section 44AD (turnover up to  Rs.2/3 crore with presumptive \nprofit) is exempt from tax audit. However, if the person declares profits lower than 8%/6% (and above basic \nexemption) or opts out of 44AD after having opted it in earlier years, audit may become applicable even if turnover \nis below Rs.1 crore. Specifically, if one’s turnover is up to Rs.2 crore but they don’t use 44AD (or show less than \ndeemed profit and taxable income exceeds basic exemption), they must get audited. Similarly, under 44ADA, if a \nprofessional’s receipts are ≤R s.50/75 lakh and they take the 50% presumptive profit, no audit. But if they claim \nless than 50% as income while having taxable income, audit triggers (since 44ADA doesn’t have a multi -year lock -\nin like 44AD, but actual profit <50% requires audit). Under 4 4AE (transport), those following presumptive also \navoid audit9L479 -L487; only if they try to show lower income than the presumptive per vehicle amount (with \nincome above exemption) would an audit be needed9L515 -L523.  \nProfessionals: If an MSME is a professi onal (like CA, doctor, etc.) not using presumptive scheme, the audit \nthreshold is gross receipts over Rs.50 lakh in a year (Section 44AB(b)). If receipts exceed Rs.50,00,000, a tax audit \nis required.  \nOther Scenarios: If an MSME business is loss -making but wants to carry forward the loss, and its turnover is over \nRs.1 crore (or over Rs.2 crore and opted presumptive incorrectly, etc.), it may need audit. Also, businesses \nineligible for presumptive (like commission agents, or an LLP, or a foreign business) hav e to follow the Rs.1 \ncrore/Rs.10 crore rule strictly. Additionally, if an entity falls under certain special presumptive sections (44BB, \n44BBB – usually not relevant to MSMEs) and doesn’t declare the presumptive income, audit is required.  \nIn summary, many MSMEs manage to avoid a tax audit by either keeping turnover below limits or using \npresumptive schemes. But once an MSME grows beyond a point, a tax audit becomes part of compliance. The audit \ninvolves a CA examining the books and records and reporting key  financial ratios, payments, and discrepancies in \nForm 3CD. It is then filed with the tax return. The penalty for not getting a required audit is 0.5% of turnover \n(capped at Rs.1,50,000) (Section 271B). For example, a business with Rs.2 crore turnover that  failed to get an audit \ncould be penalized up to Rs.1 lakh.  \nPractical Tip: If an MSME is close to threshold, timely tax planning can help – e.g., if turnover slightly above Rs.1cr \nbut profit margins are good and digital transactions high, opting 44AD presu mptive (if eligible) can skip audit even \nup to Rs.2cr (or Rs.3cr w.e.f. FY23 -24). Or ensuring digital mode to use the Rs.10cr threshold. The policy intent is to \nreduce audits for genuine small businesses and focus resources on larger or riskier cases.  \nIndi rect Taxes on MSMEs (GST).  \nNearly all businesses, including MSMEs, are impacted by Indirect Taxation, primarily the Goods and Services Tax \n(GST) introduced in 2017. GST is a unified tax on supply of goods and services in India. This section covers GST \nregi stration requirements for MSMEs, the Composition Scheme for small taxpayers, routine GST return filings \n(GSTR -1, GSTR -3B, etc.), Input Tax Credit rules, e -invoicing and e -waybill compliance, and GST audit & compliance \naspects.  \nUnderstanding GST is crucial for MSMEs as it affects pricing, cash flow (through input credits), and compliance \nworkload. The good news is that the government has provided higher thresholds and simpler options for smaller \nbusinesses under GST.  \nGST Registration Thresholds for MSMEs.  \nWhen is GST registration required? Generally, a business must register under GST if its aggregate annual turnover \nexceeds the prescribed threshold. As of current norms:  \nService Providers: Threshold is Rs.20 lakhs in a financial year (for most states)22L79 -L87. For special category \nnortheastern states, this limit can be Rs.10 lakh (though some of those states have opted for higher limit now).  \nGoods Suppliers (Traders/Manufacturers): Threshold is Rs.40 lakhs if exclusively engaged in supply of goods (and \nnot se rvices) in most states22L79 -L87. When GST launched, it was Rs.20L across the board, but later for goods this \nwas doubled to Rs.40L (with states given an option to keep it Rs.20L – a few smaller states did).  \nIf a business deals in both goods and services, e ffectively the service threshold of Rs.20L applies (since providing \nany service fixes threshold at Rs.20L, as the law stands).  \nInter -state Supplies: Initially, any inter -state supply required registration (no threshold), but now small service \nproviders can  do inter -state up to Rs.20L without GST. However, for goods, if you supply to other states, \nregistration is mandatory (except if turnover is very small and you opt for special e -commerce threshold schemes, \netc.). Practically, many MSMEs find themselves re gistering once they expand sales geographically, even if under \nRs.40L, because inter -state sale of goods triggers registration.  \nOther Mandatory Registration Cases: Regardless of turnover, certain businesses must register: e.g., if you sell via an \ne-commerc e platform (like Amazon), you need GST; if you’re liable to pay GST under reverse charge; non -resident \nbusinesses; input service distributors, etc. But for a typical small MSME, these special cases are rare. One notable \ncase: a small manufacturer selling o n an e -commerce marketplace will have to register for GST even if turnover is, \nsay, Rs.5 lakhs, because e -commerce operator cannot allow an unregistered seller.  \nIn summary, a truly micro business (turnover under Rs.20L services or Rs.40L goods) within one state can avoid \nGST registration and compliance. However, many MSMEs exceed these modest limits or voluntarily register earlier \nfor business reasons (to claim input tax credit or to cater to B2B customers who insist on GST invoice).  \nVoluntary Registration:  An MSME below threshold may still take GST registration to avail Input Tax Credit (ITC) on \nits purchases or to appear more credible to clients. For example, a startup with Rs.5 lakh revenue but significant \npurchases may register to claim input credits (th ough note, once registered, all compliance applies regardless of \nturnover).  \nThreshold Exemption Example: A tailoring shop providing local services with Rs.15 lakh turnover is exempt from \nGST (no need to register/collect GST) because Rs.15L < Rs.20L. Simila rly, a homemade snacks seller in one state \nwith Rs.35 lakh sales is exempt (below Rs.40L). But if that snacks seller starts shipping to a neighboring state, they \ntechnically must register from the first inter -state sale.  \nGST Composition Scheme for Small Businesses.  \nFor MSMEs with modest turnover, the Composition Scheme offers a simplified compliance and tax payment option \nunder GST. Key features of the Composition Scheme:  \nIt is available to taxpayers with turnover up to Rs.1.5 crore in the previous financ ial year (limit was Rs.1 crore \ninitially, later increased). For North -East states, the limit is Rs.75 lakh.  \nComposition taxpayers pay a fixed percentage of their turnover as GST, instead of normal GST rates on each \ninvoice. The rates are:  \n1% (0.5% CGST + 0 .5% SGST) of turnover for traders (suppliers of goods)22L79 -L87. This applies also to \nmanufacturers of goods (except some like ice cream, pan masala, tobacco which are excluded).  \n5% (2.5%+2.5%) for restaurant services (only for those not serving alcohol) – since restaurants are a major MSME \nsector.  \n6% (3%+3%) composition tax for service providers (introduced in 2019 as a special composition -like scheme for \nsmall service MSMEs up to Rs.50 lakh turnover). This “Service Composition” scheme allows small service  firms (or \nmixed suppliers of goods and services) to pay 6% instead of standard 18%.  \nNo collection of GST: Composition dealers cannot collect GST from customers on the invoice. Their pricing is \nassumed to be inclusive. For example, a trader under compositi on selling an item for Rs.1,000 will not add GST to \nthe invoice; instead, they later pay 1% of that Rs.1,000 (i.e. Rs.10) from their own pocket as tax. They must mention \n“composition taxable person, not eligible to collect tax on supplies” on the bill.  \nNo Input Tax Credit for buyers: Because composition dealers don’t charge regular GST, their B2B customers cannot \nclaim ITC on purchases from them. This is a limitation – larger companies often avoid buying from composition \ndealers since they can’t get credit,  effectively making the purchases ~tax -inefficient. Thus, composition is mostly \nuseful for B2C oriented MSMEs (e.g. local shopkeepers, small restaurants serving consumers).  \nSimplified Returns: Composition taxpayers have very light compliance: they need to file quarterly payment return \n(CMP -08) by 18th of the month after each quarter, and an annual return (GSTR -4) by April 30 of next FY. They do \nnot need to file the regular monthly GSTR -1 and GSTR -3B that normal taxpayers file, which greatly reduces \npaperwor k. \nConditions: Composition scheme cannot be used if the business makes inter -state outward supplies (selling to \nother states), or supplies through e -commerce operators, or is engaged in manufacturing certain notified goods \n(like pan masala, ice cream, etc. ). Also, a composition dealer must pay taxes at normal rates on any purchases from \nunregistered dealers above a specified amount (this provision of RCM on unregistered purchase was removed in \n2018 for all, so currently not an issue). They also must pay rev erse charge GST on certain services like any other \ntaxpayer.  \nBill of Supply: Composition dealers issue a Bill of Supply instead of a tax invoice, since they can’t charge tax \nseparately.  \nFor example, a small sweet shop with Rs.50 lakh turnover can opt for c omposition. It will pay 1% of Rs.50 lakh = \nRs.50,000 as GST for the year (quarterly Rs.12,500 payments), instead of charging 5% or 18% on each item and \ndoing voluminous filings. The record -keeping is minimal, and customers (majority are consumers) don’t bo ther \nabout GST – they just pay the price tagged.  \nNew Composition for Services: Recognizing many small service providers also needed relief, a composition scheme \nfor services was rolled out allowing those with up to Rs.50 lakh services turnover to pay 6% GS T. For instance, a \nsmall consulting firm with Rs.30 lakh revenue could pay Rs.1.8 lakh (6%) under this scheme instead of 18% on \neach invoice. However, note that if a business supplies both goods and services, they could use normal composition \nfor goods and  the special 6% for services only if the service portion is within Rs.50L and overall within Rs.1.5Cr – \nthis gets complex, so usually mixed supply small traders (like a kirana store with minor service income) stick to \nnormal composition (allowed up to 10% of service turnover or Rs.5L, by rule).  \nOverall: Composition is ideal for micro businesses doing local trade or services, who mainly sell to end consumers \nand want to avoid the complexity of full GST. It offers ease (few returns, flat rate) at the cost of ineligibility to claim \ninput credit and inability to do interstate sales or sell to big GST -registered buyers effectively. Many lakhs of \nMSMEs are enrolled as composition dealers.  \nGST Return Filing and Compliance (GSTR -1, GSTR -3B, etc.).  \nMSMEs registered u nder GST (and not under composition) have to follow the regular GST compliance cycle. Over \ntime, the GST Council has simplified some procedures for small taxpayers (like offering quarterly filing options), \nbut the core requirements remain:  \nGSTIN and Invoic es: Once registered, an MSME gets a GSTIN (GST Identification Number) and must issue GST \ninvoices for sales, showing the GST amount and GSTIN. Proper tax invoices are needed to enable input credit flow. \nThey also have to maintain purchase records and colle ct invoices from suppliers for claiming credit.  \nGSTR -1 (Sales Return): GSTR -1 is a statement of outward supplies (sales). It contains details of all invoices issued, \ndebit -credit notes, exports, etc., in a given period. Frequency: Taxpayers can file GSTR -1 monthly (by the 11th of \nthe next month) or quarterly if they opt for the QRMP (Quarterly Return, Monthly Payment) scheme. Under QRMP, \nif turnover ≤ Rs.5 crore, one can file GSTR -1 quarterly (by 13th of month after quarter)16L13 -L17. Optionally, they \ncan u se an Invoice Furnishing Facility (IFF) to upload first two months’ B2B invoices to pass credit to recipients. \nMSMEs should ensure timely GSTR -1 filing because their buyers’ ability to claim ITC depends on these invoices \nreflecting in GSTR -2A/2B.  \nGSTR -3B ( Summary Return & Payment): GSTR -3B is a monthly summary return through which GST payment is \nmade. It reports total outward and inward supplies, input credit claimed, and net tax payable. It is due by 20th of \nthe next month for most taxpayers. The governmen t has staggered dates for smaller states (22nd or 24th for \nsome). Under QRMP, small taxpayers file 3B quarterly (by 22nd/24th of month after quarter) but have to pay tax \nmonthly through a challan (either actual or a fixed sum method). GSTR -3B is critical – even if GSTR -1 was filed, the \ntax is not considered paid until 3B is submitted with payment of any liability. Delayed 3B filings attract late fees of \nRs.50 per day (Rs.20 per day for nil liability)16L13 -L17, capped per return (caps depend on turnover; for  small \ntaxpayers often capped at Rs.2,000 or Rs.5,000). Interest at 18% per annum is charged on any tax paid late16L13 -\nL17.  \nOther Returns: There are other specialized returns/forms:  \nGSTR -4: Annual return for composition dealers, due April 30 of next FY (co mposition taxpayers no longer file \nquarterly GSTR -4; they use CMP -08 for payments quarterly).  \nGSTR -9: Annual GST return that summarizes the year’s operations. It is mandatory for taxpayers with turnover \nabove Rs.2 crore (optional below that threshold, thou gh it was waived for <=Rs.2Cr for initial years). Many MSMEs \nwith modest turnover can skip GSTR -9 if under threshold, but if above, they must file by Dec 31 of next year. GSTR -\n9 basically recaps GSTR -1 and 3B data and does some auto -reconciliation.  \nGSTR -9C (Reconciliation Statement): Earlier a separate audited reconciliation for turnover > Rs.2 crore, but post -\n2021, requirement changed – now applicable only if turnover exceeds Rs.5 crore, and instead of requiring a CA \naudit, the taxpayer can self -certify th e reconciliation of books vs GST returns9L479 -L487. Many medium MSMEs \n(5–10 crore) have to prepare this reconciliation (showing, e.g., any differences between audited financials and GST \nreturns).  \nGSTR -8/7/6 etc.: These pertain to e -commerce operators, TDS deductors, Input Service Distributors – typically not \nroles an ordinary MSME plays unless they themselves are e -com platform or a large company branch.  \nBooks and Records: GST law requires maintaining detailed records of sales, purchases, stock, output tax collected, \ninput tax availed, etc. for 6 years. MSMEs should have a proper accounting or at least spreadsheets to keep track, as \nGST audits (departmental) can ask for these.  \nCompliance Reliefs for MSMEs: Government has introduced several measures to ease c ompliance for smaller \ntaxpayers:  \nQRMP scheme: As noted, quarterly filing with monthly payment for those up to Rs.5Cr turnover reduces the \nnumber of GSTR -1/3B filings from 24 to 8 per year16L13 -L17.  \nLate Fee waivers and reductions: Late fees have been reduc ed for small turnover cases. Currently, late filing of \nGSTR -3B is capped: for turnover up to Rs.1.5Cr, max late fee Rs.2,000; for Rs.1.5 –5Cr, max Rs.5,000 (each for \nCGST+SGST). Nil return late fees are also kept low (Rs.20/day).  \nAmnesty schemes: From time to time, amnesty is given to clear backlog of return filings by capping late fees.  \nGST Helpdesks and Sahaj/Sugam forms (proposed): There were plans for simpler return forms for small taxpayers \n(called Sahaj/Sugam) but those were shelved as QRMP served the purpose.  \nExample: A small manufacturing MSME with Rs.3 crore turnover in Maharashtra supplying locally would typically, \nif not in composition, file GSTR -1 and 3B each month. If eligible, they could opt QRMP – then from April -June \nquarter, pay estimated tax  monthly (using challan PMT -06 by 25th of next month) and file one GSTR -1 and one 3B \nfor the quarter by July. They must ensure by year -end they file GSTR -9 if above Rs.2Cr. If that MSME was below \nRs.2Cr, they could skip GSTR -9 as of now (though it’s good p ractice to file it to reconcile things).  \nConsequence of non -filing: If returns are not filed, apart from late fees and interest, the GSTIN can be suspended or \ncanceled. Non -filing of GSTR -3B for consecutive tax periods will block e -way bill generation, ham pering business. \nPersistent default can lead to best -judgment assessment by tax officers. So, maintaining timely GST filings is as \nimportant as income tax filings for MSMEs.  \nInput Tax Credit (ITC) Rules and Considerations.  \nOne of the main benefits of GST f or businesses is the Input Tax Credit (ITC) mechanism – taxes paid on purchases \ncan be credited against output tax on sales, avoiding cascading tax. For MSMEs, efficient use of ITC can significantly \nreduce the GST cost burden. Key ITC rules and their impac t on MSMEs:  \nEligibility for ITC: An MSME can claim credit for GST paid on inputs (raw materials), services, and capital goods \nused in the course of business, subject to conditions:  \nPossession of a valid tax invoice or debit note from a supplier.  \nReceipt of  the goods or services. (If only invoice received but goods are in transit, credit can’t be taken yet.).  \nSupplier has uploaded the invoice in their GSTR -1 and paid the tax to government. This has become a critical \ncondition – the buyer’s ITC is matched wit h the supplier’s output. Since 2022, ITC is largely allowed only if the \ninvoice is reflected in the buyer’s GSTR -2B (auto -generated ITC statement). So MSMEs must ensure their vendors \nfile returns timely.  \nTimely claiming: Ideally in the same financial year.  If missed, ITC for an invoice can be claimed up to the due date of \nSeptember return of next FY (i.e., by Oct 20).  \nNo ITC for personal or prohibited items: Some inputs are blocked (Section 17(5)), e.g., GST on personal passenger \nvehicles, food and beverage s, club memberships, etc., is not creditable (unless one is in that business). Also, \ncomposition scheme purchases (from a composition dealer) come with no GST charged, so nothing to claim.  \nProportionate Credit for Mixed Use: If an MSME has both taxable and  exempt sales, it can claim ITC only \nproportionate to taxable (including zero -rated) supplies. For example, if a small pharma company sells some tax -\nexempt medicines (GST 0%) and some taxable supplements, it must reverse proportionate ITC for inputs used i n \nexempt sales.  \nReverse Charge Mechanism (RCM): In some cases, the MSME has to pay GST on behalf of the supplier (reverse \ncharge) – common examples: importing services, buying from an unregistered supplier for certain notified \nsupplies, or purchase of raw agro products from farmers, etc. That GST paid can be availed as ITC (in the same \nmonth) if it is used for business. But it means the MSME needs to shell out that tax first. E.g., a registered MSME \navailing legal services from a lawyer (who is unregistered ) must pay 18% GST on the fees under RCM, but can then \nclaim it as ITC. This is revenue -neutral after a month but affects cash flow.  \nITC Restrictions (SME perspective): The government implemented rules to ensure ITC is taken only if supplier \ncomplies. A notable rule: Rule 36(4) which once limited provisional ITC to 5% over and above matched invoices \nhas effectively been replaced by full matching – now MSMEs can only take credit for invoices that are in their \nGSTR -2B. Thus, due diligence of suppliers is im portant. MSMEs should purchase from compliant vendors to avoid \nlosing ITC. Many small businesses now regularly reconcile GSTR -2A/2B with their purchase book to identify \nmissing credits and chase vendors to file. This can be a pain point due to dependence o n others’ compliance.  \nCapital Goods ITC: MSMEs can also claim credit on capital asset purchases (machinery, equipment) – but if they \nlater sell that machinery, they have to pay GST on sale. Also, if an asset is partly for personal use, credit should be \nproportionately reduced.  \nInput Tax Credit Example: A small manufacturing MSME has output GST of Rs.5 lakh in a quarter. It purchased raw \nmaterials with GST of Rs.3 lakh and received various services (electricity is outside GST, but say machine repairs \nwith GS T) of Rs.50k. Provided all supplier invoices are uploaded and meet conditions, the MSME can claim Rs.3.5 \nlakh as ITC and only pay the balance Rs.1.5 lakh in cash for output GST. Without ITC, it would pay full Rs.5 lakh, so \nclearly ITC lowers effective tax cost to business. The end consumer ultimately bears GST, not the MSME, if ITC \nworks properly.  \nCases of Ineligible ITC: If an MSME buys a car for the director (not for a driving school or travel business), GST on \nthat car cannot be claimed – it’s blocked cr edit. If it spends on team lunch or gifts, those GST amounts are blocked. \nAlso, composition scheme cannot claim any ITC on their inputs – that’s a trade -off of the scheme.  \nITC and Cash Flow: Delays in getting ITC (due to supplier non -filing) can hurt MSMEs ’ cash flow. The government \noccasionally issues circulars if technical issues prevent matching, but by and large, MSMEs have to follow up with \nsuppliers or else bear extra tax until it’s resolved. This makes compliance coordination a part of MSME operation s \nnow.  \nGST Refunds for MSMEs: Usually, refunds are not common in domestic trade (since output > input for value \naddition). However, MSME exporters or those inverted duty situations (input GST > output GST rate) can claim \nrefunds of accumulated ITC. For exa mple, a small textile unit (fabrics GST 5% output, inputs cotton GST 5% and \nchemicals 18%) may accumulate ITC – they can file refund periodically. This is vital for working capital. The law \nprovides that 90% of refund should be granted provisionally within  7 days, though in practice it can take a few \nweeks or more with verification.  \nIn conclusion, efficient ITC management is key to GST compliance – MSMEs should organize purchase invoices, \nregularly reconcile with GSTR -2A/2B, and promptly address mismatches.  It directly affects profitability because \nGST not claimed correctly becomes a cost. Proper training of staff or use of software can help even small \nbusinesses handle this.  \nE-Invoicing and E -Way Bills.  \nE-Invoicing: To further digitize GST and curb evasion,  the government introduced e -invoicing – which means \nbusinesses must generate their B2B invoices through a central Invoice Registration Portal (IRP) that validates and \nassigns a unique Invoice Reference Number (IRN) and QR code. Initially applied to large companies, the turnover \nthreshold for mandatory e -invoicing has been steadily reduced. As of 1st August 2023, **e -invoicing is compulsory \nfor taxpayers with turnover above Rs.5 crore35L19 -L2735L47 -L55. This means many medium and even small -\nmedium enterpris es now fall in this bracket. For example, an MSME with Rs.7 crore sales must ensure all its B2B \ninvoices (to GST registered customers) are generated via the IRP (through their billing software or offline tool). If \nnot, those invoices are not treated as val id for input credit, and penalties apply.  \nThe evolution was: >Rs.500Cr (Oct 2020), >Rs.100Cr (Jan 2021), >Rs.50Cr (Apr 2021), >Rs.20Cr (Apr 2022), \n>Rs.10Cr (Oct 2022), and now >Rs.5Cr. Likely future: It may further go down to Rs.1Cr or all taxpayers in pha ses. \nSo micro enterprises aren’t hit yet, but a thriving small business should be prepared.  \nImpact: E -invoicing requires technical adaptation – MSMEs need software or ERP that can send invoice data to IRP \nand get back IRN instantly. Many accounting softwar e for SMEs (Tally, Busy, etc.) provide this integrated now. The \nbenefit is that these e -invoices automatically reflect in GSTR -1 and the buyer’s GSTR -2B, reducing manual errors. It \nalso basically automates tax authorities’ access to your sales data in real -time.  \nCompliance tip: If e -invoicing applies, failing to do so can attract a penalty of Rs.10,000 per invoice (and the invoice \nis not a valid tax invoice) as per rules. So MSMEs crossing threshold must be careful to implement it. On the flip \nside, those b elow threshold may voluntarily use e -invoicing too for convenience, but it’s optional for them.  \nE-Way Bills: An e -way bill is an electronic permit required for movement of goods consignment valued over \nRs.50,000. MSMEs in trading or manufacturing must gene rate an e -way bill when sending goods beyond a certain \ndistance (even within state, states often have 50km free limit for intra -city). The e -way bill system is online: one \nmust fill details of invoice, vehicle number, transporter ID, etc., and get a unique  EWB number. This is to track \ntransit of goods and prevent tax evasion. Key points:  \nRequired typically for inter -state transport >Rs.50k, and for intra -state as per state limits (most states also Rs.50k, \nsome have higher).  \nSome exceptions: certain goods (l ike perishable agricultural produce, milk, etc.) are exempt; also if moving goods \nby non -motorized means (handcart) no EWB.  \nWho generates: If the seller is GST -registered, usually the seller generates the e -way bill. If the seller hasn’t and the \nbuyer is r egistered and moving goods, the buyer can. Transporters can also generate for clients.  \nFor MSMEs with own vehicle or using courier, they might have to do it themselves on the portal.  \nExample: A small furniture manufacturer selling Rs.1 lakh worth of furnit ure to a customer 200 km away must \ncreate an e -way bill before dispatch. If a truck is stopped by authorities en route and no valid EWB, penalties can be \nsevere (equal to tax and penalty; goods can be detained).  \nThe validity of e -way bills depends on dista nce (1 day per 200 km usually).  \nIntegration with e -invoicing: If an MSME is under e -invoicing, Part A of e -way (invoice details) can auto -populate \nfrom IRP. Still need to enter vehicle details (Part B).  \nPenalties: Moving goods without e -way bill (when requ ired) can lead to a penalty of Rs.10,000 or tax amount \nevaded, whichever higher and possible seizure of goods (Section 129, 130 of CGST Act). Often resolution requires \npaying tax + equal penalty on the spot to release goods. That’s a nightmare scenario for  a small business (imagine \nthe working capital hit). So compliance here is important for logistics.  \nMany MSMEs use third -party transport or courier – usually, those providers assist with e -way bill. There are also \nintegration solutions if volumes are large . But even a one -off transfer (like shifting machinery to a new site) may \nneed an e -way.  \nConclusion: E -invoicing and e -way bills are part of the GST compliance landscape aimed at transparency and \ncurbing evasion. For MSMEs, it means more tech adoption but also streamlined reporting. Once systems are in \nplace, it can automate a lot of tax filing work (e.g., e -invoices auto -fill your returns). The trend is toward more \ndigitization, so MSMEs are advised to get comfortable with these tools sooner than later.  \nGST Audit and Compliance for MSMEs.  \nUnder GST law, there isn’t a “tax audit” exactly like income tax, but there are annual compliance checks and the \npossibility of departmental audits or assessments:  \nAnnual Reconciliation (GSTR -9 and 9C): As mentioned, if tu rnover > Rs.2 crore, filing GSTR -9 annual return is \nmandatory. This form consolidates all monthly returns, and it’s a good practice for MSMEs to reconcile books vs \nGST data through it. Initially, GST law required taxpayers >Rs.2Cr to also submit a reconcil iation statement audited \nby a CA (Form GSTR -9C) certifying that GST returns align with financials. In mid -2021, this was amended: now \nonly those with turnover above Rs.5 crore need to submit GSTR -9C, and it can be self -certified by the \ntaxpayer35L47 -L55 (n o external audit required). So effectively, for FY 2021 -22 onwards, MSMEs under Rs.5Cr \nhave much lighter annual compliance (no 9C at all, and GSTR -9 itself optional if ≤2Cr). For 2 –5Cr, they do GSTR -9; \nfor >5Cr, GSTR -9 and 9C self -certification.  \nMSMEs shou ld still internally reconcile their GST filings with their accounting books annually, because any \ndiscrepancies (like sales recorded in books but missed in GST, or ITC claimed in books but not in return) should be \ncorrected (either through annual return or  before Sept of next year via adjustments). GSTR -9C asks details of \nunreconciled amounts, interest paid, etc., prompting businesses to square up issues.  \nDepartmental Audit: GST officers have the right to conduct a Departmental Audit (Sec 65) of any registe red person. \nTypically, larger units or those with risk flags are picked. The authorities give notice and then audit records at the \nplace of business or their office. For MSMEs, the chance of routine audit is lower, especially if turnover is small and \ncompl iance timely. But medium enterprises might face one after a few years of operations. It’s crucial to maintain \nall records (sales, purchase, stock registers, e -way bills, etc.). If an audit finds under -reporting (like output tax \nshort paid or wrong ITC clai med), they can issue a notice to pay tax with interest, and possibly penalty if it was due \nto negligence or fraud.  \nScrutiny of Returns: GST also allows officers to scrutinize returns (Sec 61). If anomalies are found (say GSTR -3B vs \nGSTR -1 mismatches, or la rge ITC claim trend), they may seek explanation. MSMEs should respond with \nclarifications or make corrections if a genuine error is spotted. This is less formal than an audit, but important to \naddress to avoid it escalating to a demand.  \nGST Investigations:  In cases of suspected tax evasion (e.g. fake invoicing), there are provisions of search, seizure, \nand even arrest (though applicable to willful fraud above certain amounts, typically not something a compliant \nMSME would encounter). Nevertheless, understan ding that serious offences (issuing invoices without supply, \nutilizing fake ITC) can lead to prosecution under GST is good – it deters one from any shortcuts that might be \nsuggested by some unscrupulous players.  \nCompliance Rating: The GST Act envisaged a c ompliance rating mechanism for taxpayers (to publicly rate how \ncompliant they are). Though not implemented yet, if it comes, MSMEs will benefit from keeping a high rating (e.g. \nmaking them preferable suppliers).  \nRoutine Compliance: Aside from returns, MSME s must also comply with:  \nGST Payments: timely through Electronic Cash Ledger if ITC insufficient.  \nMaintaining Current Account with GST: Check the GST portal cash/credit ledger regularly. Sometimes payments \nremain un -utilized, or ITC gets blocked if returns  not filed for long.  \nHSN Codes: Now even smaller taxpayers must report HSN (Harmonized System of Nomenclature) codes for \ngoods/services on invoices – for turnover up to Rs.5Cr, 4 -digit HSN; above, 6 -digit or 8 -digit. MSMEs should update \ntheir invoice forma t accordingly.  \nE-Invoice and E -way compliance as discussed.  \nPenalties under GST: If an MSME fails any GST obligation, penalties can apply under various sections (covered in \nnext section on punishments). Many penalties (like late fees for returns, interest on late payments) have been \ntouched upon. For serious offences (fraudulent evasion), penalties are very steep (100% tax as penalty, etc.). But \nthose are avoidable with honest compliance.  \nIn essence, while the initial GST years required professional audits for even mid -size firms, today most MSMEs can \nself-manage GST annual compliance. The focus should be on accurate monthly/quarterly filings, reconciling \ndifferences, and keeping documents orderly. Using accounting software or GST return software helps minim ize \nhuman errors. Also, the government frequently updates rules (via notifications/circulars), so MSMEs benefit from \nconsulting with a tax practitioner at least annually to ensure they haven’t missed any new requirement (for \ninstance, new e -invoice thresho lds, or any new exemption they could use).  \nIncome Tax Return (ITR) Filing for MSMEs.  \nFiling of Income Tax Returns is an annual must -do for all MSMEs (whether as individuals, firms, or companies). The \nchoice of the correct ITR form, keeping necessary docume ntation, and understanding penalties for non -compliance \nensures MSMEs remain on the right side of the law. This section outlines which ITR forms apply to different types \nof MSMEs, the documents and information required for filing, and the consequences of l ate or incorrect return \nfiling.  \nTypes of ITR Forms for MSMEs.  \nDepending on the constitution of the business and the nature of income, different ITR forms are prescribed:  \nITR-3: Applicable to individuals or HUFs carrying on a business or profession who do n ot opt for the presumptive \nscheme. For example, a sole proprietor who maintains books of account or has income from business and also \nother income (like salary, rent) will use ITR -3. It has detailed schedules for P&L, balance sheet, etc.  \nITR-4 (Sugam): A s implified return for individuals, HUFs, and partnership firms (other than LLP) who opt for \npresumptive taxation under Section 44AD, 44ADA, or 44AE. This form is short – it doesn’t require full financial \nstatements, just gross receipts and presumptive incom e, along with any other income like interest or salary of \nproprietor. A small trader with presumptive income and maybe some interest income can file ITR -4 easily. Note: \nLLPs cannot use ITR -4 because LLPs are not allowed presumptive scheme (44AD excludes LL P). \nITR-5: This is the return form for partnership firms (non -presumptive), LLPs, and other non -company entities like \nAssociation of Persons, etc.. Essentially, all firms/LLPs (and cooperative societies, trusts etc. which are separate \ncategories) that are not filing ITR -7 go in ITR -5. A normal partnership or LLP which kept books and whose income \nis computed regularly (not under 44AD/ADA) will file ITR -5. It requires details of partner’s shares, etc., and has \nsimilar statement schedules to ITR -3 but for firm s. \nITR-6: The form for companies (except those claiming exemption under Sec 11 for charitable entities). All private \nlimited or public limited companies file ITR -6. It includes schedules for MAT, shareholding details, etc., appropriate \nfor corporate assess ees. \n(For completeness: ITR -7 is for entities claiming exemption like trusts, not relevant to MSME commercial entities.).  \nIn summary:  \nA proprietorship MSME -> ITR -3 or ITR -4. \nA partnership/LLP MSME -> ITR -5 (unless partnership opting presumptive, which cou ld use ITR -4 for now, but \ntypically many prefer ITR -5 with presumptive schedule too).  \nA company startup -> ITR -6. \nTax Audit reporting: If the MSME’s accounts were audited, relevant audit details need to be filled in the ITR (like \nname of auditor, date of a udit report, etc.).  \nSelecting the right form is crucial – filing a wrong ITR form (say filing ITR -4 when not eligible) can be treated as \ndefective. For example, if a partnership firm that paid partner salary beyond 44AD limits incorrectly tries to use \nITR-4, that’s not appropriate – it should use ITR -5 with Schedule BP filled.  \nDocumentation Required for Filing.  \nEven though returns are filed online, the figures in the return come from the business’s financial records. MSMEs \nshould organize the following docu ments/information at the time of filing:  \nFinancial Statements: If books maintained – the Balance Sheet and Profit & Loss Account for the year. These give \nfigures for turnover, gross profit, expenses, sundry debtors/creditors, closing stock, capital, etc. I n tax returns \n(ITR -3/5/6), one typically fills summary P&L (sales, various expense heads, net profit) and balance sheet items. \nFor presumptive filers, detailed accounts are not required, but one should at least note gross receipts and ensure \nbank statement s tally with that.  \nBank Statements: Reconcile all business bank accounts with declared income to ensure no income is missed. Also, \ninterest from these bank accounts is taxable (if not under presumptive or even if presumptive, interest is other \nincome). For  proprietors, personal and business accounts often overlap, so consider all accounts for interest \nincome.  \nSales and Purchase Invoices: Total sales as per invoices (and as per GST returns, if applicable) should match or be \nreconciled to income reported. If there is a difference (say GST returns on a different FY cutoff or cash vs accrual), \nprepare a reconciliation in case of query. Large assets purchased (capital expenses) should be accounted for in \ndepreciation schedules.  \nGST returns: These help cross -verify turnover and also input tax credit. Though IT return doesn’t directly ask for \nGST data, discrepancies between GST and ITR may trigger notices. So MSMEs should be ready to explain if GST \nturnover is, say, Rs.1.05 crore but ITR turnover Rs.1 cro re (could be because Rs.5 lakh was unadjusted advances or \nstock transfers not sales, etc.).  \nTDS Certificates (Form 16A/16): Collect all TDS certificates for tax deducted by others on the MSME’s income (e.g., \nclients who deducted TDS on payments). This ensu res the MSME claims credit for that TDS in the return. Cross -\ncheck the Form 26AS or Annual Information Statement (AIS) on the income tax portal for all TDS entries and high -\nvalue transactions.  \nRecords of Expenses and Deductions: For computing taxable incom e, have a summary of all expenses (raw \nmaterial, wages, rent, marketing, depreciation etc.). Also, certain businesses have special deductions (like 30% \nadditional for new employees under Section 80JJAA if criteria met – mostly for medium companies). Keep \ndocumentation for any deduction claimed. If proprietor, also compile deduction claims under Chapter VI -A (80C, \n80D etc.) if any personal investments to declare.  \nPartner/Shareholder details: Partnerships need the profit -sharing ratio, details of remuneration  or interest paid to \npartners (must align with partnership deed limits). Companies need detail of shareholding, especially if there are \nchanges (schedule of shareholders holding >10%).  \nAudit Reports and Certificates: If a tax audit was done, the audit repo rt (Form 3CD) would have details needed for \nsome ITR fields (disallowances, etc.). If any tax incentives were availed that require certificates (e.g., 80JJAA report, \n80-IA, 80 -IAC startup certificate), keep those at hand to fill relevant schedules and as p roof if questioned.  \nStartup documentation: If claiming the startup tax holiday under Section 80 -IAC, ensure the DPIIT recognition \ncertificate and Inter -Ministerial Board approval (if applicable) are obtained and mention details in the return. \nSimilarly, if  any capital gains exemption (54GB for startup investment) or angel tax exemption availed, have those \nrecords.  \nCarried Forward Losses: If the MSME had losses in previous years, to carry forward and set off those, ensure the \nearlier year returns were filed on time and have those loss figures (they auto -populate if you import data on e -\nfiling portal). For companies, check Section 79 conditions (shareholding continuity) to ensure loss carryforward is \nallowed (startups have relaxation if DPIIT recognized).  \nIn essence, while filing the return, the MSME will input its income details (from P&L), balance sheet items, tax \ncomputation, TDS/TCS credits, and any special claims. Having accurate books or at least a trial balance is very \nhelpful. Even presumptive taxpayers  should retain some working of how they arrived at their turnover figure, as \nthe taxman could ask for substantiation of the gross receipts.  \nThe ITR filing is done online on the Income Tax portal (JSON utility or through ERI softwares). After uploading, \nverification is needed (via Aadhaar OTP, DSC for companies, or sending signed ITR -V). Make sure to complete \nverification within 30 days, or the return is invalid.  \nPenalties for Late or Incorrect Filing.  \nCompliance with income tax filing is not just an obligat ion but also protects the MSME from legal troubles. Here are \nthe penalties/punishments related to ITR filing and reporting:  \nLate Filing (Section 234F Fee): As mentioned earlier, filing the return after the due date (Jul 31/Oct 31) incurs a \nlate fee. For MS MEs/persons with income above Rs.5 lakh, the fee is Rs.5,000; for up to Rs.5 lakh, Rs.1,00022L78 -\nL86. This is charged at the time of filing belated return. Note that if one completely misses filing by the end of the \nassessment year (i.e., by March 31 of ne xt year), you cannot file at all (unless a notice is given or window for \nupdated return). Missing the deadline also results in interest on any unpaid tax (Section 234A) at 1% per month \nfrom due date till actual filing.  \nPenalty for Failure to File (Section 271F / 271AAC etc.): If a person who is required to file (having taxable income \nor certain transactions) willfully fails to file even a belated return, the tax department can levy a penalty up to \nRs.5,000 under the old Sec 271F (now replaced by late fee an d prosecution sections). More seriously, Section \n276CC provides for prosecution (criminal charges) if someone willfully fails to file a return by the end of the \nassessment year and the tax evaded is above a threshold. Currently, if the tax unpaid (net of T DS/advance) exceeds \nRs.10,000, the assessee could face prosecution for non -filing15L25 -L33. The imprisonment can be 3 months up to \n7 years depending on amount (less severe if tax ≤ Rs.25 lakh, more severe if above). However, these are invoked in \negregious cases. Small MSMEs usually won’t face jail for a late return unless they also didn’t pay substantial tax. \nStill, it’s a legal provision to note – non-filing is a serious offense in eyes of law.  \nInaccurate Reporting and Understatement: If an MSME files a re turn but understates income or overstates \ndeductions, penalties can apply:  \nSection 270A (Underreporting/Misreporting Penalty): For underreported income, a penalty of 50% of the tax on \nthe underreported amount is levied. If the underreporting is due to deli berate misreporting (like false entries, \nconcealment, claiming bogus expenses), the penalty is 200% of the tax on that portion19L219 -L227. For example, \nif a trader conceals Rs.10 lakh of sales (tax Rs.3 lakh) and gets caught, they might pay additional Rs.1 .5 lakh (50%) \nif it was a simple omission, or Rs.6 lakh (200%) if it was willful concealment. This is imposed during assessment if \ndiscrepancies are found.  \nThese replace the older Section 271(1)(c) penalty for “concealment or furnishing inaccurate particul ars.” The new \nregime is more objective: if assessed income is higher than returned, penalty triggers, unless one fits exceptions \n(like a valid bonafide claim). Takeaway: Always report all income, and if something is uncertain, disclose it. If an \nMSME reali zes post -filing that something was missed, they should revise the return before assessment to avoid \nthese heavy penalties.  \nTax Audit default (Section 271B): If required to get a tax audit (as discussed under Tax Audit section) but the \nMSME fails to do so b y the deadline, a penalty up to 0.5% of turnover (max Rs.1,50,000) can be levied. Often \nofficers levy the max Rs.1.5L for non -compliance. If there’s reasonable cause (illness, etc.), this can be waived.  \nMaintenance of books (Section 271A) & documentation: If the MSME is required to maintain books (under Section \n44AA) but doesn’t, a penalty of Rs.25,000 may be imposed.  \nTDS/TCS related penalties:  \nSection 271H: For failure to file TDS/TCS statements within a year of due date or filing incorrect details, a pena lty \nRs.10,000 to Rs.1,00,000 can be levied (in addition to late fees).  \nSection 271C: For failure to deduct or pay TDS, penalty equal to the amount not deducted/paid can be imposed. \nAnd as noted, Sec 276B can prosecute for willful default in depositing TDS (possible jail up to 7 years). MSMEs \nshould be extremely careful with TDS compliance – the tax dept pursues TDS defaults stringently since that’s trust \nmoney.  \nProsecution for Tax Evasion (Section 276C): If an MSME willfully attempts to evade tax (for insta nce, by falsifying \naccounts), and the amount of tax sought to be evaded exceeds Rs.25 lakh, rigorous imprisonment of 6 months to 7 \nyears can be imposed (with fine)15L19 -L2715L39 -L47. If the amount is less than Rs.25L, imprisonment 3 months \nto 2 years possi ble. This is again for serious fraud cases – say fictitious expenses, multiple sets of books. Small \nerrors won’t land you here, but systematic evasion might. Similarly, 276CC for willful non -filing we discussed. \nThere’s also 277 (false statement in verific ation) – e.g., lying in return or verification, which can invite jail too.  \nPenalty for Furnishing False Information (Section 270A/271AAD): A new Section 271AAD (inserted in 2020) \nspecifically penalizes those who have false entries or omit entries in books to evade tax – penalty is equal to the \naggregate false entries amount. This aims at curbing fake invoices etc. While this is more connected to GST fake \ninvoice racket, it can apply in income tax if books are cooked. So ethical bookkeeping is a must.  \nPenal Interest: In addition to penalties, remember interest on late payment is statutory and unavoidable: Section \n234B for not paying advance tax (1%/month on shortfall), 234C for deferment of advance tax (1% for a short \nperiod on shortfall in installment), 234A  for filing delay (1% per month on unpaid tax).  \nIllustration of penalties: Suppose a medium MSME company did not file its FY 2023 -24 return by Oct 31, 2024. It \nfinally files in Feb 2025 showing Rs.10 lakh tax due. It will pay late fee Rs.5,000, plus 234A i nterest (Nov, Dec, Jan, \nFeb = 4 months at 1% = 4% of Rs.10L = Rs.40k interest). Also since it paid tax late, 234B interest from April 1, 2024 \nto Feb 2025 (~11 months) = 11% of Rs.10L = Rs.1.1L. These are significant costs (together ~Rs.1.55L on a Rs.10L \ntax). If audit was applicable and not done, add penalty up to Rs.1.5L. You can see delays can cause multi -fold \nincrease in liability.  \nSummary: File returns on time, report accurately, maintain documentation, and comply with audit/TDS \nrequirements. Penalties in tax laws are stringent to encourage compliance. For honest mistakes or minor lapses, \none can often request waiver (u/s 273B many penalties can be forgiven for reasonable cause). But deliberate non -\ncompliance can not only hurt financially but also risk t he business owner’s liberty. MSMEs should ideally use \nprofessional advice (CA/Tax practitioners) at least in initial years to set up robust compliance processes.  \nStartup -Specific Taxation Benefits.  \nThe government has recognized that startups (innovative, h igh-growth potential MSMEs) need special support. \nThus, in the past few years, several tax incentives for startups have been introduced. These are particularly \nrelevant to MSMEs that qualify as “Startups” under the Department for Promotion of Industry and Internal Trade \n(DPIIT) framework (often tech startups, product innovators, etc.). Key benefits include a profit tax holiday (Section \n80-IAC), relief from the so -called “Angel Tax” on investments, and other advantages upon DPIIT recognition. We \ncover these below.  \nTax Holiday for Startups (Section 80 -IAC).  \nSection 80 -IAC of the Income Tax Act provides a 100% tax deduction on profits for eligible startups for 3 years out \nof a block of 10 years. In other words, a recognized startup can enjoy three consecutive years of tax -free profits, \nwhich significantly helps them reinvest and grow.  \nKey points about this benefit:  \nEligibility: The startup must be incorporated as a private limited company or LLP on or after April 1, 2016 and \nbefore the specified cut -off date. O riginally the window was till March 2021, which got extended to March 2023, \nthen March 2024, then March 2025, and in the latest Union Budget 2025, it’s extended to startups incorporated up \nto March 31, 203018L383 -L39218L394 -L402. This extension by five yea rs allows more new startups to qualify. \nAlso, the startup must be DPIIT -recognized as an eligible startup (innovation, scalable business, etc.) and approved \nby the Inter -Ministerial Board (IMB) for this tax holiday.  \nTurnover condition: The turnover of the startup should not have exceeded Rs.100 crore in any of the relevant \nyears17L39 -L47 (this limit was earlier Rs.25cr, increased to Rs.100cr in 2020 to broaden eligibility17L39 -L47). \nThis ensures it’s small/mid -size and not an established big company.  \nBenefi t: 100% of profits derived from the eligible business are deductible for 3 out of 10 years (the startup can \nchoose the 3 years, typically the first profitable years within its first 10 years of existence). These need not be the \nfirst 3 years – a startup ca n defer until it’s actually making profits. This is huge – effectively a tax holiday. For \nexample, a tech startup that turns profitable in year 4 with Rs.2 crores profit, and in years 4 -5-6 it makes profits, \ncan claim 100% deduction each of those years, pa ying zero income tax on those profits.  \nProcedure: The startup must apply to DPIIT for recognition and separately specifically apply for 80 -IAC approval \n(the IMB approval, though nowadays DPIIT recognition letter often suffices if criteria met). The deducti on is \nclaimed in the ITR by providing your recognition details and a declaration that conditions are satisfied. The tax \naudit report (Form 3CD) also has a clause to mention if 80 -IAC claimed.  \nQualified Business: It should be in an innovative/scalable busin ess model with high potential for employment or \nwealth creation. Generally, tech, biotech, e -commerce, etc., qualify. Merely rehash businesses may not. But the \ndefinition is broad enough that thousands of startups have gotten DPIIT status.  \nNo AMT for start ups: Usually if any entity claims 100% deduction, alternate minimum tax (AMT) would catch it \n(for LLPs) at 18.5%. However, startup profits deduction under 80 -IAC is specifically allowed without invoking \nAMT, provided they are recognized (the Finance Act 20 18 exempted eligible startups from AMT). So LLP startups \ntoo effectively get full benefit.  \nLatest update: As mentioned, Budget 2025 extended the incorporation deadline to April 1, 2030 for availing this \ntax holiday18L383 -L392. So the scheme is alive for re st of the decade for new startups. They also extended the \nperiod in which the 3 -year holiday can be claimed from first 7 years to first 10 years of operations17L35 -L43, \nacknowledging that many startups take longer to become profitable. This extension to 10  years was done in Budget \n2021.  \nThe result is a qualifying startup can basically be tax -free on profits for 3 years. This helps attract investors too, \nsince the startup can plow back profits entirely into growth, boosting valuations.  \nAngel Tax and Exemptio n for Startups.  \nThe term “Angel Tax” refers to income tax on capital raised by unlisted companies from investors, under Section \n56(2)(viib). Under this provision, if a closely -held company issues shares at a price above the fair market value, the \nexcess co nsideration is treated as income of the company (taxable under “Income from other sources”). This was \nintroduced to deter laundering money as share premium. However, it inadvertently hit startups raising funding at \nhigh valuations (the premium reflecting f uture potential, not current assets).  \nAngel Tax issue: For example, a startup issues shares at Rs.1000/share whereas net asset value is maybe \nRs.100/share – the Rs.900 premium per share could be taxed if FMV not substantiated to the tax authorities’ liking . \nThis created a scenario where cash -strapped startups faced huge tax bills on genuine angel investments.  \nExemption via DPIIT: To solve this, the government allowed DPIIT -recognized startups to get an exemption from \nSec 56(2)(viib). Startups that meet cert ain conditions (like not investing in idle assets like land, luxury cars out of \nthe funds, etc.) and whose paid -up capital+share premium after issue does not exceed Rs.25 crore (later Rs.50 \ncrore) can apply so that any share premium received is not taxed19 L229 -L23819L233 -L241. The startup has to be \nrecognized and then separately apply to DPIIT/Income Tax for this relief (earlier via Form 2). Once approved, \ninvestments from resident investors (angel investors, etc.) are exempt from this tax.  \nRecent Developme nt: In a surprising and positive move, Union Budget 2024 -25 proposed to abolish the angel tax \nfor all classes of investors19L183 -L191. This means removing Section 56(2)(viib) entirely or modifying it such that \nno startup or private company faces tax on gen uine equity investment. The Finance Minister explicitly noted the \nintent to boost startups by abolishing this so -called angel tax19L183 -L19119L197 -L201. This was a much -awaited \nstep as previously only DPIIT -recognized startups (primarily domestic funding) were exempt, and in 2023 they \nhad even extended angel tax to foreign investors (which caused concern in the VC community). The proposal \nindicates that all investments in startups will not attract this tax, leveling the field. By the latest indications, thi s \nmeasure should take effect, providing tremendous relief. [As of April 2025, it’s indicated in the Budget speech, \npresumably to be enacted in Finance Act 2025].  \nIn essence, the angel tax exemption means startups can raise funds at high valuations without fear of a tax on the \ncapital raised. This encourages more angel and venture capital inflow. Startups should still maintain proper \nvaluations and documentation (like valuation reports, pitch decks, etc.) in case questions arise, but the safe \nharbour via DPI IT recognition or law change shields them.  \nOther Investment -related benefits:  \nSection 54GB (Capital gains for startup investment): If an individual sells residential property and invests the \nproceeds into a startup (eligible company) as equity, the capital  gain can be exempt. This was available for \ninvestments in startups up to March 2024, now extended similarly along with 80 -IAC timeline (presumably to \n2025 or further) as part of supporting startups. This helped channel personal capital into startups.  \nSect ion 79 (Carry forward losses in startups): Normally, a company’s losses lapse if there’s >51% change in \nshareholding. But an eligible startup is allowed to carry forward losses even if original promoters’ share falls below \n51%, as long as all original shar eholders (who held shares in the year of loss) continue to hold some shares on last \nday of the year of set -off17L41 -L47. Budget 2023 had already relaxed this to some extent. This acknowledges that \nstartups raise multiple funding rounds diluting founders be low 51%. So, losses don’t vanish, which is investor -\nfriendly.  \nESOP Tax Deferral: Not exactly a benefit to the company’s tax, but for its employees – employees of eligible DPIIT \nstartups have an option to defer the tax on ESOPs allotted (normally employees are taxed when they exercise stock \noptions on the “perquisite” value). For startup employees, tax can be deferred for 5 years or until they leave or sell \nthe shares, whichever earliest. This was introduced to help startup talent not face immediate heavy ta x on illiquid \nshares. For the startup, this is a selling point to attract talent.  \nAll these combine into a supportive tax environment for startups. An MSME that fits the startup definition should \ndefinitely seek DPIIT recognition via Startup India platform  to avail these:  \nTax holiday (80 -IAC) – need recognition and profit to use it.  \nAngel tax exemption – critical when raising angel/seed funding.  \nLoss carryforwards, ESOP deferral – to manage future finances.  \nBudget 2025 specifically: By extending the incorpo ration date to 203018L383 -L392 and proposing angel tax \nremoval19L183 -L191, the startup tax landscape is made very attractive. Essentially, India is offering new startups \nup to 3 years profit tax -free, unlimited investment without tax, and other perks – aiming to fuel entrepreneurship.  \nOther Tax Advantages and Schemes for Startups.  \nThough the question highlighted 80IAC and angel tax, a brief mention of a couple of other relevant points:  \nR&D Incentives: Startups engaged in innovation can make use of R&D deduc tions. Earlier there was Section \n35(2AB) weighted deduction (which became 100% from Apr 2020) for approved in -house R&D. If a startup is into \nscientific R&D, it can get approval to deduct those expenses (though weighted benefit was curtailed).  \nGST for star tups: No special GST rates for startups, but certain sectors (like EVs, bio -tech) get concessional rates \nwhich indirectly help some startups. Also, services exported by startups (IT services etc.) are zero -rated (no GST, \nand input refund available), which is a boon for SaaS startups working globally.  \nCustoms and others: Startups recognized by DPIIT can sometimes get faster customs clearance, or participate in \ngovernment procurements under relaxed criteria.  \nIn summary, for a qualifying startup MSME, the income tax environment is quite beneficial: they can avoid paying \nincome tax in the critical early years (using 80 -IAC), raise capital freely (no Sec56 hassle), and even when they do \npay, the corporate rate is low (e.g., they might opt for 22% regime after  holiday). Founders should ensure \ncompliance with the scheme conditions (like timely filings, not investing in prohibited assets from the funds, \nkeeping turnover under Rs.100cr during holiday period, etc.). It’s recommended to consult a tax advisor when \nplanning to claim these benefits, to correctly follow procedures and documentation (for instance, to claim 80 -IAC, \nyou must have a board resolution choosing the years, etc.). Proper execution will secure the intended tax savings \nand avoid any future denial o f the deduction.  \nPenalties and Punishments under Tax Laws (Income Tax & GST).  \nIt is important for MSMEs to be aware of the penalties for non -compliance under both Income Tax and GST law. \nThis ensures they understand the risks of lapses and take compliance seriously. Here we summarize the various \npenalties and punitive provisions under each law:  \nUnder the Income Tax Act.  \nLate Filing Fee (234F) and Interest (234A/B/C): As discussed, late filing of return attracts a fee up to \nRs.5,00022L78 -L86. Late payment of  tax results in interest: 1% per month for late filing on due tax (234A), for \nshortfall in advance tax (234B), and on deferment of advance installments (234C). These are automatic and added \nto demand if return filed late or tax unpaid.  \nPenalty for Under -reporting (270A): If the assessed income > returned income (and not due to just a genuine claim \ndifference), 50% of tax on the difference is levied. For deliberate misreporting (e.g., fake invoices, willful \nconcealment), it becomes 200% of tax19L219 -L227. Th is covers income misreported, false expenditures, etc. The \nonly way to avoid this penalty is to ensure accurate reporting or use the updated return scheme to come clean \nbefore being caught.  \nPenalty for Not Getting Accounts Audited (271B): If required to ha ve a tax audit (due to turnover beyond limit or \nother conditions) and one fails to do so by the deadline, a penalty of 0.5% of turnover (maximum Rs.1,50,000) may \nbe levied. For example, if turnover is Rs.3 crore and audit not done, penalty could be Rs.1.5 lakh. This can be \ndropped if reasonable cause is shown (e.g., illness, etc.), but one cannot assume leniency.  \nPenalty for Inadequate Record -Keeping (271A / 271AA): Rs.25,000 for not maintaining required books of account \n(for general businesses) or document ations (for specified domestic/ international transactions, it can be higher). \nMost small MSMEs won’t face 271AA (that’s for transfer pricing documentation), but 271A is relevant if one should \nkeep books but doesn’t.  \nTDS Default Penalties:  \nFailure to deduc t or pay TDS: Penalty equal to the TDS amount (271C) can be imposed. Eg, if Rs.50k TDS not \ndeducted, Rs.50k penalty. Additionally, disallowance of related expense (40(a)(ia) adds 30% back to income).  \nLate filing of TDS return: Penalty 271H can range from R s.10k to Rs.1L (in addition to late fee). Usually imposed if \nreturn is filed over a year late or is not filed at all.  \nIssuing false TDS certificates or not issuing: a fine up to Rs.100 per day of default (272A) – relatively minor but still \nsomething to avo id. \nProsecution Offences: Income Tax law contains criminal provisions for serious offences:  \nWillful tax evasion (276C): If proven that one willfully attempted to evade tax > Rs.1 lakh (threshold increased to \nRs.25L for severe punishment15L19 -L2715L23 -L31),  imprisonment can be up to 7 years. Typically applied in \ncases like maintaining double books, fake billing rackets, etc.  \nFailure to file return (276CC): As noted, if tax > Rs.10k and not filed, jail up to 7 years possible15L1 -L915L21 -L24. \nThe law does allo w that if all tax due is below Rs.10k (small taxpayers) then no prosecution15L21 -L24.  \nFailure to deposit TDS (276B): Willful default in depositing TDS to government also can invite imprisonment up to \n7 years. This is to treat misuse of deducted taxes harsh ly. \nFalse statements (277) and obstructing tax officer (276) also have jail provisions of varying terms.  \nGenerally, prosecution is reserved for flagrant violations and usually after giving opportunity via \nnotices/assessment. But they are a real risk if one  ignores notices or consistently cheats.  \nOther miscellaneous penalties:  \n271AAC: For unexplained income (like cash credits under sec68 etc.) which is taxed at 60% under sec 115BBE, an \nadditional 10% penalty of tax can apply if not disclosed and assessed lat er. \nPenalty for fake entry (271AAD): As mentioned, equal to amount of fake entry, plus on any other person who \nfacilitated it also equal amount. This is to deter issuance of.  \nUnder the GST Act.  \nLate Filing Fees: Failing to file GST returns on time leads to  fixed per -day late fees. For regular returns like GSTR -1 \nand GSTR -3B, the standard late fee is Rs.50 per day of delay (Rs.25 under CGST + Rs.25 SGST)16L13 -L17. If the \nreturn is a “Nil” return (no transactions), a reduced fee of Rs.20 per day (Rs.10+Rs.10)  applies16L13 -L17. These \naccrue from the due date till actual filing, subject to caps. The government has set maximum late fee caps to \nprovide relief to small taxpayers: for taxpayers with turnover up to Rs.1.5 crore, late fees are capped at Rs.2,000 \nper r eturn; for Rs.1.5 –5 crore, capped at Rs.5,000; for above Rs.5 crore, capped at Rs.10,000 (for each GSTR -\n3B/GSTR -1). There are similar late fees for annual returns (GSTR -9) if filed late (generally Rs.200 per day, capped \n0.5% of turnover). Frequent amnesty schemes have been offered to waive or reduce accumulated late fees for past \nperiods if returns are filed within certain windows – MSMEs should take advantage of these to clear backlogs. \nHowever, the clear message is to file returns timely to avoid these co mpounding fees.  \nInterest on Late Payment: If GST tax dues are paid late (i.e., declared in GSTR -3B after the due date or output tax \nwas not paid), interest is charged at 18% per annum on the shortfall for the period of delay16L13 -L17. For \ninstance, if an M SME had Rs.1,00,000 of GST payable for March and paid it 2 months late, interest about Rs.3,000 \nwould apply. If excess ITC was claimed and later reversed, interest at 24% may apply for that period (higher rate \nfor undue ITC or output tax collected but not paid to government). Interest under GST is mandatory and there is no \nwaiver provision (except in cases of net cash tax during COVID extensions or specific relief by notification). So, \ntimely tax payment (or filing even if late but with due interest) is cru cial.  \nGeneral Penalties for Non -Compliance: The GST law prescribes a general penalty up to Rs.25,000 (CGST Rs.25k + \nSGST Rs.25k, so Rs.50k total) for any contravention of the Act or rules for which no specific penalty is provided \n(Section 125). This could cover minor offenses like not displaying GSTIN, minor clerical errors, etc. In practice, this \nis rarely imposed to the maximum for MSMEs unless there’s persistent non -compliance.  \nPenalty for Tax Shortfall – No Fraud (Section 73): If a tax shortfall or wron g ITC is identified in audit/scrutiny \nwithout any intent to defraud (i.e., a bona fide error), and the taxpayer pays the due tax with interest after a show -\ncause notice, the officer can impose a penalty of 10% of the tax amount (with a minimum of Rs.10,000 )16L15 -L17. \nOften if the taxpayer voluntarily complies upon detection (pays before the notice or immediately after), the \nauthorities may waive the penalty or charge the minimum. Section 73 essentially says for non -fraud cases, no \npenalty if paid before sho w-cause notice, 10% penalty (min Rs.10k) if paid after notice but within the timeline of \norder. MSMEs should, therefore, proactively correct mistakes (e.g., use the DRC -03 form to pay any tax liabilities on \ntheir own) to avoid formal penalties.  \nPenalty for  Tax Evasion – Fraud Cases (Section 74): If the shortfall is due to fraudulent intent, willful misstatement \nor suppression of facts – e.g., deliberate fake invoices, hiding sales – then penalties are much harsher. In such cases, \nthe penalty can be equal to  the tax evaded, i.e., 100% of the tax (minimum Rs.10,000)19L183 -L191. However, GST \nlaw incentivizes cooperation: if a fraud case taxpayer pays the full tax, interest, and 15% penalty at the stage of \ninspection (before notice), further proceedings are drop ped (i.e., 85% penalty waived). If payment is made after \nnotice but within 30 days of adjudication, a 25% penalty can apply. Otherwise, post 30 days, a full 100% penalty \nmay be levied in the order. For example, if an MSME was found to have suppressed sales  leading to Rs.5 lakh tax \nevasion, the penalty could be Rs.5 lakh on top of tax if it fought the case and lost; but only Rs.0.75 lakh (15%) if it \ncame forward early. The takeaway: don’t engage in willful evasion, and if any discrepancy occurred, it’s bette r to \ncome clean early.  \nPenalty for Wrongful ITC claims: Apart from the above general framework, note that claiming input tax credit \nwithout actual receipt of goods/services or on fake invoices is considered “fraud” – penalty equal to the ITC \namount and int erest will apply. Nowadays, GST systems catch many mismatches, so the risk -reward of trying to \ncheat on ITC is extremely poor.  \nE-Way Bill and Transport Penalties: If goods are transported without a required e -way bill or with incorrect \ndocumentation, the goods can be detained by officers. To release them, the owner/transporter must pay applicable \ntax and a penalty of 100% of the tax (for voluntary payment, effectively 200% of tax if it goes to order) as per \nSection 129. For instance, goods worth Rs.1,00,00 0 taxable @18% (Rs.18k GST) moved without e -way bill can be \nseized and released on payment of Rs.18k tax + Rs.18k penalty. If the owner does not come forward, the penalty is \nhigher (50% of value of goods). Continued non -resolution can result in confiscatio n (Section 130) where penalties \ncan go even higher. For MSMEs, it’s vital to comply with e -way bill rules to avoid such disruptive and costly \nenforcement actions. There’s typically no tolerance on this because it’s black -and-white compliance.  \nProsecution f or Offences (Section 132): The GST Act lists certain offenses that, if committed and the amount of tax \ninvolved exceeds thresholds, can lead to criminal prosecution (arrest and jail). These offenses include: tax evasion, \nfraudulent availment of ITC, issuan ce of fake invoices, collecting tax and not depositing to government for over 3 \nmonths, etc. The punishment scales with the amount:  \nTax evaded or wrongful credit > Rs.5 crore: up to 5 years imprisonment and fine (this is cognizable and non -\nbailable)18L397 -L404.  \nRs.2 to 5 crore: up to 3 years and fine.  \nRs.1 to 2 crore: up to 1 year and fine.  \nBelow Rs.1 crore (for certain offenses) and other lesser offenses usually do not carry imprisonment for first -time \noffense, but repeat offenses can. Examples: A fake inv oicing racket where a person passes Rs.10 crore of fake \ncredits – that promoter can face 5 years in jail. Or an MSME that collected GST Rs.50 lakhs from customers but \ndeliberately didn’t file returns or pay for over many months can face prosecution (since that is essentially \nembezzling tax). While small inadvertent mistakes won’t trigger this, fraud is taken very seriously under GST. In \nfact, the GST department has actively arrested persons involved in issuance of fake invoices to pass ITC. MSMEs \nshould ste er clear of any “billing schemes” or advice to boost credits through dubious means – not only are \npenalties massive, one could land in jail.  \nCompounding of Offences: There is a provision to compound offenses (avoid prosecution by paying a compounding \nfee) except for grave ones, but the fee can be high and prosecution itself is a reputational damage. Best is to remain \ncompliant.  \nMiscellaneous: Other GST penalties include: Rs.10,000 or tax amount (whichever higher) for not taking registration \nwhen required, f or issuing invoice without supply (fake invoice) it’s considered a serious offense (penalty and \nprosecution), for using composition scheme despite being ineligible, etc. Also, penalty for late payment: if tax is not \npaid even after 3 months of due date in an annual return, a penalty of 10% may apply. But practically, most of these \nget subsumed under the main ones we covered (either a 73/74 demand or an e -way issue, etc.).  \nIn summary, GST penalties can be stiff but are avoidable with honest compliance. The r egime basically gives an \nMSME taxpayer two big asks: file your returns on time and pay the collected taxes on time. Do this, and you \neliminate 90% of the penalty risk (just leaving manageable late fees or interest if a mistake happens). If an MSME \nmakes an  error, it should rectify it, pay any differential voluntarily, and communicate with the department if \nneeded – this good faith goes a long way to preventing the issue from escalating to a punitive stage.  \nRecent Updates and Changes (Union Budget 2024 –25 an d Finance Act 2025).  \nThe landscape of taxation is dynamic. The latest Union Budget announcements and Finance Acts have introduced \nchanges that impact MSMEs. Here are some notable recent updates (as of 2024 –2025) that MSMEs should be \naware of:  \nRevised MSME Definition (Budget 2025): As mentioned earlier, Budget 2025 has approved a significant raise in the \ninvestment and turnover limits for MSME classification – investment limits up by 2.5× and turnover limits by 2×. \nOnce this is notified, many companies will continue to be classified as micro/small/medium for longer as they \ngrow. For example, a unit with Rs.8 crore investment and Rs.80 crore revenue was earlier “medium” (and would \nlose some MSME scheme benefits if it grew beyond that); now it will still be “sm all” (new limits Rs.25cr/Rs.100cr \nfor small). Tax relevance: While tax laws don’t directly change by MSME status, various indirect benefits occur. \nMore firms staying in MSME category means they can avail schemes like priority lending, delayed payment \nprote ction etc., which indirectly improve their financial health and compliance capacity. Also, tax disallowance \nprovisions linked to MSME Act (payment within 45 days) will now cover more buyer -seller relationships as more \nsuppliers qualify as MSME under expand ed limits.  \nIncome Tax Presumptive Limits Extended: The Finance Act 2023 (applicable from AY 2024 -25) increased the \nturnover thresholds for presumptive taxation. Section 44AD limit was raised from Rs.2 crore to Rs.3 crore (and \n44ADA from Rs.50 lakh to Rs.75  lakh) provided cash receipts do not exceed 5% of total14L69 -L72. This is a boon \nfor slightly larger small businesses – e.g., a trader with Rs.2.5 crore sales (all digital) can now use 44AD \npresumptive whereas earlier he’d be pushed to maintain books. This  change encourages digital transactions and \nextends the benefit of simpler taxation to larger MSMEs. MSMEs should note the 95% digital condition – ensure \nreceipts and payments in cash stay below 5% to leverage these higher limits. Budget 2024 did not make further \nchanges to these, so they remain as is.  \nStartup Tax Holiday Window Extended: The eligibility period for startups to incorporate and avail the Section 80 -\nIAC tax holiday was extended in Budget 2024 by one more year to March 31, 202519L229 -L23819L233 -L241, and \nthen dramatically in Budget 2025 to March 31, 203018L383 -L392. Now any startup incorporated up to 1 April \n2030 can potentially get the 3 -year profit tax holiday, giving a long runway for new startups to be set up and still \nqualify. Also reaffirm ed is the condition that the startup’s turnover should be under Rs.100 crore to use it17L39 -\nL47. MSME startups should expedite getting DPIIT recognition to avail this when they hit profitability. The \nextension to 2030 is a major commitment by the governmen t to foster the startup ecosystem in the long \nterm18L394 -L402.  \nAngel Tax Abolition for Startups (Budget 2024 proposal): In the Union Budget 2024 -25, the Finance Minister \nproposed abolishing the so -called “angel tax” for all investor classes19L183 -L191. Thi s means Section 56(2)(viib), \nwhich taxed share premium received from (Indian) investors, is set to be scrapped or made inapplicable to \nstartups. Previously, DPIIT -recognized startups could get exemption on a case -by-case basis; the proposal is to \nmake a bl anket removal, which is extremely positive for startups seeking capital. This change, once enacted, will \nremove the ambiguity and fear during funding rounds. It’s expected to substantially boost investment as noted by \nindustry reactions19L219 -L227. (Note: For foreign investors, from FY 2023, angel tax was ironically extended to \nthem; this move would reverse that as well, treating all investors equally with no angel tax.).  \nRelief in TDS Compliance: Budget 2025 brought a relief for businesses by raising the T DS threshold on rent under \nSection 194I from Rs.2.4 lakh to Rs.6 lakh per annum23L69 -L73. This means MSMEs (or anyone) paying rent up to \nRs.50,000 per month will not need to deduct TDS. It aligns with Section 194IB threshold and reduces compliance \nfor smal l offices/shops. This is effective from April 1, 2025. Similarly, earlier budgets had rationalized certain TDS \nrates (e.g., reducing TDS on some payments like insurance commission from 5% to 2%21L15 -L23 to increase post -\ntax cash with small agents). These h elp MSMEs by simplifying or lightening TDS duties in specific areas.  \nTimely Payments to MSMEs – Disallowance (Budget 2023): To ensure MSMEs get paid on time by their buyers, \nFinance Act 2023 added a new provision (Section 43B(h)) that disallows as an expen se any payment to an MSME \nnot made within the mandated 45 days credit period (as per MSMED Act)22L78 -L86. In essence, if a big company \nbuys from a small MSME and doesn’t pay by 45 days, that expense can’t be claimed as deduction until it’s actually \npaid. T his became effective Apr 1, 2023. For MSMEs, this is a positive reform – it puts pressure on customers to pay \npromptly or lose tax benefit. Indirectly, it improves MSME cash flow and reduces bad debts. MSMEs should still be \nproactive in collecting dues, bu t now they have the tax law nudging their debtors. (This doesn’t directly affect the \nMSME’s taxes, but it’s a noteworthy change in the tax landscape for MSMEs’ benefit.).  \nDecriminalization and Easing Measures: The government is working on decriminalizing m inor economic offenses. \nThe Jan Vishwas (Amendment of Laws) Bill 2022/2023 aims to revise various provisions including some in the \nIncome Tax Act and GST to reduce jail provisions for small offenses and instead levy penalties. Budget 2025 \nspecifically ment ioned Jan Vishwas Bill 2.0 to decriminalize over 100 provisions across laws23L64 -L72 – this could \nfurther reduce the fear of imprisonment for minor compliance issues, which is good for honest MSMEs. \nAdditionally, Budget 2025 increased the time limit for fi ling updated returns from 2 to 4 years23L67 -L70, giving \ntaxpayers more chance to correct omissions. For MSMEs, this means if you discover an income or deduction issue \neven 3 years later, you can still make it right by paying due tax plus interest and a sma ll additional tax.  \nGST Developments: Though not part of the Union Budget (GST changes come via GST Council), it’s worth noting:  \nE-invoicing threshold was reduced to Rs.5 crore from Aug 202335L19 -L2735L47 -L55, which is a significant \ninclusion of smaller fir ms into the digital invoicing net. MSMEs slightly above Rs.5cr should have implemented this.  \nThere’s ongoing work to set up the GST Appellate Tribunal (GSTAT) which will help resolve disputes faster, as \napproved in Council and by amendments in 2023. This w ill benefit MSMEs stuck in litigation, once operational in \n2024.  \nGST rate or scheme changes: The composition scheme limit remains Rs.1.5cr (no change in recent budget). But GST \nauthorities have been focusing on simplifying compliance: e.g., biometric authe ntication in high -risk registrations \nto curb fake firms (affecting new MSMEs in a positive way by reducing competition from fake entities).  \nMSMEs should also note, effective 1 Oct 2023, TCS (Tax Collected at Source) on EPF withdrawal or on foreign \nremittan ces changed, but those are peripheral unless they engage in such transactions.  \nIn conclusion, the recent budgets of 2024 and 2025 have largely been favorable to MSMEs: extending lucrative \nstartup tax breaks, expanding MSME definitions, easing TDS and other  compliance, and proposing bold steps like \nangel tax removal. It shows policy is inclined to simplify and support small businesses and startups. MSMEs should \nstay updated with these changes to take full advantage (e.g., restructure timing of incorporation or transactions to \nbenefit from new rules, ensure compliance processes adapt to threshold changes, etc.).  \nConclusion.  \nTaxation for MSMEs encompasses a broad spectrum – from income tax on profits to GST on sales – and \nunderstanding the rules is vital for su stainable business growth. This comprehensive guide has detailed how \nMSMEs can opt for simplified schemes (like presumptive tax or composition GST), comply with routine obligations \n(filings, audits, TDS), and leverage special benefits (startup tax holidays , exemptions) while avoiding pitfalls that \nlead to penalties. With recent reforms, the compliance burden is gradually easing and incentives are growing, but \nthe onus remains on entrepreneurs to be diligent and timely in their tax matters.  \nBy adhering to th e norms – maintaining proper records, meeting due dates, paying dues honestly – an MSME can \nnot only steer clear of penalties and legal troubles but also optimize its tax outflow through legitimate means. For \ninstance, using presumptive schemes can save ef fort and taxes if margins are higher, claiming all eligible \ndeductions/credits reduces liability, and availing startup concessions can virtually eliminate tax in initial \nyears18L399 -L406. On the flip side, neglecting compliance can cost heavily in fines, i nterest, or lost credit \nopportunities.  \nIt’s advisable for MSMEs to periodically consult with a tax professional or utilize government -facilitated helpdesks, \nespecially when scaling up, to ensure all tax strategies and compliance are aligned with the latest  laws (which, as \nwe saw, do change with budgets). The government’s push towards digital compliance (GST, e -invoicing, online \nassessments) means MSMEs should invest in basic accounting and tax software – this not only makes compliance \neasier but also provid es financial insights for the business.  \nIn summary, tax laws might seem complex, but they offer many provisions favorable to MSMEs. With informed \nplanning and punctual compliance, Indian MSMEs can minimize their tax impact and focus on growth, innovation, \nand contributing to the economy – exactly what the tax incentives and schemes aim to facilitate. As of 2025, the \nenvironment is arguably the most MSME -friendly it has ever been in terms of taxation; it’s up to entrepreneurs to \nseize these opportunities res ponsibly."]